{
  "parameters": {
    "latent_dim": 4,
    "sClip": "-60.0",
    "sr": 22050,
    "win_length": 2048,
    "xMax": "100.0",
    "zRange": [
      {
        "max": "2.0",
        "min": "-2.0"
      },
      {
        "max": "2.0",
        "min": "-2.0"
      },
      {
        "max": "2.0",
        "min": "-2.0"
      },
      {
        "max": "2.0",
        "min": "-2.0"
      }
    ]
  },
  "model": {
    "architecture": {
      "backend": "tensorflow",
      "class_name": "Functional",
      "config": {
        "input_layers": [
          [
            "input_1",
            0,
            0
          ]
        ],
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                4
              ],
              "dtype": "float32",
              "name": "input_1",
              "ragged": false,
              "sparse": false
            },
            "inbound_nodes": [],
            "name": "input_1"
          },
          {
            "class_name": "Functional",
            "config": {
              "input_layers": [
                [
                  "input_1",
                  0,
                  0
                ]
              ],
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [
                      null,
                      4
                    ],
                    "dtype": "float32",
                    "name": "input_1",
                    "ragged": false,
                    "sparse": false
                  },
                  "inbound_nodes": [],
                  "name": "input_1"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense",
                    "trainable": false,
                    "units": 4,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "input_1",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense"
                }
              ],
              "name": "functional_3",
              "output_layers": [
                [
                  "dense",
                  0,
                  0
                ]
              ]
            },
            "inbound_nodes": [
              [
                [
                  "input_1",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "functional_3"
          },
          {
            "class_name": "Functional",
            "config": {
              "input_layers": [
                [
                  "z",
                  0,
                  0
                ]
              ],
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [
                      null,
                      4
                    ],
                    "dtype": "float32",
                    "name": "z",
                    "ragged": false,
                    "sparse": false
                  },
                  "inbound_nodes": [],
                  "name": "z"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_12",
                    "trainable": true,
                    "units": 8,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "z",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_12"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_12",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_12",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_12"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "elu",
                    "dtype": "float32",
                    "name": "activation_12",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_12",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_12"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_13",
                    "trainable": true,
                    "units": 16,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "activation_12",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_13"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_13",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_13",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_13"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "elu",
                    "dtype": "float32",
                    "name": "activation_13",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_13",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_13"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_14",
                    "trainable": true,
                    "units": 32,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "activation_13",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_14"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_14",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_14",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_14"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "elu",
                    "dtype": "float32",
                    "name": "activation_14",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_14",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_14"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_15",
                    "trainable": true,
                    "units": 64,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "activation_14",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_15"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_15",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_15",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_15"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "elu",
                    "dtype": "float32",
                    "name": "activation_15",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_15",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_15"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_16",
                    "trainable": true,
                    "units": 128,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "activation_15",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_16"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_16",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_16",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_16"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "elu",
                    "dtype": "float32",
                    "name": "activation_16",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_16",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_16"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_17",
                    "trainable": true,
                    "units": 256,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "activation_16",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_17"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_17",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_17",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_17"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "elu",
                    "dtype": "float32",
                    "name": "activation_17",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_17",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_17"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_18",
                    "trainable": true,
                    "units": 512,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "activation_17",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_18"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_18",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_18",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_18"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "elu",
                    "dtype": "float32",
                    "name": "activation_18",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_18",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_18"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_19",
                    "trainable": true,
                    "units": 1025,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "activation_18",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_19"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_19",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_19",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_19"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_19",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_19",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_19"
                }
              ],
              "name": "decoder",
              "output_layers": [
                [
                  "activation_19",
                  0,
                  0
                ]
              ]
            },
            "inbound_nodes": [
              [
                [
                  "functional_3",
                  1,
                  0,
                  {}
                ]
              ]
            ],
            "name": "decoder"
          }
        ],
        "name": "sequential",
        "output_layers": [
          [
            "decoder",
            1,
            0
          ]
        ]
      },
      "keras_version": "2.4.0"
    },
    "hash": "1d026814788a38d40465dfee55840ab2bf4b76aa5df534f74060e87a40a25f73",
    "image_data_format": "channels_last",
    "input_shapes": [
      [
        4
      ]
    ],
    "output_shapes": [
      [
        1025
      ]
    ],
    "tests": [
      {
        "inputs": [
          {
            "shape": [
              4
            ],
            "values": [
              "1VM3vxFiz74KNEM++wYkvw=="
            ]
          }
        ],
        "outputs": [
          {
            "shape": [
              1025
            ],
            "values": [
              "5bgFP/z/DD+VeQ8/iOAHP7Y9+T7O7/w+Xs8KP2A3Ez/kIBo/Lu0YP8ocGD+C9kk/ZttkP9V1Wz9NlCg/Jt87P+CyRj9N4T0/mCUaP31nFz+Crhk/I6YXPw08LD87VWI/6K9sPwPKZT9gRko/P7ElPz2FGD+fmxk//lwXPwCrJz/8Wj0/qk4uPx4mGj/zLBU//h48P2VwOz/W4is/iKYkP0pxHz9IQRw/hNYKPxRNCj+1VBU/M5YoPyxvOT+k9jU/FaVSP/TYXz9IGFc/KuY0P36MLj85ySY/+JgXP8BtFz+dVys/mJUtPyGrIj+89BE/LAAeP+gkIj9CYR4/9ncLP+bUGj9w6Ck/FGAiP11HCz+swwU/ctgJP8zsBj+ksQ0/ZykjP5Y7MD8t/C8/UyoaP3YuHT/vnS4/1Is8P9sFHz96NAY/TDEPP8ObDD+Chgw/990UPyD8KD923h8/qG0GPwgbAD+W9AY/UfkWP7AkFD/I8x8/8K0UP8KDFj91XBo/sIkkP0wmOz92uUU/oSY2P2gTDj9eXAE/BmgBP1ppDT+0XRY/5voTPxSSCT9CMQo/iX8MPwotJj/GbjU/GA8tP4aCDz/cRBI/nX4uP3bSKD/gmAk/7FLuPoa46z6AI/c+AmUCP9ryHj8NTjI/OPMvP9jiIj+GAAQ/NLIFPz7MCD/0GAQ/QgQFPzB/AT9MbwM/4ob4PqDkAj8P3Bo/+64qP07WFD/Ew/c+jL8APyX6DD+dkwc/tV3+Ph0RBD8kMAk/UyQFP30ZAz9NmxI/aA0rP1NMKj+4NR8/DakOP6jCAD9CO+U+dD7oPuks+z46OhI/SJccP0hPEz8IZAw/RIQXPyIsKD/mTyE/htkLPxDQBD+g5P8+vLH9Poo4/j6+tOo+1PriPspe8T4ZaAc/1iYXP9euIT+GMxw/GtHyPq+y2j5m0OA+nsnyPgLV9j7kKv8+SmT7PmDgET82kRw/rnAmP4F/JT/SqCw/jwocPyRZ8z7YoeM+LcAAP/J8Dz+CVwk/",
              "torpPsxl4T6orOI+IIoMPxUvMD+bkT8/88w0P3UlIz+jeg8/5qgDP0kx+z4WkgQ/Nhb9PkySAD9+xAA/nszvPpUT7T7+M+k+3hUHPwSoBT9OTfs+HJbbPpAF0z62tus+3DUBP3e68j5etuc+LTDRPuQF3D6AAwQ/eEsFPzTXDD9ZmRQ/+64QPxFC8z4Gz98+QpPiPpAE2j5JeO0+PNbvPqtVBT/F2w4/t6oNP9o2CT/SJhM/ajUTP4jdAT/qbO0+mI7wPrhl/j5D1AI/WPvqPjAG5z4m+P8+mKETP1VuIT8qlio/wMwmPwxCGz9azhc/yaYIP1BG6j4yq+E+6X7sPmug5j7E5/k+8YIIP1hQGz/2OB0/LP4LP/p+CD9IgAQ//6LrPpLp2D5g5Mo+CADNPlDs8j68qfg+HiTiPlV64z7M29o+GYvkPq4kBj8AVhQ/IHAQPwZ5Az+CMNM+J9LYPtrZyz79qMg+shXKPjZ8vj7WSsE+cu/QPi6O5j6A7fs+0g4HP5raAD+4oAA/chr7PuHg7j66ydQ+bL7PPsyS8z4TzgE/vAsLPyw2Dz9MvRA/vCUNP/5ZFD/ySSM/03gaP78bAT/0SP0+mff5PnBy8z4E1tg+utDHPt/3vD7k6MQ+X3LGPuvMxj5kdMM+nCjQPjL/0T4wj+A+9SPtPmq97z6hEPk+6//qPpR++j7CKgc//cX7PvzP/T4L8vU+Y8j1PmUdDj8KyBk/9ZUIP6Bx+D7pyvI+MH3tPjxM3j7X3M8+jK/hPl7f4z6wW9w+4PXOPlY+0z6BnPg+kTgHP2YaAD+Kz+Y+fQkFP35NDD+QGgQ/d+3xPstbBD94IRQ/DvQZP8p4CT9KcPE+EOH3Pi4kBT/I8/g+5VrLPi41yj6OEdU+6I7VPvCy2D7NoNQ+rhzXPpMRzj5SyMo+vUXMPruQ1j6NseY+kt3tPghu8D6Rg/o+J7vWPvGFrj6T+6w+pim6Pp9TwD4lFMA+5K7nPozQ/T4cZN4+xAzIPgxDzD7aWOo+",
              "nJHRPmIDvz4zHLE+rozEPh5l1D70Q7k+xhuqPnSSrD7NQ8Q+TAPWPsCX2T5kfuk+icUQPzurHz8cHBg/tdEAP55ICD+4whI/RoEbP5jSGz/awBM/7B/+PvV25j7xPO8+cuv3Pnlx3j5Rit4+5+3uPo+s5D55AdI+gaXBPspbvz4eaLw+zPTiPriZ8z5gN9s+XjrMPl41wD5K2L8+ft68Pr8vyj5k9to+CIrYPgKv0z67J9U+60PRPp6Ttz7sCqw+4GC/PpD9uz5u964+ArihPtgyqz6gRMc+ww3KPvTvyT5AoMI+2y+uPtKOsT67L7c+2Ja9Plst1z7CisY+su/OPi8LxD4msLg+QCS5Pv9uqz7yVqo+usvbPs9c/D6+jvk+YSf0PnCf+D7Z9fE+nBrQPlSfxj6wXMk+ZEjNPtNotD65S50+5K2qPkizwj6KT9U+IDHYPnW05D5QvM4+Nlq+PqMjsT6oFbw+kPKePnFGkj5uFKQ+rnS5PluOuj6G06g+NvGcPmD3pj7WNK0+kqDCPtrDxz5cfaM+wLWvPgTvzD463dU+1nTCPlBJqz4gaa4+E/CsPkYynj7+WK0+W6i1Pt6ivz5eD+s++FvzPv4+0z6IjrM+fF3HPq5uwD5Tmaw+2jubPoZvmT7B7qs+pUmePngzsj4nh9U+O3vnPunt/j6wQAU/uO/3PitA5z5VlsM+2fnEPqtH1z4GuOk+q9ngPoZIyz6Itqk+qCSwPmSQqz5OZJ4+GIKnPkDpzz5aZgk/VDMEP2Ox0z7PHag+jZeTPs9Olz5XmZA+9ouQPsOgqT6ycsk+kJoGP3ajET98hRM/3HD8PswF9z6kFuQ+3P7mPjO+3D5/y9M+PlfYPjo64j7qa9c+YHjGPgRFrz6w2qg+JUGgPixCsD7rSqU+BVOdPogWkj79P4o+g2mePkQSnz7MK7Q+IhLJPuZ6yz7ox7k+ARLjPoHe7j7mYPo+iGQBP54R/D55GOM+cczQPmBC1j7ubfM+hFbyPhBB1z52/cU+",
              "r6zBPhr/0T6Ox8Q+AbayPjUsoD6HfJw+jJu2PpnJvT4BaLY+uoaZPjjojz7m1ok+DOSQPiDUoz5UW5c+HkiJPiaQlT4uaZ8+ETOxPpB/rD6UyqM+e5GlPhShpz49fKE+hTakPmyNmT528JI+7OiWPvjCxD50Zs0+3EXPPuD3wT6KFMg+2hy3PigVuD4kka8+nR/APm5Vvj5JDcI+R4zHPnXiyD4lBrY+1Kq5Plhvxz70ZeE+35/sPk9c4T6PPOI+rXLMPqNmtj7FK8k+IpHcPsIt1T6unbU+V4+yPu9Tqz54wqg+gX6aPlVqoz44vLw+7v0BPxhFFD+CmAo/OFvsPq594D4TX8M+MqXEPi1Huz78pr4+8MS6PvjqyT7CHtg+YljWPs0+6D6Tk/c+ECz3Pnk5+j7QJQU/QPPnPoZrwj7Rp7I+VainPvY7rD6a/Lc+mPCrPtghuD40bLg+xNDNPlJbzz5JgsE+pKy3PpSrqD42f7U+9N3KPj7DwT70wbY+pfS0PnHCzj5PJtE+wV7EPjMQvz4NYbQ+TLmxPmIFrz50Oa0+OU6zPgOttT7L7tQ+JMv4Pr74AD9mSuw+lse6PtNBpT4sgJg+o+2cPmKNkz6D7Y8+yy+dPrQ2lD7W85g+XBKcPr/FiD5u0JA+1JKbPshtpT7Ara0+dg3EPiKM0D5YD7Q+Sb2fPknfjT5cyo4+oTCPPsJvgD6Wxmg+KryKPhBTlj7K5qI+xJeRPuG+lj6sBKE+rLyhPofJuD6sFtA+7KrIPn6Htj75zJ4+N2aaPtyRlj6m7JY+dnmaPttDmT748po+v2iZPgEZmj7uW6s+/n7IPk4k1T6btLo+jtfDPohc4D4YU9c+CJqsPq1ouD6Qp8s+OCy1Pj5lvz5ly+U+pMjxPmyH5j5DtMs+edzQPiRswT4A9bg+5uTTPm3nyz5vKNw+k87VPiJPuT4lsZ4+kjanPvW6pj6Y06o+/HC5PmJ9sD4kvpo+UP2KPtTWij4IN6k+vWWrPuS6kT7DUIQ+",
              "ECuSPmy7nT7/zLo+U5+6PlBrmD5DsYE+TIV4PuJQej7IEXM+BKhxPmjMdj4y2lU+AHRrPmDthj4is5Y+iKt6Pg62Zj68E3Y+pCODPk+NtD44fMQ+/LuyPolumT5v+4c+ypaMPsg5hz5iw4E+fIV3Pggddj7rn4U+EOSKPhIhgj62zIA+8LBrPgZ2gj5eEJs+evHaPsu7+T6FmgE/kufaPqISwj5zias+4EaePh3xnT4k+4c+2hl1PgZIbT5SR2E++M1nPojbZD7IkG0+FFh6PlisgD7OTU4+9OdNPlAIST5UuWA+kDZZPrT4VT4U81M+vMllPmLGZj40hYI+lkqMPgJwlD7Wb4w+THp5PpjebD5gC2U+kqk0PhxSQD462Do+MgNDPkJPhD4QAH4+DqhGPhBMXz7EuXQ+LH9qPgROZD4mG1g+8OdhPoyXYz6il2w+5K9mPuppdT6O728+AE9LPrbkQz5kkWE+aAekPsLUpj7ufqs+XD6KPmoMhD44bJI+oX+ePvJktD5ChKs+AWeePmJhpT4tVLg+JX6/PqltuT7Pypk+C8aVPlCBlj6mVo0+/rGOPsnSkz5ir5g+UUqOPpscgz6mHnI+GEF4Pt5Ccz6ewZA+AEOfPnyGkz44Y2o+eGBKPhh6Pz5GX0I+Wj5LPiCBdj7DX6U+mVPaPgcrxD4MXZQ+4mKBPuFIiz4U6ok+xIh7PvyLaj7sRWw+JgxYPqAHUz54B1U+pOVBPmClKT7sNgQ+dAbzPdCg9D2giBE+SokdPhxCHD6CQio+ZDU2PuDvEj4qMxY+PDbmPTiYCj5C5iA+sFFRPrI7Uz4sNmc+XgFsPoQbWT5SUEU+gLIuPtTVNj4chyY+lGkSPoQ1CT7oFTs+GoZ8PhYzhj6NdoA+IJ+GPvJfgT78RnI+fIo8Po4qID4WMiA+7CIOPpY0DD4cHQk+WNv+PcB42j0AA+o95MXpPUwO9D2YeBA+MDhJPpibaD5AQWU+kltcPmDnUD5myTs+4OUQPggJ+j0QbPI9",
              "dDvnPURRAD4UYOk9gKfiPXDvJz6klCY+wM07PrwN9z0Qhvg9jKfYPVQl2D1Y4Lg9TPP2PQRZ0T20+Lw9uNrHPSTkwT2QVKc9MKXEPRB2jj2IqpU9ZOS2PXikzj2wZSE9wLdOPAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAACDGgjyADGE7mEIXPUDd3zsAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAGeOwAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA="
            ]
          }
        ]
      }
    ],
    "trainable_params": {
      "decoder_batch_normalization_12": {
        "beta": [
          "nhR4PcHC3zzleQM+VzBVvQtshD63ryG8xDeyPvVETr4="
        ],
        "gamma": [
          "cnd4P9Q/aj/XGG8/LXN4PwHcXz8964M/NDczP18ZjD8="
        ],
        "moving_mean": [
          "zVsXPeN3yD1Z2ma7OL7HvbNjMz5lrV0+Emy1PSEqqr0="
        ],
        "moving_variance": [
          "fVGePnezrj3xIus+pRyFP5nVij9r0Bw+FjHIPA0Zsz4="
        ]
      },
      "decoder_batch_normalization_13": {
        "beta": [
          "JxoGPSEXHrx31YI8En8PPaO/zb1mPDW9NFNcPquThT6ZfHo+qfYXvpOlSL1bEAe9u1XyO2gWiDz1gE4+XSg0vg=="
        ],
        "gamma": [
          "xh2APw9bfT9Yvng/N0R1PzdrZj+DWn4/E1qAP6LQiT/pxWw/HdSGP8rhfT/FfoE/K3R9P4Q7cj95CGY/eaJ7Pw=="
        ],
        "moving_mean": [
          "IQKRvck6Bb8HWBa+78glvrIk3z0bjTC+gkoFvtpwYb0q7DM9UhhPvq9/RD69vaa+qgDAPSW5bj6JrD08aqSHPg=="
        ],
        "moving_variance": [
          "JPakPizVHD5swmA+Av+CP8o+Ej5+J5Y+uOZVPaBazz0zZhM+vUbCPuT7wj61jMA+Pw6GPs2ifj8iXXs+clnXPg=="
        ]
      },
      "decoder_batch_normalization_14": {
        "beta": [
          "//mUvfKPVzqc7BS9/XpkviUlPr7TOQC+yhxDPSVIDr7TO+a9ciPQOumGrLzAeR4+Np7FPKh1zjzuaG29iYMnvTOX7L03AFI+OhGyvQfAJb6huX28pl5DvZofU77fzkW+lPLXO0CKZz2MjxO9eKuePSapSr0GhS29fX8ivWJmmb0="
        ],
        "gamma": [
          "/kmKP4xZgD/HBXk/9A9gP2KNij+T+o0/7ZGCPxiHhz8TNoU/bYV4P9pbgj/HR3Y/m+iMP1cacT87d4E/uv12Px3viT9/jXM/apZxPzD+hz+ASYs/+l6AP2JNgD+mnI0/jnJwP2Fakz+7s4U/8GtzPxZfgz8vIHo/pLd5P+ShlD8="
        ],
        "moving_mean": [
          "J381vTqf9r3EMqQ+pr8xvvXyh70l4v89P6NZPbujNbzgfNe+KgEAuzt1eD0eRlq+M1ETPkqx3T2Br029gm6jPlwbKj6i36a9yCdpPbi2G70kgOQ9KocDPX8REb4bQa49LPcIvTw5j72P4fW9OsGVvtpHBD1b0h2+GIkuPmWKtr4="
        ],
        "moving_variance": [
          "I/7cPhNkZD6hOos+MUGpPXCmgD4J6Hc/gDqdPpYXij58Z9I+eKHLPi4hYD+bAHA/goAePjE2Iz7Yz5g+3SwFP1ZAYD/e/kk+idqUPZMXgj0+mv09FR2CPwHuAz6JVd09E3RWP0U1oT6PltA+H47NPiAouj4t7Y8/9W0rPgviqj4="
        ]
      },
      "decoder_batch_normalization_15": {
        "beta": [
          "sHBYvkHozzut12K+EQzgvflD6D3ibQk94De9vqn8170/9S28iL+7Pb2GmL7mrIW9jgLcPaPi1DwsdFk9OFhlvrFIHr1wJIo9AxFBvngXOD67hdo99eZDvmxqCL6LG8q9OgIwPTpHhb5CkJK998s3vuEGkrxwcE89gMVBPImqJrxUk6M9h/8Wvj0G7L1rniM8MO3nvZ011zwmKFu9N6+9vTvjjb19Rdo9jLQpPrvvEj4Zl0u9WL2Mu46kyr0pmD++g3LxPi1iL74q4Cq+ylDsPZyDkj12cvq9A1MaPGSqDb43olm9vr4bvey+Mj2kNe29qromvsvavLxLspq+8HE2vg=="
        ],
        "gamma": [
          "CnSYP5RSdj9OKIg/uyqPP5HadT8U9nw/ZJNrPzI1ej+A33g/nK57PxvzmD9Oq4A/rIKEP6xDfz+joXs/hauAP1pSez/qr4s///eFP1E0hT/7iYk/6jSAP9rfgj+etYA/KlCEPwG3kj+V8Ig/LlOgP3I6hT+oqYs/B/pyP+Imkj++hIc/RcZ6P3k+jz8MTZE/nZKBPzuQbj9otnQ/YQyCP5NEmT/I234/fBiKP/FFhD9gEoI/uLuMP82aiz9ERIE/BLCAPyntej8bGY4/Y5hsPxVHfT8T1XM/7K6HPw/qij94WYI/zAGMP2VWhT+G7HU/Xx2MP47wjT/ynn4/bbyAPw=="
        ],
        "moving_mean": [
          "hltCPq8gC71vOOA9wXtIPbzMqDxNNte9dvK0Pd6XID4lpm++9vQfvVFRLz4/0VS+ApszvgP4Pr5cUU28k0S+PSYDHT3ZXpe8Wc1IvE9rWD26Zwo+F3B5PhSeFL5+FDS9ExfwvSfYB776DxQ++b4kvYaOHr2DpEi+UWYQPXTjFD0c28o93rIDPZAppr3rvuk9RSd2Pf3cIL05Wc4997mAPUWNTbzHKHy9lBlxvn67r70ySZm9u2BSOpw4v71X67080IqbvkPPPL43b2K6EfipvXXkO76DVpg9ufNIvupqLb6Lj2O9pa34PTX5Ib0+DX2+hm4AvrIUlz3ApVs+JCFMvQ=="
        ],
        "moving_variance": [
          "9/nwPuc3cz/+ork+n0BTPostxT43cYA/8hQ8PjneHD+D+rM+Y/K5PrjW3D5vmDE/8qWGP+WXyz7vXzc/KEgbPu+1jT7FfGg+QmY7PoYfCT9Ryi0+4Dc4PkgpAD8kZxE/M2d9PXLcyT5Y/eg+qCWQPuu+Bj+EvSg+pAQ+P8sx8T7r0Hg/PXKQP+THXj5KBig+rwL4Pkv81j670HY/fjqOPvmHGT/B36w+ugGRPqBVxz5q8RQ/TyPXPkPX4z5Jv3U/meEgP///sT/rfXc+/aZDPtGYoD9qN84+GYHXPmRlgT6MpSM/b/P7PlT9BT958FE/uc2APliEKT81GlQ/I0WwPg=="
        ]
      },
      "decoder_batch_normalization_16": {
        "beta": [
          "GPS4Pd3RP74HdEu91i2XvpnrKr6NKKq+lk6vveG6Wr4t4ji+MNaKvkXdDr3egOM9SHB+vU7dsr6lfVq+9OFFvqgIdL6knGK+Y00bvIFqYb5n7YC+/FgmvvUqob4KGla91JzzvV+Lj74rEVC+dZeMvtHig71x776+rL+jPQ+YC75CAkA9i5xpvl2BIL7NBZK+w7xgPUE+Yr5vNSm+zrywvcZCAb4yK0E+RKWKvT54Gr4Og8c5gVaQvI5PsL0LwBg9oVYQvlCcsb6VxUa+VDygvnMYNL5ao5a+nSQKvnkr/70ZSZK+Zlt7vsIgmL7ndLc77vxcvq9HR77Gziu+1D4RvuMzdr5FV+u9tREOvrkMPb6TsIG+3FOBvbJ3FL7crDM+GAqtvOVwJz4vZm2++j+VvuxY0L02GgK+EYFhvrZiWb5oZYC977OBvjeNl72B8ta+PaGJvsJfPD2HNh2+d7M8vvnZJb6/qJO+79vGvtuRGb4SZ6O+WB7zvvlEBb4cRlW+2Ni7vkEoXr6nC/a8/4qJvgqZB77CNzO+jIxDvl5hUb4NsZ695VRyvXAm2L7nE6i9DX0cvZ4VBb7rfO2+dL9JvktBEr5/lJ496Dg5vvMMrL0x2Du+rVlBvWl6tL2sTRG+zOgNvu7BYL4ThuG9tUtnvnhX67zk92++R82SviK6g70="
        ],
        "gamma": [
          "yz+BP0M1kD/L+XI/8zOTPzaWiD9bKJo/qMeaP7tnjD9gBow/PbyRP74Pij8U/HY/uoyRP31Skj9u0og/hTt1P5F2gD9XqYY/5U6EPz6xhT/nD5M/8zx1P7r1gD9ZRdE/YuiIP/bqnD+Orak/cZ57PymHdz8uYIc/k3x5P6PEgD+otH4/96WKPxQ7hz+2tYg/9mKFP/f1fj/jF6c/kRaBP5Bdnz+Ib3M/WvmsP7Wxrj/0NYM/cnebP65PhD+k9oQ/tAiCP49uiz/Io5o/j+mRP/B9gz/mDYY/s0VwP4NveT8Mm44/roB8P5M7mT9+TYY/KIeSP8bMbz8zAIk/dq6uP5l1fj+2Nps/URVzPy9Vcz+/KH8/0byLP9BXlT+8zoU/51WCPzkfhD/tjHw/4dqFP+GjoT9wqJM/YgqKP41ggT8oBII/5IWUP5CHbj+TKog/vF+QP6/LaD+AGIc/SlKEP9e9gz9rQ3I/0O2uP7XVeD9ZSqc/kIqPPxTgeD+PKoI/fjqHP6MLhz9ez54/JRmSPzQNfD/Ucns/5RyRP0uNgT8LVJg/sdF3P/DFiD9cnYk/Ja+8P+d7lj+oYZk/veCTP5yygj9TJYc/BZOGP3WEej/1jqU/jpuEPxTrnz/cB3U/V4yFPwQyfD8dj34/vAt4P1ElhT8AfZo/0Y+XP7s6hD8="
        ],
        "moving_mean": [
          "s34IPYnB2r1qAeA+sgOGvqpsKb5gXui9hu8LvlTOPT6gNza+nnCGvOfjMT3g2Va9fPBKPQri0L3wJQU9Dk1WPQxNzj1bxg6+lAYjvmZv0z0sOqK7axoLvZi6Tb0XW/q9cXghPYBryz4iIVC+RGzPvRuCgLsqnvi84qohvqVbD75m5Lo7diOtvNTu+j2i+Cq+IM2FPldzsb1cYS67vakmvk7n270XMRm9Ok6BPrQQnD57/DU+IWhtPHSsnD77yIs9501GPugxsL67BDe+F2KMPbn4H77AZ1i+xtM6vU9gxr03/Ws9+T0tvgnWsLr67YI9UuhevhSzcr3WJIG78zp3PQ1Zlb3drpq+COkWvaA3+7zrKLI9ELr1PeEaT74rHHq8XCuYPrmvFT3TQWC9ezE4Pqxj4L3Mbsy93Fn8vcgiyzxgy4C+K4hYPIwPtr6z2L0+4f4yvjoPGT1d+yA+5fsXvgMbuzxibjO9Yj2WPZ9zPj6fl5o+5iMAPpcHb72WmCc9iJahPSuYFL5Gpyg+UTK2vSNciT1xGl++oJYTPOKXAr1z8Gm9dEfvPXnkmr5rXrw+1chOvnG9WT7fSB6+FywTvtfpub0jU/29EnzbPEAorr3krgC+UwCnvZqoVT1NfxW+EN59vtaNAb5hIag+5WhmPn5QUj2hlgu+uYYSvetBhDw="
        ],
        "moving_variance": [
          "IW4yP+HZsD5n/14+HjyiPm+MND7fxD0/9ALpPW6MHj9AvNM+qRWCP4RGGD56pqM/6eMEP7oPBz+7Aik+UbETP2/b1z5i5LM+CxiYPyZiTT8hv60+gmDDPkotpz6fWDA/GaBSP3Lpzj7ViC8+qaokP/ntVT63bHE+j0c+P1Mmcz+PW20/F6CHPqaQUT+5SL8+f90pP/MGmT63lx8/t0IgPw5IIT9rSL8+2YzCPi+c+T3p8hs/xMXZPtkmcD5Re08/xWxzPvyKjz5O4kg/VILIPkAWoz+9WX0+xl5XP6Vi4z4/o4A+DohmPsQYAD9fjtg+AXtWPkDxbz7JXkQ/GpjoPhpWkT5ENmg+QHt0P7sR8z443KA+SDhcPpfAjj9EGvU+8yahPl4ypT90548/MGNBPtmzhT6OETQ/BEq6Pv5ItD7c+BI/nlXrPoJ9CT9TXQg+3VygPhJgaT4XUug+EE0JP1tmMz/8XUY/0lZIPx9mgD7QgJY+4CRcP9MMrT50jC4+oR2IPs6v5j11dM8+u4qAP4+dvz6BaY8/TopGPlE2bz+Rtyo/2S+vP9Yw/T5vZTs/SEf/Pjt6pj5YEys/u7W8PjXgpz+tsR8/7UhQP9z0oT5I02I+C4U2P8o4rz7FuoA/NmCEPi+ZeT5RTUo/6yaYPx6Ukj5elYA+a5mZPlI/BD8="
        ]
      },
      "decoder_batch_normalization_17": {
        "beta": [
          "Mgs1vrL2Eb/agZq+hGiEvor+yb5SLZS7YWaavmPrNb4UB5G+4tSWveznm77VyIK+ZmKpvuPEi75C1UO+wiATv+M9ur55pgg+EURGvqq9h76bzve8cMN2vlm7Qb7LGcS+/l7wvpNO5r3GG6O+YoObvmwHlr45HpK+vi41vrXjdL5BTWy+RpwuvnfIYb5CdQe+vSYjvy7cbr5Dtc69oFIXv0bqpb1nlnS+M2c5vt5emL7EabO9X0DtvidfXb7qYsW+aywmvdiS5Luo3h++a72KvrmL0L6lAaC+ErtSvs7SDL7X2fS9JAv4vTNKVL7e+xq8MYUXvrQJ8L6Dl2i+pBmZvmMpP75FiIK+s12ivv45lL6X4Jm+HBiIvlphqb4S8De+uUvOvRn2wb7Hbwm/KaEHvp8CxL5aMuu+nC2/vvPgqr75qNe+1yZHvSH3er51mfO+Xga9vTheQr6jKpu+tubYvdGwQr4WjYS+gXqZvnWWmb0z65S+kzoPv9mJij33bIm+EnPEu2yoM77AxBa9kxRrvtxITL4hXcQ9PkOnPkBOj74khXu+IFdhvv6g475AaK++KOogvu22Zr6cJVW7Z1eEvs9eI74XzlW+koRLvljtmb5y1US+onSCvqpahr3WVoO+bOaFvibGpr62J5K+YImKvldlu75ruP4970yqPXjB976xTDy+ZiTmvcqrkb67h2S+ZRrdvf8GhT1trNe+291hviMCcb5QdU2+3/oSvRPRyL5AUDm+IA8jvg04Q77qhnK+CWmDvltenL6DVAm+A5QfvaGbSb7KF8C9X6xQvsjBgb5lk8W9QWEQvq0UoL4v3GW+NcumvkS4i75rGcC+KayKvss/0b6FnqW+iWQevrerBL7PtYe+9+Kkvg9gp75A1JC+PBofvoeVqr0uNMS+LS/xvQi2jj1VKLG+kXy3vnhuNL63qX2+DE/VvcRPlL78RGu+IzQQvlLihb2HJyK+GyaKvqHe1r7gk0W+Rk14vOfn6L1L5Ju+DOtcPLHWOj6ELKC+",
          "g007vnezCL5E9sG+3MTJvqpmgL6sepy+bb62vf9Pg7707xe+p9vwvRdCQb4Eahm+5dufvi+gCL+jQoE7RNP3vQ+Plr6xK+u+ZDj+uxVkAr9yjcK+RIO1vrCZfb5H792+oLGwvQOgx75xTX6+wf7Jvm0TVr5Z+hK+NFb+PAHLIj5e56i+t7RtvrQt9T0K4Mu+08ClvsG+tL7mff2+jLbKvKcyur5xhee+5P6OvUFag77vxp879blYvlTidb7WaaW+Z5EAvzvm572PTrq+UoWhvlaEar5MBMG+6Z/YvmiUFL6Glpq+p4q0vnhxjr7/4r++t9gBvv6AAL6N7/m+CoCtvg=="
        ],
        "gamma": [
          "D/BvP7Udsj9bWZU/z/iIP8KUpj8AMos/NzGMP6xfmT+6HJQ/h5WCPxEkkz9+boE/LW97P+g4eD90Z50/fv+IPyK0hj9CN40/UraBPxQEhT/umoo/4v+SPxxGjT9I4Zg/XRO7P8DViz8hpYA/brqmP5C9gD/4f4Q/hxmIPzkDlT8G7XY/pejTP1rtnj9dhH0/UQG2P7Jqgz9rVJM/nW2ZP78cez+rB5M/EUeIP9UHlT+/jqE/oVSHPzRZiT+Lbo4/x9qrP1+BjD/X+Ws/7o6XP3V4lz/Y6W0/wXWbPz6plj+biIw/eXKGP+wncz/tRIM/b6CQP9vOhD9gmok/OzqYP2zifz96zIM/Le2FP7lVnT/ZU4I/W9WfPw0hqD8Y6Io/FSacP2f+rj8/Z6s/d5GqPw4Tqz84EpA/FvKyP+Dmlz96H4k/9ByNP4Ubiz/Db6s/uU9+P8NteT9hJpE/0hB7Pxt+lz8AGoA/qX2NP8T5kT90epM/1Gy5P8Vqzz/sV4s/UlaKP3WBhD/aYqY/5nqHPykJlz/YxY0/1eKNPyiCrz8FhIw/WSqSP2dfrj+UJKA/GCJwP/o/ez8xZII/l1DFPzoehT+5uoQ/YAuKP/aIij+sNYA/n1J7P8zzqz/OK8E/iTWUP0aclj9fz4Q/3KZ9P+pasT8wPJA/R8GMP2HSlj9knYk/2m91P2aglj/cEoo/dMB4P3kJhz9WnYw/0cF9P9aLoz/kPoI/0r2HP4Nnjz/EO4I/buGBPzcNqz9ZtYM/Ot2fPwE9lT81YY0/TNaGP3Urkj97U4Y/0ESHP47siz/7+Xw/U1ODPwUMgT8aKZA/2n65PxQckj8PR4M/vqyDP0I0pT8KuH8/iR6APx1/fj+zc4Y/DY6SP9JLrz+WpXk/R9NlP8Bbvj+cM68/wqSlPzMWhj8EOqc/wOp6P9a2mz9VwYM/tamDP8CPbz/Cnng/Mh2dP9n5gD9j63U/zBGDP/TFpj/Wf4U/SHeOP3Alhj+lpog/wIaFP1LXjD+zF4I/",
          "fomWP+piiT9tg4A/OeeOP0r3gz/vmrI/3jWIPyPQvz+U4qU/vMq4P4ASmz/jXYQ/1PiJP3wboT+dOYM/YR5/P40doj/UIJk/yw2AP1k7jT8hwYs/yQTpPxChlD+lA7I/mKCvPySqxj8ZIYo/sZKJPzfkpj/qc4M/zEyXP3gLkD9Is40/nE6HPxeYhj+QaY0/wuamP9o2kz9C1II/Zb+SP9leiz+3e8o/SJy6PyUAjz9U1Yc/xLCDP9QSgj/v2LY/XaGbP2rKgT+bMJg/1rCHP48UeD88Vnk/yNGyP04Tgj8YVYk//6CcP0RgbD80s9A/utKuP1tvmD+1PJY/8XmQPw=="
        ],
        "moving_mean": [
          "pefavX6kBD5KPVa9vAetPQabFL7q16K9sSHVvHeqcb4W7iM+wk1yPQs4Sb1xyaI9Z1hevnPkTb4CEji+iaPbu/iktr2tB9w8EsQxPrHfPL75u8G8M18HvsFVxz0mSGW+OhZYPskTDb4kf9C9SfP9vIZk9L2S23i+ppM8vuQ3WT6UIUo96oG2vQq8jL1sOew8g9vwPdlqF74oITC+aWVRvW6Ay7yTd6M9hS9NvvVXDj3qi/O9j0BFPRHfgD48lX+9nIrevCr2LT4pe2m9veMQvt61IT7tGoY9H8oSvf8Alb3fiU09qaYrvmB0h70TU2A+aqC3vbcq6D03g928+wROvG5wOr5d8QI+WaaBvNIahz7DHZU8amcnvuB+RD3R1GC+h3Y0PYNyLz7BpQ6+D2afvvpBtT2YoKW8YSiLPDId3D3Rvhs95Be3PcpitT19FiY+w1snvvNoP74XZNq9XSs1vDblij3g64s9MhslOhfn3D1AT3Q+BoRQPj9cd71XiXi+VeRYPo6NOT4BBty9vOEIvmDbs72uPLE+Pn9NPj8tsbuv0Yu9KxXwvLh8jDzKPMy92UYSvjdeBr00KhA+Fby7Pc+7WL369qS93fMTO31gDj7aOxM+JNadvRxY2b2YCsW9aFVsvWAJDr7W3OG98y2Uvn2x5j0dOge9Hs5ZPFXLKb2Ms+O9Fas8vj7XBDyqYWQ9jdXvvU66GD36YeO9IZ1EvpR3gD32ILQ9lm8FvG6eeTv21yu+zuNavpRT5LsdcDm9qG0IPQXFiT3Y99k7cb9jPuOJIbrGaFe9oiUWPFcBjL0DL4g98825vZOjJb3Kgzq9wauGvYCiUL5O7jk+siU1vXvOnb2Bzwu9sE71vNxOdb7uGFm9gAVhPiP8Mj0ypQC+IlvnvaLhK76+4dU8jdrnPfU6mD5PvMW9ha0+vbmHXD4YezW+CMmZvWzdDzwKDti9wSCwvAkoq700QqE80eibPGJ/aL6zWxy+0G4yPgh4lb1uubA900OHPTu1bD7nBSk8",
          "UcOsvddh371IG2c9a28dvsw2j75BfKs8TNcNPpts3L3WhyW+A7pOPnJ3Yr5qrNy9yg8hPirUgj2n70i9NKB3vFG3Ob6Xvky95EglvjJYar3oxyC+OVYhvLLKyT3JZpy9Il42PRfzHj3oeFc8qpQdvm6UpD317wy9UgmnPdNwzj2b99u99PWQvjf/lD7Ccvk91bAdPlEwVj3p9Ni9EVkaPSun471X26I9Ke03vq/vuj0uPOA9arl6PfsAgb7bE6W9KE8fvT9qFL7wIps9AeYqvSMMTr30Y3O+mOZIvgbjT70r2W89aP3yvTBsn76JaY88aBgkvQpRtL2ytnE+SoZpPA=="
        ],
        "moving_variance": [
