{
  "model": {
    "parameters": {
      "latent_dim": 4,
      "sClip": "-60.0",
      "sr": 22050,
      "win_length": 2048,
      "xMax": "100.0",
      "zRange": [
        {
          "max": "2.0",
          "min": "-2.0"
        },
        {
          "max": "2.0",
          "min": "-2.0"
        },
        {
          "max": "2.0",
          "min": "-2.0"
        },
        {
          "max": "2.0",
          "min": "-2.0"
        }
      ]
    },
    "architecture": {
      "backend": "tensorflow",
      "class_name": "Functional",
      "config": {
        "input_layers": [
          [
            "input_1",
            0,
            0
          ]
        ],
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                4
              ],
              "dtype": "float32",
              "name": "input_1",
              "ragged": false,
              "sparse": false
            },
            "inbound_nodes": [],
            "name": "input_1"
          },
          {
            "class_name": "Functional",
            "config": {
              "input_layers": [
                [
                  "input_1",
                  0,
                  0
                ]
              ],
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [
                      null,
                      4
                    ],
                    "dtype": "float32",
                    "name": "input_1",
                    "ragged": false,
                    "sparse": false
                  },
                  "inbound_nodes": [],
                  "name": "input_1"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense",
                    "trainable": false,
                    "units": 4,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "input_1",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense"
                }
              ],
              "name": "functional_3",
              "output_layers": [
                [
                  "dense",
                  0,
                  0
                ]
              ]
            },
            "inbound_nodes": [
              [
                [
                  "input_1",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "functional_3"
          },
          {
            "class_name": "Functional",
            "config": {
              "input_layers": [
                [
                  "z",
                  0,
                  0
                ]
              ],
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [
                      null,
                      4
                    ],
                    "dtype": "float32",
                    "name": "z",
                    "ragged": false,
                    "sparse": false
                  },
                  "inbound_nodes": [],
                  "name": "z"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_8",
                    "trainable": true,
                    "units": 8,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "z",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_8"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_8",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_8",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_8"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "elu",
                    "dtype": "float32",
                    "name": "activation_8",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_8",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_8"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_9",
                    "trainable": true,
                    "units": 16,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "activation_8",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_9"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_9",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_9",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_9"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "elu",
                    "dtype": "float32",
                    "name": "activation_9",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_9",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_9"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_10",
                    "trainable": true,
                    "units": 32,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "activation_9",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_10"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_10",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_10",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_10"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "elu",
                    "dtype": "float32",
                    "name": "activation_10",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_10",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_10"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_11",
                    "trainable": true,
                    "units": 64,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "activation_10",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_11"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_11",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_11",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_11"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "elu",
                    "dtype": "float32",
                    "name": "activation_11",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_11",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_11"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_12",
                    "trainable": true,
                    "units": 128,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "activation_11",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_12"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_12",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_12",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_12"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "elu",
                    "dtype": "float32",
                    "name": "activation_12",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_12",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_12"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_13",
                    "trainable": true,
                    "units": 256,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "activation_12",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_13"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_13",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_13",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_13"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "elu",
                    "dtype": "float32",
                    "name": "activation_13",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_13",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_13"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_14",
                    "trainable": true,
                    "units": 512,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "activation_13",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_14"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_14",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_14",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_14"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "elu",
                    "dtype": "float32",
                    "name": "activation_14",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_14",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_14"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_15",
                    "trainable": true,
                    "units": 1025,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "activation_14",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_15"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_15",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_15",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_15"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_15",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_15",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_15"
                }
              ],
              "name": "decoder",
              "output_layers": [
                [
                  "activation_15",
                  0,
                  0
                ]
              ]
            },
            "inbound_nodes": [
              [
                [
                  "functional_3",
                  1,
                  0,
                  {}
                ]
              ]
            ],
            "name": "decoder"
          }
        ],
        "name": "sequential",
        "output_layers": [
          [
            "decoder",
            1,
            0
          ]
        ]
      },
      "keras_version": "2.4.0"
    },
    "hash": "98e0a9a486eabfb0ce25e621c7b4411ad5e4b3cb55092223be51a28192551d24",
    "image_data_format": "channels_last",
    "input_shapes": [
      [
        4
      ]
    ],
    "output_shapes": [
      [
        1025
      ]
    ],
    "tests": [
      {
        "inputs": [
          {
            "shape": [
              4
            ],
            "values": [
              "H1YjP+ywuj9ctc++bdnwvw=="
            ]
          }
        ],
        "outputs": [
          {
            "shape": [
              1025
            ],
            "values": [
              "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA",
              "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA",
              "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA",
              "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA",
              "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA",
              "AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA="
            ]
          }
        ]
      }
    ],
    "trainable_params": {
      "decoder_batch_normalization_10": {
        "beta": [
          "rBnqu8a+uDy5KHO+YbI0PvILh7oDxhU+gntcvYf09r1xF9k9OE2dPRI/NT5CO8y97K1PPnUbN775PNg9t5qqvuq50L3sEcW9c1DevcIajb2xa6O9XRkAvo4qMz2L5mi+Rew3vnGjIL4Pn8G93WffvVSUgD4zY8Y947e4vbcMR70="
        ],
        "gamma": [
          "uvqIPzLfdT8ZpYg/cxSQP8y7Zz+4w28/7nqXP9TUez9C5XA/qC9zP/yGej9CI3w/Hap1P/LBjD9BcIQ/jJ6MP8VMhT8cnIQ/ciZ6P4zgeD97uno/qpF2P3/Ugj+Q1YM/X8t7P4kXaD+qVoE/RIqTP07chT8hLIw/5qh0PxXogz8="
        ],
        "moving_mean": [
          "/cw+vmArAL4NhwQ+PrRlPsACED4CV1g9rhogPNl7TT5Ul06+ByioPTOiAb6prUQ+jpMcPstNJj7qtRE+hpyCvc+yvTt383+9IblUve35Fj4puPo96xsqPoj1HD7ywWe9JhP3PVvmeLuJqAK8hIADvkILLD1vdNY8toMePkcL8D0="
        ],
        "moving_variance": [
          "jyWOPvsKfj5oKvE98I8GP7t8qz5m3yI/m3k6PXjj9j61rZ4/NWicP004OD6x/Aw+SfLfPubLbT6ISCc/aDhaP2bhHj7NdhY/+veNP022Gz//AQI/iZdYPseHKj4vOmc+lD0GPwEVFT5wzKA+Arl+PWW/Hj6NqR0/rC7OPuDoIz8="
        ]
      },
      "decoder_batch_normalization_11": {
        "beta": [
          "lNzYPdszV74nPc29mfpdvkOpVr73cRC/avGBvuVsNr479kG9fPOevirDaL5jG4O+8S20vT43eL4zCjy+U524vjWjfr5No5i+25zVPYyM/734T72+DJfWvcnlH73N256+k3wgvmAJ0T6AQ7y9bQczvkxnaL5l4Oc9W6Ufvc6Kij0KB4M+uimWvdwFcr0mN9Y991i8vdDsr7yImSG+XFVfPbvc5b2dJH8++DoUvgVeQDzy8FC+LwNJvthfxb3ZvUe+TFYePo7Jzb5uEui+of18vkM4Ub4jGek9sn53O2hUJb79b86938eQvnqOub0VR1y+KZfLvk9GAD2rH4O+iXByvA=="
        ],
        "gamma": [
          "FGBvPy4AkT+MmoY/bhKxP8gcgz9fyIQ/PW+EP2HHhj89rnM/wcSCPySxdD/ZGIU/HlN6P3AjiT+9xYE/n2+FP6SEhD+klYg//wl3PxAqgz+NBH8/pUV4P8nKiD93Coc/f0GGP0fChT9oDII/Pox6P9wlkT+n5oM/U6SAP/56iD9h5Is/LgWEP5KfdT+8RYU/1Z9/PyzOdD8Ca4E/qLqBP3bgij9ja2o/EoCKPzFEbz8JFI4/0r6HP7mEgD8rd4c/jMmCP430hz/Mi54/qx2AP71Ykj/k5nE/zOaGP+D1cj9kUoY/JqmcP8W6ez+Klmk/1heIPzfZcj8Er4g/dtFfPw=="
        ],
        "moving_mean": [
          "uF6MvkASWr3zZSw+DvnQvdkkhb7pDec9kt9CO/bT7Lz/kHK93rRDvgZqF74nUX0+4DRZvuLHpb1HnZ+9It35Pb6ELb5VLi88/NmNvT17Zr3viQM+7IL0PebNOb3JgDM9R5XdvfcoTzlk5oi+S7nVPRodz73U3EA8yNVKvmfx+byYm309Rs0evqZxxjwkT369QEOBPUXPyz1sGH4+pZNOPVLhvT0by909TyDyPeiqSD6aFrk8r4oBPVQ7kr5SE2e+C/1xPEiZhDxdOZm9IOK8PKc8UL5bisU6qqUDvSimcbwTeQy+FGOrPCEodD2td4e87OXBvZD1Dr7NXiG9cgHSvQ=="
        ],
        "moving_variance": [
          "UV8eP0+lHj/5e5A+BouTPth/sT5B+yc+/q6TP5WvyT4w5Zs+6BZBP/wK3T4GaTE/uTtrPqPkJD80zAI/W8uaPq2Y1j6jAJQ/Z4fLPhhmAD8H99A+XzECP0b/dD84QTg+S3hJPmgieT812JA+uPk5PofWlT6zJa4+oBDdPf67HD7O0h0/X1CgP4CAaD/iM0I+JwoBP55L1D+jJ4A+x/ECPqhzSD6/4zM+hXvSPUynhD/DzkA+jVuNPlZHqz7gn4s+Soy6PtKr9z7BToU+w4AlPyjq3D0RSx8+OlC/Pou8Aj/Lxc09/VVFPhO1JD8Jkws/07M0P/P6Ij6FuSo+PSB1Pw=="
        ]
      },
      "decoder_batch_normalization_12": {
        "beta": [
          "RZCJvlfpEL5Euru9mKvfvgdwH75jG4W+8XjsPQs3nb5ntx6+rWRevioGAz67mmm8eesOv9MiyT3a9Cg+kqAkvnGcOb6qoL++SP9dvqRL1r6L5MO+PTgPvlzJbz2iaBK/58tEvmuiQb4nUAK/L0levTJa/b4UqYy+gMIIvsHLl74f24S+2EtBvrY7Mb5uEKY+mr0Xvre0J74OGki/KvmcvlKNm75etQ2/yigIv2ysjr58d3i+YtshvmnDAL8Rj4u+aDHTviwgDr64m8+9FrZevqK9k76pyTi+0dSFvt+JXb4W/W6+ZMT8vW4nib3o38+7HxKkO68Qsr5FPRC+i++bvgy4Bb9noKg9ev5ZvoLLN72ROMy9eEzuvn5GAz1VzxK/WZ6GvmPJ4702gJ++1hIov+yuzL7Th02+CJo+vmKJqr4l5c6+q37XvZdFvL6ueoC+uw0DPkSIxL748k6+djIJvmKLZT3nCS89SLyivvQo6L6AEAm/pfGJuqgAk77YMeW+gOh/PRe/e77WBYS+jF2kvn8YTb6FDhi+tlEpvjdcFb2upui9nuLNvnbXFj61nx6+220jv1cE+b4WQEe+iZxcvhGgEL6f86++Ad/UvS+pjb4ZVxi+uDQmvpA7CL5UfWe++xaXPIbNN7ysZpq+D8+Avo+zNb4sCBu+IEWtvqymyrs="
        ],
        "gamma": [
          "o3CLP2uqhD80c2o/dxKBP5hUdz//J38/HkCEP0ecfz9yqYM/qzt8PwjMgT+SXHs/LSKKP6K8eD87O4U/uBqNP32Hhj8h8IM/tmmNPwsjlT9Yfnc/wE+lPxRmjz+tdpU/lsyCP5ZyiD/jlI0/KnpnP+6wgj97+ns/LeWEPynmhj8hQpQ/WliKP/3ipT9Lvos/KpqmPz+Uej/mTKA/7w6SPyXmcj/4ysk/sNuNP5abfz/iXIE/PqeMP4CZhj9mTtc/xG+SP6orjT+u8YI/ofSAP4H2hz9tMow/L5m7P7G3hz/FSn0/o76CP6pigD/E8Jw/pm+DPzQQgD+hvok/PtSHP0EHlz9Qk4c/mUiEPwdziz8Ul3s/U9+JPyu0mz/ai6c/PYmBPysqbD8rHn0/Pq2WPz6YiT9WlHo/B1aNP5PMgT97RII/zPhrP9AohD/3/JM/6xGSP9QphD8PP4M/XZ2HP+RokD8c2Hg/zFujPwptiT/9lYU/okWkP7f6fD9PAoo/vDeBPzyprj9zX8w/yOaJP3oDhD+eJIM/co6PPz3JeD8ZUHk/MAKSPwtogj/PG4c/ZWiEP5WUgj/X9Yo/VuCgP7QCkz9EApA/uEOAP2Z6aT/yXoA/kT19P43YgT92TH0/mJeBP8Q7dz8Nz30/UjqCPwL4mz/+F4I/HSmDP3pekD8="
        ],
        "moving_mean": [
          "W2OvvbmZEz0R1Xm9Ba+DvSGF4D3teCa+fg8RvWvJS74MRJA9RpcyPigD9T0XdgQ+23gMvvAyCz72xoy97ITZvcxXUT7wj6S+tGgAPO7Dwb5xnJc9p8njvUIYtryqeoS+fhKVPaGnBr5I9QU+w9gcvo0DcD0Mpji8kAAiviBB0r1dFBK+UxmivHTLmbx6/Go+LHX5PV54uT3YzZu+kZSXvlseRr0xwTU8CMdvPPNBhr20nE89e0b2PY2mWz1hCms9UnKhPdaf7LwSuEO9BELQPdZ+H77u58o7xW5KPvJmWrzvdUw9C8nFPVQFUTxU6ie+t+fCPdoRTT0gdx4+o6o2PVo7Cb6KAVE+3zO6vKVu87woype8/d+vvDBR37yz5Q2+RDaNvX3po70sTtW+r/lvPUPQO76FEjS96UJfPaQo7Tt1frA9J57VPeDvrj3UvwY9AGbzPRPjprxKAga9+bYKvq3Z6j0z60U+bvbTvRFqjL6xtZy9qOlmvc+76z1onPQ8V5SovHlmhL4YBAu+2czZPVwaoTwZ+mQ+U2oOPMO4Br1jldi94WwmvD59Pb6ZqzO+lREcPUJQHz4HHai9jVa6vdrBND1Jowo93J6qvdFxGD0Kpxe+WVaIvfp1GbwQtMK9XJoUvlHoAr5dRmk9Wc9svAs7lj7pwZS+wZQEvjE+JD4="
        ],
        "moving_variance": [
          "okAuPveweD7j9Js/IyazPu0DfD9AwuY9yrhnPp+w6D6Vv4Q+K7LDPiFIZj6WuUw/W5ZAPiJ/rD+XF1o/1lIBP9DESz6nX6A+lZmHPzKvkT0kkJk+YyZFPo66eD74HQU/o4KTPzEzYT6KGcA9tQy4PzxGUz409vk+MmFkPy86Bz+vJqs+U+8FPxbGHD7x49M+Zn6cPsIw9T5AAAs+KdKxPdFpvj5Qe4w9qGAuP1XMCD8TuqA+zQ84PtX+tj79PkA+Jj57PivJFj41YAk/HW2bPnFVWj//3hQ/WMzgPucg8T1/97c+ek1TP6ZXyD5AdXU+czuFP47wST8xfg4/gu/TPnwJST7FzJM+EymYPgYEZT8uIxI/ESLMPeahVj/r1Es9NLCyPj4SRz+mmaM/WLPTPq/yKj4wUe8+tGmkPaqZBD81X0k+A/z/PtX84z4BW+I+5oMVP4egnT7cI/c+IsdsPsd6kT6fwhs/4f3IPX/lvT4ytag+LOW4PnrTiT43Mog/boLfPpGbij7gsJw+DX6+PnA6lz+oX7c/iB8rPi6+3D/93PU+rQYZPiCV2z6+BwU/xLt6P76UIT7ETz8+tM5GPk11Hz7IbkM+XoCKP8xBCz+oAgo/Qsl1P5w/Kz+IK10/sS4BP/wLJT9zHwg/91ZpPhwVyj3y2J4/UBc6P7f1Jz4="
        ]
      },
      "decoder_batch_normalization_13": {
        "beta": [
          "okH3vi0C575zQC6/b55SvmJRbL1uyjm+6sz4vuMMC79/25y9n+CHvi9kTb5cdwa/Lr2lvSoEGb+DXnm+22vNvvUNFL65ewe99PgFvUz7L76hIPa+qA9xvDYKKL+ftTq+OxtDvvdVGr+Fe7O+dsm5vZfuKL1OCNy+uBaKvdD3NL7GWiG/4ZPVPf5Cbb37zoe+yyUmv90Bqr6dYRW/6/T4vtwpFr8r5jI+dH7VvojcOb4LNZS9jrUDv4hq3r77Sxq/kZ0vvi7spr6HbuC8BRGwvpVVT74JzF++UOuXvlRJ2b5WeJK+3MVLvjyRrL6Y46I88BkBv7PX6L7W4Ao+FxGdvtG6Ar5loXu+CcEnvm04lr7LVoS+TValvj50Fr/7dkG/3WYCvwXrHr9y1eu+rcBFvSlEHL8JBu6+IOJlvRjR8b6UVaa+G+H1vlGLGb1KLP6+KFZVvmrMKL/caau+YsSnvhFku70Xwgq/U5AdPa4LE796Fsu+NSvqPXwjGr8RqcY9GqyDvmpKfb7Mq0u+mGqvvmig0L4s2ga/sRjTPAW3Dr9b/4K8AZXDvmJGDb9fkqK+Xd8Bv7R/aj2HXOe+BRycvUURiL6IAYm+BiuDv8jYejyT6yO/hCrFvp2elL7gLOK+R5lNv2GzML49jj8+4hkVvuZF4L5uuc2+asBYvtRhPzx9N92+DhINv5T9czyH/t++lt06v0NfFDyLWta+d3RYu1M89r45HCW/1e4lv9Qo7b4R6H6+nfJqvx5D4r6QFci9gBoWv6y8L7+aoHW+GoUNvzlkz7756Ja+0djCvlt6476mkxe/6AkGv9Sorb074sa+Ow2wvmP05r6UUpk+nQFMO3r0Wb7P5dS+hWt1vuzQU77o09m+KqOvvrXP8L662PW+GwW4vkjTz744PA+/bUxMPKlXuDwOrMq+iKOkvj0rRL5C1Ki+N3YevzZoWb5X9nG+JYafvmUyxr5gKk69Ye9Jvm/0+77CSWK+PFEEv1eodL4i81G+cWLRvpS5kL5hGju9",
          "E/0mv8KL5TxQBgK/IKgHv1OfDr7gmp+5zd/uvhzvxL6KIf6+UVMFv3LBHb92uYI9RV3qvvpwT76Y50G/5iHvviAavL6Uwi2/iqTSvu080r4qTQ+/RGjRvi9LM76CI+C8z+tqvqi8gL7tEA6/7hJPvrKi/b4BjdK+Bzv7vrtUr74IZkw+wO+8vumKs74oj4m9X1O5vT0wlb4hcvS+SfplvhLDCL4TyyC+UoIpvuxgYL/8UHG9mSl/vlVAJb70QiO/Lf9KvZoPAr++gxW/O5GIvlNFhL5h4wO/9aCsvi4bAb8FpLG+I5pFvvE+BL9xI7m+xgRFv4ymCb+izAO/WwOCvg=="
        ],
        "gamma": [
          "HeigP+UguD+dSXM/vO54P+8Fdj8f8Jo/L52IPzqwij+Qlng/qAuMP6bGiz+sGoQ/MRWNPwDfjT9lnno/hlqSP528gj9GvIA/P3yFPxgSez/KO5M/FTFrP/rplz+JOYo/KP6DP3PMkj/Xro0/gR2iP57XfD/LhI0/CgaGP6PPjz//QI8/I05lP6piiT/lF4M/xzKcP/1iij8pDag/dKWDP461kT/Gx4U/KyaOP4dziT8pvJw/m1yeP8PYiT/hS48/UBiBP7xJiT9Zc40/y0GOP1mhlD+nalY/MGd8P5zGiz9+sn0/FtaXP3YYlj8OcJg/3UuUPxgNkj80kpA/0hSUP2xbgj8Xkok//1SGP3wmnD/sxaI/5ziBP1W6oT8Lr5A/R5SUP/BzlD8R0Zs/Zf2QP3lbjz/Wz5Q/PgePPwXIhz8s55A/oOaEP4WLej/wwpo/BX2iP7Mqlj9fsoY/jcB5PyhlhT9e9rU/hl+NP/dgmj+lQ5k/atOEP0tCkD/kAZQ/3zqYP7h9fz+L1Yc//o+KP83Kej8gC44/D1WMP/1NlT9/rZY/zr6KP9slkz8DdoM/beGVP4Eqhj+pT4o/5lJ+P4l0mz+4SXg/xoKfP+6dgT9n4qM/qiNzP5Djdz9DQ4A/oYeNP0KYlD95RJQ/3giWP6/uiT/nY4o/G/aJP05vij8HL4s/VUSrPyxejT9aGYY/W9WNP2Ljij+3i4I/MCWcP+jsjj9cx48/uDCMP7rgpz+ETr8/8PWnP9ZYgD+2hIM/NZ+KP62jij8TLYM/braXP+48hD8ODJw/oviFP73Plz/93oQ/X6CSP0hskj83LZY/FfaGPxr8hj8FTJk/Cq+GP26XfT/6XYI/TOyjP9lNkz/KzJ0/KN2GP/sEiz+jL5o/2PWSP4UVoj8bqY4/mnGKPwCxnT+J8Yw/1kyKP4tphj+476E/YshvPzihhD/KVoY/IvqDPxibgD9vxJE/vCeSPz7UgT+nKaA/6GKTP8JnlD/nI5U/tZuGPzs0hD/sQIM/",
          "lReQPzRrij/Idpk/4omyP0Y7fz+1kIg/qMmAPyAViD/bUZM/7u+NP5gFjj8vxoo/sZOTP5uTiD9ltp8/JgyJP8BNoT/+HKo/ol+MP/senD968YU/zoqCP+Jthj++mpk/mjG4P9Vniz/TGZo/IDyKP9+/lT+lWog/XA6IP+33jT+XW44/JC9yP95LnD+R4Yk/8FqEP6rfnz+eb5I/FEaXPw0WgD8qnoc/ep2PPwMprz9can4/59+mPxNpkT8+W6o/aweLPxlrnT8Cxbw/SoeKP4LMkz9nOIM/wE+TP2Zeez8H04w/PSmPPwRumz/kTKo/VU2XP1oWnj/RCI0/py+JPw=="
        ],
        "moving_mean": [
          "XA3+vfcRNLw9ddK9Yqk1vlGPaj4+G3Q+SLAnPRualrwrLrS+ZKftPRyGbz3I9I6+M/kaPS1xHbyA6ei+SPcDPj7RLj53xQ0+9qN7Ph3CDj1Cz768fFMpPhTLtz3WyV09W6yzvRMC1r142Ou9tNIcvcWyq70Ftru960ZGPSoI473liiU9gN10PnGUt7ynKWI+UFIXvcQnTDxchA2+78q3vcDcSLtOImE+UCK9uuYxNr5Iijc9/sQKvkaqtD1vC6Q8NZUaPlk0lr3zDW8+gkhVOs3gB70qRWO81JDFvicKxz2oQRG+Oeg3Pmq9+D1UJCE+yq9gvTkosLuutwM+0zmFvmXUpj3oN1u90g6hvXOOBz6cSHO8SsIxvhgm2b2T4Ma8KHbIPBBqK75qFK69wJUvvuBqYb0XAnq9y9rJPWjfCb6eE4Q9hzPsPILys76fmam9dcZXvLzU7b2YN+k9XuISvlETCT4Z1dG94XbUvdny3rwPomk+RJtRPav/F75T9XQ95EwvPBuRlr7z2Ja+tf4PvoiIjr6W1ya+OZ6VPnlAL75WTTA9NzJ1PdM9gD2spWO9c6Y/vvuWD75cX7o9u4IPO/eSgDwxPbO+UNMLvacIf70M+6u++GsFvvRWgz3fFxG+LDjOvTeHxD1eM9c9BwvZPKZshr0Mhsi9ZCVXvoPUjD4C21K+9IuePePDUz7HpQK+BUO6ves9HT2yjAy9QDgPPk2pob103CK+oAtMvZqMiT0QIH8+bGCiOybX9T2iyrg9dB5GPb0Qob7wh7O83V5/vKqeRj5YOLE96KzQPKsDsL7u5VK9Sf6RPUqgjjuiyqG90u0xvpQ2QLobQOw9rJCaPLLXy75oWhI+FQdwPhtq1zt+4Wk7LEfUvbo/Az3q+Es8wp/FPfXtuL3sGV6+6UbKPQ3EUz571RA9CPjcvWDTND2DHPW9/+hpvn4yDT4KWHo9Ufy1vDsgq73IRgA+DaL2PRQFk74Sc828hllXvqrbh7xWn9M9/5wvvTVgg77H+T0+",
          "NaiWPWRpUz18cBy+/M0hvYWcjz01du491somvi2zEz7y0ZQ8CWRMviADnT25f00+JUy2PIL1ij7KfGC9Cv/PvTROnj7tB1a+yztlvjOuuLtAWU69GobpvQsnw73Qj4A90fyRvdQP2Dz50Ok9LNmGPTF7Vr2lfwS+Dl2TPT2chD3cN/09mDBmvX3fdb6+f4E+lulYPtrCPj1ScHm9LQCDvV7QJz4yriC9aSiKPZ9lB74Idqi8eX4TPrLkMb0ryn89eiO0PWEipLw9miG9L/navYxMHD7F1Ms9pmNdvfHBlb4618C99RP3PTjpwr3eB2I9CJeXvazYSL7fkke93z2mvQ=="
        ],
        "moving_variance": [
          "rKBXP7zLpD6RnFM+pGKaP2v+5j+30Jg+AJuEPyLknD5JLI1A47TjPpeErz5Un8k/ejGuP1VwiD+93DNAoA7MPpx1oz+4BBVAIdwEPymQqz8GHm8/DGa2P6fOjD4Fxk4/iPrxPmlqsj4hJLU/qOvAPrTbqD8NJQI/bvL/PySEIj/fKcA/kiRkQNmGYD7Bgo4/468NP7pNkT+K6MM++2WwPiO4zD4VlcY/sRKjPvqXsD6FMs4+DzFyPoBPlj9x4ZI+Hh9WP0h1Mj+b6qI/qIWUPiHpcz/gss4/oEvvP3GNlD54BSRA5uOaPsEJ3D6yDA1Ai4IUPnEpMT9sm2I/EliOPzc4Cj+rTw0/ing+PzUHxT66SX8+/T7kPsaYwT5Hdmo+eYDjPlCOUz4erjo+OsGMPpBOrT7TTb8+qJW6PoIrgD8yYKc+s8rrPot3hz+l/gVA1lPxPkCWHz9eGpQ/Wdk2QBNbeD/ma68+9jIuP+yL+z4EZjM+eI5qQBHR0z7zNAs/SO9wP+9XWz8j+4pAPXUfP+dnlT+gDo4+P+T1PvV03T5Ouu8+PZeWPhJCYj7uBWU/2gtVP7tlJz8KIDg/HETEPxTagz6WH4Q/dEVtPpfDYj5KZ5U+YpaXP2QDOz+PDiU/qByIPr4zXz6BPgNAiu/QPipvJj/yDus+tokwPz/85D+/blA+4DmMPpi1XT+guCE/qjq2PkrY1D5glzw+i5gyPrhrYj4j/1A/OvSKPqRorT7t6lY/2pwIPhRO/T4IWyI/dwNsPlLWFj96w4A/8qQFP1+5tD9pmMA+JfXUP9L1KD+bcAs/0Q4TP6w8Wj7cNoQ+VMCxPhPnKD8sNfE+zwfMP8vIrEDNp8M+E6bIPhzOFD7InAE/F3vxPiaD5T4GIsE+4B6gPuY4kD7LIfw+0KbvPy2t8T472RA/lAIiPv/EPz+gZhU/ft3QPq7Gfj9UXys/68UqP+VbRT/E2c4+W5e5PvBOPD/N0pk+KZbhPnNzcj/XKfU+hK7bPiB0Sj9MYO4/",
