{
  "parameters": {
    "latent_dim": 8,
    "sClip": "-60.0",
    "sr": 22050,
    "win_length": 2048,
    "xMax": "100.0",
    "zRange": [
      {
        "max": "2.0",
        "min": "-2.0"
      },
      {
        "max": "2.0",
        "min": "-2.0"
      },
      {
        "max": "2.0",
        "min": "-2.0"
      },
      {
        "max": "2.0",
        "min": "-2.0"
      },
      {
        "max": "2.0",
        "min": "-2.0"
      },
      {
        "max": "2.0",
        "min": "-2.0"
      },
      {
        "max": "2.0",
        "min": "-2.0"
      },
      {
        "max": "2.0",
        "min": "-2.0"
      }
    ]
  },
  "model": {
    "architecture": {
      "backend": "tensorflow",
      "class_name": "Functional",
      "config": {
        "input_layers": [
          [
            "input_1",
            0,
            0
          ]
        ],
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                8
              ],
              "dtype": "float32",
              "name": "input_1",
              "ragged": false,
              "sparse": false
            },
            "inbound_nodes": [],
            "name": "input_1"
          },
          {
            "class_name": "Functional",
            "config": {
              "input_layers": [
                [
                  "input_1",
                  0,
                  0
                ]
              ],
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [
                      null,
                      8
                    ],
                    "dtype": "float32",
                    "name": "input_1",
                    "ragged": false,
                    "sparse": false
                  },
                  "inbound_nodes": [],
                  "name": "input_1"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotUniform",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense",
                    "trainable": false,
                    "units": 8,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "input_1",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense"
                }
              ],
              "name": "functional_3",
              "output_layers": [
                [
                  "dense",
                  0,
                  0
                ]
              ]
            },
            "inbound_nodes": [
              [
                [
                  "input_1",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "functional_3"
          },
          {
            "class_name": "Functional",
            "config": {
              "input_layers": [
                [
                  "z",
                  0,
                  0
                ]
              ],
              "layers": [
                {
                  "class_name": "InputLayer",
                  "config": {
                    "batch_input_shape": [
                      null,
                      8
                    ],
                    "dtype": "float32",
                    "name": "z",
                    "ragged": false,
                    "sparse": false
                  },
                  "inbound_nodes": [],
                  "name": "z"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_8",
                    "trainable": true,
                    "units": 16,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "z",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_8"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_7",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_8",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_7"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "elu",
                    "dtype": "float32",
                    "name": "activation_7",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_7",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_7"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_9",
                    "trainable": true,
                    "units": 32,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "activation_7",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_9"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_8",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_9",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_8"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "elu",
                    "dtype": "float32",
                    "name": "activation_8",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_8",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_8"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_10",
                    "trainable": true,
                    "units": 64,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "activation_8",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_10"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_9",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_10",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_9"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "elu",
                    "dtype": "float32",
                    "name": "activation_9",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_9",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_9"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_11",
                    "trainable": true,
                    "units": 128,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "activation_9",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_11"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_10",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_11",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_10"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "elu",
                    "dtype": "float32",
                    "name": "activation_10",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_10",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_10"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_12",
                    "trainable": true,
                    "units": 256,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "activation_10",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_12"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_11",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_12",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_11"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "elu",
                    "dtype": "float32",
                    "name": "activation_11",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_11",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_11"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_13",
                    "trainable": true,
                    "units": 512,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "activation_11",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_13"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_12",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_13",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_12"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "elu",
                    "dtype": "float32",
                    "name": "activation_12",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_12",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_12"
                },
                {
                  "class_name": "Dense",
                  "config": {
                    "activation": "linear",
                    "activity_regularizer": null,
                    "bias_constraint": null,
                    "bias_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "bias_regularizer": null,
                    "dtype": "float32",
                    "kernel_constraint": null,
                    "kernel_initializer": {
                      "class_name": "GlorotNormal",
                      "config": {
                        "seed": null
                      }
                    },
                    "kernel_regularizer": null,
                    "name": "dense_14",
                    "trainable": true,
                    "units": 1025,
                    "use_bias": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "activation_12",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "dense_14"
                },
                {
                  "class_name": "BatchNormalization",
                  "config": {
                    "axis": [
                      1
                    ],
                    "beta_constraint": null,
                    "beta_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "beta_regularizer": null,
                    "center": true,
                    "dtype": "float32",
                    "epsilon": 0.001,
                    "gamma_constraint": null,
                    "gamma_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "gamma_regularizer": null,
                    "momentum": 0.99,
                    "moving_mean_initializer": {
                      "class_name": "Zeros",
                      "config": {}
                    },
                    "moving_variance_initializer": {
                      "class_name": "Ones",
                      "config": {}
                    },
                    "name": "batch_normalization_13",
                    "scale": true,
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "dense_14",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "batch_normalization_13"
                },
                {
                  "class_name": "Activation",
                  "config": {
                    "activation": "relu",
                    "dtype": "float32",
                    "name": "activation_13",
                    "trainable": true
                  },
                  "inbound_nodes": [
                    [
                      [
                        "batch_normalization_13",
                        0,
                        0,
                        {}
                      ]
                    ]
                  ],
                  "name": "activation_13"
                }
              ],
              "name": "decoder",
              "output_layers": [
                [
                  "activation_13",
                  0,
                  0
                ]
              ]
            },
            "inbound_nodes": [
              [
                [
                  "functional_3",
                  1,
                  0,
                  {}
                ]
              ]
            ],
            "name": "decoder"
          }
        ],
        "name": "sequential",
        "output_layers": [
          [
            "decoder",
            1,
            0
          ]
        ]
      },
      "keras_version": "2.4.0"
    },
    "hash": "b8080e0469bd913fa15d655dbbb148281e794aa0faa714ade7b267a2a28a4aeb",
    "image_data_format": "channels_last",
    "input_shapes": [
      [
        8
      ]
    ],
    "output_shapes": [
      [
        1025
      ]
    ],
    "tests": [
      {
        "inputs": [
          {
            "shape": [
              8
            ],
            "values": [
              "CwQHv7ufez8A9Gu/SY86vx9xsj//mkU+mjhqvy5uE78="
            ]
          }
        ],
        "outputs": [
          {
            "shape": [
              1025
            ],
            "values": [
              "wCooPEy0uD1+Jx0+ogUwPjagUT5+rHQ+WCpFPm5JIj7gtPU8AAAAAAAAAAAAAAAAAAAAAAAAAACQ9HQ9eCDaPQAAAAA4yOk9vBVEPmQFFD5qzAU+/SqmPvoiAz8GYhg/0cACPxKMqT4B2JM+EgVuPtgEwD0boqE+mLfWPaAMWT2wWWw9AAAAAAAAAAAAAAAAAAAAAIAEODxQHE09QCuWPQAAAAAAAAAAAAAAALAQED4UtMA+l1wKP19cBT+aHJ8+TKGnPazR+D1wFtA+ikwaPxCuGT8/9AM/hcKcPmLznj4mJeo+xDLFPnBYVz5A4q89BC0YPoCd1j2UVL89dtUaPrYoBT4wgVs9oBHXPfKpbz7snDk+DIGUPUAKqjwCkXk+wDwiPuhRfz04oEc9rhQePmJlcD5OEZI+BpaIPsTDHj4wYlw9AAAAAAAAAAAAAAAAOpsvPipkSD50e8A9AAAAAAAAAAAAW3M9tIWsPo9Pmz72WE8+NNecPWBMljwAAAAAAAAAAAAAAAAY7nU9HNmIPk4ioj5OPJk+hvAPPqhOHj3onq09HCH1PUTsID7MzlY++MdCPlwdlD049S89Sgc8PiJ00D5l+BE/oEHlPop9Nj4A3ew8oAJsPFSBmD0YAjU9gLfVOwAAAAAAAAAAAAAAAAAAAABguxE89jgzPjzBjz5W0l4+3HnEPRBH4zygZc08ADH0PACOxTq4PTI9a+0fPgroVz6wr589AAAAAAAAAAAAAAAAgIbfPWTuwj0AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAcJqtPBD3Fz7iRIc+DoewPrCSkj7DXmE+2t5qPgOTgT6+vB4+QtwXPoB+/D0YdzQ9pKkDPhxuaD6wmIE+2l8DPgAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA49do9wpFgPrJLkT61Wpc+jvg4PvwGrj1Iakg9rGaPPQAAAAAAAAAAAPYzOwAAAAAAWk48",
              "bGiKPcB9dz0AAAAA4GNlPVhCIj6xNKw+m9DaPvViyz7g9LI+vuWWPgy4Wj4L0oI+D/29PoLSvT5VdnM+hkQiPhRayz1IOgE+BErXPZzlqz3EZqo9wPNvPUhxLD0oQoY9xiQVPnRKvz0AAAAAQAKDO2jJpz1Qid89cpsnPj5RQD4VsYo+dBmwPlg/qT6tx6A+8teRPrKCrD53j34+WsZHPgi5RD7+Zkc+ZM0iPuuKSz4wJGk+3GSBPsxtdj4ONJY+N9qTPl1CVj5g+Fg+5BNXPu7lDj5w9/M8/GqJPR/5Tj6a0IQ+ZNSSPp/MpD6mDKU+4vagPiG6uj4KsNw+y5cEP2ijDz+0Xt0+N912Pgyt1D0A0Nc9JIctPkAVWz7Yz2s+amR9Pjs/WT4xfWk+5viHPvcZjD64bbg+4M/iPvijAT/sHfI+XBDhPmIGyT5xRWY+8DLDPAAAAAAAAAAAAAAAAARtxz3aLB4+SBlCPpxBLD6Udwc+IgG8PQAAAAAAAAAAAAAAAAAAAAAAAAAAQFLzO6CGwz2EgGk+xL2wPrWGuD71uZk+YHuYPpZQXj4BUyc+vLrCPbxdhz2IaDA9IPI4PXz8rD1axgA+9y0yPrw1MT7r1oU+iz+tPsjEuD4pF8Y+Gq3cPiYErz43QKI+heSQPtf+qD4n8Jw+qOqHPpo/dj7E22w+bLEQPnhrCT6+ac090O/rPBBygT25axA+aGMFPg0mFD4Fx2I+MKh6Pi2EPT52JSw+JOEaPtQSxj0FVA4+9sXgPQjrlj38Mv899oB4PsXalj7o75U+lb5nPsDmTD5TqV8+MLVUPvOsSD5eeRc+fF7CPUgPpT24UO49qF4qPlh53j10lMs9pECsPUzoiz2H3As+dD1GPi4+fj6m3pg+x6SfPhaMkj4Wc4w+nCWIPu7diz41QYU+9f46PkN2Fj4dTCk+y3k8PvWTPT6KNw8+AObnOwAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAh3zpsVKc9VEdiPhyjYz4OWGU+",
              "sFFgPvpldj60UjM+8a0TPthvOj0AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAADoTV89C7wwPgbogT48WIA+JTBRPvxKVD658iY+rEOLPeAwYDwAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAIAe0zxMXt493DxTPt9mJz64cSk+GJHkPfgbuD3Cu8Q9wJjgPbPYBj66nw0+eCSjPUCCNjwAAAAAAAAAAFDjAT34zzQ9kLAhPcA0mzsovy89ZHShPb/XNj64nmc+LqxdPvdhKD7CFnM+YQ+UPpgupT4Oip0+pliYPkyplj544Y4+U2+EPoArhz4EAYU++/Z+Pk1RdD5uw14+SomFPnrakj7XUJk+WsWQPkTqTT6xnRo+qeVlPuCGXT6aN2g+TJ2BPnJ8iz65AY4+mZ+UPo9yqD7GdMo+kZjPPgSa2D7n3cc+HCu9Pihz2D4A6PI+NGHrPvAj2T7Zb+I+3ADxPiRB4j5iFN4+V3HwPmfZ2T7bhbk+X9a8Pv7Xxj7+srk+OnG+PkYd6T4mHNQ+y63CPvY3zz7bRu8+W3z1PtuT5j5HVes+9rjcPmSl5D5IyO8+zDv6PniF7z6oPug+tB7jPuC2zj7wCsg+jTO9PoyduD7232M+eixQPhqggD5stpQ+gnCnPgXkrD6bS68+ucuwPkJywD4nNrs+SojMPlWxuT6kjp8+ikKVPhawmz5ZXqM+LNGdPs34qD4mm6Q+fsiXPvRNlz7UxZg+KHy2PtpNtT7BocE+bcWvPtAykz6Du7Q+hMqjPiZjpT59raA+W6aPPhpKZz7Pclg+Eh9ePjXjSj7aETA+GA1BPhfxWT4Fd14+C/dcPlFIgj55ZZ8+cxq8PuPKyj7+eNQ+NAziPpsiyz42VMw+fGbnPi7y5j6kxOI+JIPWPtwOxz6WCqM+rhGIPpcOWj6cxB4+zURBPopyOz7DmR0+",
              "nhEcPga3DT7tiSQ+mU87PnJHaT4+42k+Pnd3PlapcD6rIIE+SG6CPsiCkT6pu7g+EB7APmeTvT5OcdU+FNe9PlYHuD7r5LU+mZyjPvBxYj4kAzw+43YyPtIzPj7WEVU+MKxnPhfJZj5ON2A+UOJNPgTfcD7jxJI+V9yPPkrfmj7qHZY+l8K2PknLpz6Kq7I+qIm8Pr+PrD63LaY+NDShPhIEpz7USJ0+7QaePgQcqT4vsbQ+UUOtPp81sT6wUMQ+6X/IPuepxz5f3rY+nDGmPkXxjj7phIU+4j2DPh3VkD6S8pk+eGChPrd2yz5o6so+nObBPvyisz7cIqE+5tGRPvwPhj5EDC0+4a8LPgV0GT5cFEU+zs14Ptv7hT5lZn8+EESFPg87hz4Z0I8+AD6LPpBiej6EQVc+jUBkPkjkdD6wsZo+mkmZPjrAkz7HcKs+daq6Pr8StD7tgpM+0oqrPpOIqj5Pq78+ckTDPhrNrj4YPpA+/aijPqfMuj58Xs4+/V3LPl7Kzz7+zcg+/uGyPmM1vT71KMg+iEy0Po7Ktz4g9rE+JVa3PrBPwT49vrw+o8W4PnY2pz4i840+4DyePh25pD6V36k+2v2rPjattT5GDLY+2EOXPoaGkj5iXHY+SuyHPjxOkT7vY5U+svWUPnt6lD65M44+k7eOPsaFpT4HIbE+tN2xPv7FhT6YgYM+6atmPgwmRT5i31E+0Bm7PQh0hD2YQDo9kB80PUQIwD23EhI+KFqZPSS8rj1qMQQ+IEsvPkx5Tz4iEW4+nGqFPqCCnT7TM50+/XGgPkaYmj61LZ0+44eHPsRnfz74YpE+mNqTPgrpfz46Rmg+5UxQPmPuTz5iP3c+dyibPpPnsT6vAao+282nPnJHqD4hpoY+8hOGPpYmZz5s/X4+04qMPhe0kj6POJM+ahqOPmBCkj5b46Q+vLedPrL9mD6/uJk+JlCiPsL7rz4wrLM+LYq8Pt/+zT76Z84+4O3LPvyN0T4KatU+34fhPpp39z5sGvk+",
              "lgPVPlc7xD5R+tQ+pPu1PijIuj4Dyag+iHKePlW9oj75oKA+Ir2TPhQGoD5WTJ8+ipqbPjLkeT7Fh24+lPF7PkTuej4vPls+GsRfPub6Xz7aC2c+YoqDPgjRkz5mQII+6nVWPrbqYD6SPVQ+2P1MPoYaIT68WBU+zpnhPXgRZz0ARcw7AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAFCkoz28bWc91CeKPbTphT1Q25496LCGPRhQmj2MndY9KEbqPXzY0z3cK9w9rNjdPVTuvD2QLK09oGQ5PbwRiT0MRag9qMJDPXCJkz2MzI09pCqvPXwsyD2YqXQ9QAYkPQAD9zpQnIo8UM5rPbijuz3QytM9fFL+PabyBT7qChI+8KAPPhwJ9z2wruk97CDDPUy18z1Ap+09V/ASPqu4Az7Ayw0+6uHUPRY+zj0kZaM9fsnwPSvFAT7EEds9Lk8HPlLr5D3QwgM+goniPeXqDz6xy0s+OpAuPoRzDz4z4Sw++3drPuk7gz5mHXU+oJ1yPhX9az5CD4Y+cQCAPvDaUz66a1g+DKxBPl1+WD4LmGQ+x/J+PkOLiD4F8ao+DaewPigxpj7EzqU+N5ClPvQ2oz6kM7o+jG/GPuZasj6tS6Q+3Le3PnDPsT4bm6U+IqOXPhWuoz6aKY8+gJeTPp80iT6h9YA+phGgPiRQqj47LKs+3QynPnI+rD6mxbY+NnC0Pv5Uuj6WbsE+nFO+Pjs3vj4kFb4++ra5Plcpwj42s74+HIW7PgCGvD7cOLM+0t+/PgKUxT4YP7Y+iBGfPvVppT6Tha4+GZ+9Ps29wj57nsQ+hVHLPsQLxz4U0tc+XODVPpSd3j4KCss+ZHjPPjJLsT7iH68+EYisPkiDpT6oIqE+epOKPuyYdD6tInM+ahiXPhZJij5SKZQ+WGGfPirKqz71cJo+oPSCPu/2ej4FqXg+uUR0PoLvgD7s94Y+Z2tuPoo9eT5ny2g+KCZPPmgyfj5u8YE+8gyKPvyseT6Q9FA+",
              "7ulCPsrpRj6MHVA+jWpZPuswTT7vhUg+5kMsPrQ8Mj47exk+/L4gPhaOEj4Cbvw9Ad7dPX4elz10b8w9QQfCPVnLBz68bQ4+qZMIPkbM5T3nExM+zk7yPaBYEz4o6Bk+1uEXPlne9z1Kag89AAAAAKxZhjzUrS89TOHgPKVWQD0wnZE8bV8ZPf6DIz0b9QE9BgKiPCLdMD0gIlk9p1BfPYCJNDsAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA="
            ]
          }
        ]
      }
    ],
    "trainable_params": {
      "decoder_batch_normalization_10": {
        "beta": [
          "arnCvyqmqr/80Tm/VGYSv+gJLb8Qzo6/7NP5vmxXlL/kk8m/KxuRv68rtD0Xc86/+7OEv9r0JL9mdYi/IfW8v3oqo7+qrAG/AkQLwIyUm79Zv8O/oGCrv5bOLr5nNoS/vD18vxK/l7+4rQG/ZlqDv8+oib89I36/jMEIwOA93b4kuKw+Q2Spv3LGhb84XjS/GSR2vyJFt78oTSm/ov+1v/U64L8Nj6C/GbCUvpB00L9MSi6/LNKOvZvnOb8ruZY98eLGvzAz4L9TDbC/dJ+gv+qfEL9Gcdy/WUpBv8BeIr9ADt++8Xvtvz5MX79S/r+/l3Ocv/uxlr9Px1y/CY2ovsYD975UIJG/FX2rv89hNL94hT+/QM1kvzsC3L8yGMu/feO8v0WhCL81sDm/TnCnvfcGNr8ChLK/JDemv4M9677qM3C/ggqYv9MZRTpT6cC/ceqWv9uki7/t6aa/gpF3v/dHP7/vfIi//lMwv0M597/r/sG/k53pvxwijb86K2jAtJkhwGLoU79dTJy/B5f5v62bJb+aKHi/tAw6vxKVW78hiHu/4QASwJs82b/Ttxm+7RaUvywUZ7+ESIm/Y58mvzLIe72JbvG+u2rLv89cF79its+/hUZXvqJNwL8Ebnm+MGUFwOH0Tr9q75s+dS30vtnsPr/E2py/6aX3v5LKhb8="
        ],
        "gamma": [
          "x0fTP1/NF0C8QK0//10JQANO7D8zgiFAe27PP541CECkCwJA2BjtP78bdz8n498/m870PzPosz8+rQVAz67MP2hBrT8T5ec/rnisP9+ArT87Qv0/COTUP9RbDUDnCBZA1qD0PwCR9j9LliRAHRgMQFK6BUA5YUZA7UIXQGfXmD+LCgw/mggJQKz98D8BttI/B8wBQEyYnT/2w7g/UOEdQJ6HBkBkH+k/iFOqPw5H3D/saro/VBOzPxQiwD90sIA/vAIuQMKN5j8Qds4/k043QE7X/D877M8/7HFLQDVm4D+J0eo/1vIJQPMd4j+z/sg/PJ8aQNQi/D9Kje8/KJunP6y02T/1iA5Ap8+wP5Ez4j9/8qw/V0MAQISghT/VwsQ/rUbgPwMCFkCP4whA4PcmQK8AMkBne+M/3MTKP6bwEEBpxANAjbsAQPWbjz+L3P8/TtUSQNfIyT8exq0/Tb4fQBL3AEB29RlAA0TzP8GQGkA/Ffw/+u4KQBogBUAVb6g/76+WP+iL+j+iuiRAXWrsP3b++D8q3v8/1jjPPw58DkDK+PU/16AEQMYFBEAnZZg/NXADQDezyz/Ycro/LVP4P7gbwj+eZSdA25rIP6PS3z9vcOk/hZ6TP9Ti9D/u3rc/BdGvP72wuz/lcylAe1WsP0FTB0BLhA5AK1nDP2lP3T8="
        ],
        "moving_mean": [
          "ImJSvxS0mj5sRAI+2O2CP6RykT6GF4S/+J/xvrEZ/75CjI6/QbeAP23Olj9R3Uy+1mCiP0UiC7+goHA+w1OfPd3Y1b6mUX6//ucVPjaysL9515k/iYnMvtEDhT9rBsS5xnn8vn/JTb1uYqm/W/DKPlY7tT/HexLAKGNRPk16wLyF+zK/+7m+Pq44db5F20A/TF+Ev1LPLb9Ja9O+kfPgvjIyhj8fsJy/ULHcP9SUpr6SnYM/jgGgvZSFHD/PFXQ/m+V/vZkigT0qpGe/TwAxv0YuXL/8Tes+bBH7v5Wf+73Sow6+fSmfPjeEgr0VrkW/GdA3P84MR77O8rY+DsGlPg8pF7/yVYe+byCFvhR3Qj/IY8Q+LCFrvrHZxT9NWz8+BF7vPnYjoz2Ga0A/9/TfP3/7oD9feFW/JJWqvAU+0D0hl6U/psifPzQN+769yfM+DLdiv4Tupj3UAtK99bAvv8fTkj/WpGg/XRUiPxmGGr8+DQS/eXvNP0Y6TD4HGxDALEklwGkLA7+NeGk+giImv9E7wT7gEr68QOJyviLPgz/f1/A+g/RMP3whBD+b/Js+mndWPswyfr4nrEa/xeTJvhJh6D6NLZE/9iRFP+Wt5T2xUuA+Fq6ivhCSBz6a15y+NcRGPrIvUr5QuJw/pSEOP3nrN79bxfq+ZuGbvhAZwr4="
        ],
        "moving_variance": [
          "9LmDQFRAPkHABxVB8uNYQS/+m0Ctm1NBnV4jQUVmBUHNEblAHqpvQAYAUEBKcbFAX95zQIv6XkHc+wlB6aNvQLxVIEB8fgBBzsHDP9tBrUCWXwxB2rPLQIT4EUEmBHpBAgh0QauiCEEnEkpBZLcqQaimN0F9FNlBb4kBQQiQ10E8N6g/P897QXHZ8UAy0Q5BOA9NQeuzFkB6TSBBEPeHQTbd2UDkVfxAtVqYQL/VXkDgfMJBBu2iQXs5SEDVMPM/nbdOQZd/BEEDYh5BWJWIQd5VLkED1WhAuLOmQZLmVkH9O3lB6oQeQTkLIUFRRLJAIsYqQUr2e0Ci9CRBDp4XQUHYvEDZvA9B9xXaP8AvmkCEdEZByxXhQAftMz/2/5VAAkOtQBZzcUFCgh5BNP7DQWXljkGK1BpB0MxLQe0SF0EtgixBDycnQf6o0D9eus1AmjUtQZjB40B4OndA4xuLQaplJUFOwnFBvTu6QCbnWkFIhupAvqPTQGjs10DOq0FAxOtTQFi99kCC8ENB5TmHQGsFAUEX1DdBqpZvQRQIIEH4d5lAnZvNQFepv0D/lxRBbu3OQMmmI0E8Vsw/aYkNQa4uAUHNrpxBRrf6QF0dCUEh2M1A2ilSQDt16EBTd6NA2b+JPz3lXUDjmadBV0o3QNGoSEHxM19BSGh2QGRfCUE="
        ]
      },
      "decoder_batch_normalization_11": {
        "beta": [
          "EVgswBSGPb9glwvAPDnuv26cGsC+rqq/lo66v+jwYL9pQdy/Mk4/v9uP/b/PDDTAx0jzv1l41r9XywE+GLWXv3XD1L8WTrS/mxCJv0ys4L95eSW+XQKVv2Mv/bz4o8O/EnRQv54iUb95Cv6/q2ZEvUV5qb+zS8i/ZEFKvwyF+75a+Au/gtFpPg9hNMCgEpW/r1Lgv3OFl79Az/G/W7y4vxdR5L96q8i/EXXrv9b7+b9rz+a/f8nLv+n21r97jvG/5CJnvwzJoL8reEbAIaFXvymjAsBaX+O/9Qvzv30je79pgc2/2S4jv+OHCcCTlKu+3Sj5vzOTi7/jOXy/dRLJvypi4r8QWAHA3WZ2vmpUCMCgpey+WnYUwL3cLz4BQxXAxEVov7sx8L+60B7AGk8iwGM01L/dkhrAW6EcwO0eDMC/0xHA/fmxvuLcBcDYwXq/E7ijv4tohb+ENNu/7+jsv7ls5L8yS6+/LvsFwGdMDMCBUwvAJNyzv15JCsAiIse/WmKAv0oI1L9NLgLAaOgewKfVgr9bXBHA9CuOv8siCMBQoOC/HELsv93Y17+BSBjAy+UTwBzn4L8Bs8e/Y6QQwKCLjL+6P4G/zICYv3xOWr6H9CU/hicRwIm52b6DwMu8AGMJwLKLIsCzfBjAVC9yvk+SJMB2/RjAH1edvVTI5L++sKq/u+IDwGIlFMBk2gDAIWViv+GuzL8UBKK/GB/0vzVT1L+PeRXAMLMGwOS+xb77OaW/9afkvQVGnb+70QHAPgHmv3iDlb/dcwDAIJN9vw5Q+b9zHSW/hOIkwFzLJMBh8PG/b70Ov8jPmb/o5HK///82v4xcDb/YlNK/y6cCwDd86r+IuiHAZW0RwK49KsBISam/yicGwJE77r/kUgq+gucWwFaJgL+2aBvAYyUxvzKcor/uavI9bgdfvntvrr/XwaG/0vswv3JGEcBT0/O/w3fGv7B0fL/qnOq/0W/Bv/kWP76ROY+/KP+GvznQ/r9+BCDANwXvv5ibHL8m7Mw9",
          "Emd9vr660L/GCBY+lBcPwCvEMcAKeqi/7qjXvxnbr773Qg/AjLHuvUGFCsCUlQzA4NeJvz8tAcDPcPy/XPfFv5hRlj7jsgvA8pb3v0k+EsDGggHAbWTIvyqinL82LeG/L4AVwIAm1b9zHqW/eDuqv+lNHcALMwTAqXROv9oyLcAWXgHADuP/v3sC/7/c3hXAlVcHv45iC8BKpJK/3AwhwMMiy7+zeRXAgdOvv71F/b/+v+O/oCn9vyAm4b8y2s+/3EgpvyYpCMBhhYK/kxDnv2eoeL9+2QTAEt7Yu6uDML6uJ7+/sju6v+aG47/lXYm/1Zayv4gB8b85DqO/s371vw=="
        ],
        "gamma": [
          "cMwUQBaJ5T/roSFAwaoLQIpgxT9NqwdAPEj+P9FH7j+9vhFA1YfYPwI37T9Ws6s/pSr4P5fuFkAMR/M/pSPHPxjUCUATEgJA9agdQLtKFECg7UBAFWgQQFSkyz8iyT1AP14AQD5yIECAZfo/w3eoP1ZWL0DicAVAJMUmQAfxsj+jed8/jdmbP95KMUBCeQNA1572P+F2BEAtRvQ/zbLsPwoK8D9MSCVA8pzqPxSe3j9rzwxAhQEoQPB2MEBMDQpAdYNEQBdeP0B85Po/BfQUQInCEECQHRpAmMsiQM/uHEApNSdAXqT9Py7CFEBIFaE/KGsNQP9Ssj+72Og/3McPQHUuLkCf7Og/VVylP7u7K0Bb+7Y/I53hP1ERrD+G4RpASM8GQN88uj8J4QdAORoCQDgSKEC36gpABmgOQJDtwD+CegdAPo0QQLRj0T/ZW+c/bN4fQHNiyz/CruY/FofpP6ANvz9OnPk/3fQeQKI9FkAlUwtAigYGQM7OKEASlBtAnrgBQMKZE0CdTBhACo8VQAMGP0DxKQRAWU0jQMmu8T8jEAlAtisQQNMwFECkyQdAwcH0P2mFQEAtLaM/ABoIQNqJ2j/7Lg1AGKwWQKwIrz+o7LA/o14WQIXJpT9XrJs/bdIiQJkGFUBmVCNAJj2iP3AWLkBpTy5AqNaxP8ZjCEDl3cY/EJEKQAikIEDKnhRAGVUbQL61HECVdQZAuPgSQLOt/j9oljBARdUXQCvmtz/21vk/lSmYPybxAUD9JzVAt6VBQM2XHEBUfwRAYEq0P5JnBkC1Irg/iFUwQApvIEA6pLI/jMYLQCdB9j+vEsQ/JUgLQL1OYEDOpCRA+VgdQMh2DUAhq/c/iMkFQD3UHEAk+iBAQ4YiQOjDD0ACawBAqwoZQAFe/D9gJLw/v0wiQIAkHkDygqw/gP/KPxTED0ApEBNA2foUQIITH0BQNBZAWDe2P4ZJqz+DGd8/JsPdP0aCtz9CzMU/yakEQDefAECozRdAyrbtP6kvsj+poI4/",
          "mGmmP7PXAkB0+7c/GJ8tQFzqBkCkURNAefgQQL2Byz8MZBRAabyvPwrPFkDktAZA0eQ3QIoHFkAQzB9A2SIrQHYXrT/6afw/9uAFQE1BCEAuf0VAsvkDQKnD8D8G+ag/iFMyQPGX7j8zlRJAQDkQQDNACEAKwBVAA1wXQNuqFUAiwBZAozQxQPMvIUDSlwtAosgMQDYe/T/w8Oc/KSUHQEM6EkAl0yxAycLqPy3CMUDJGhRAAHAEQO99/z+HHBFAE5jpP0CAFkDyOtY/GpYfQJ4X1z+G1hlA5hGTP+F8vT+sfBpAvKsXQG3K2D+w0A9ApecNQGzX9T8NqQ1AI7sHQA=="
        ],
        "moving_mean": [
          "DfABQIzaoz9IT+E/k8hfP5VEjb8OK7A//Rkcv9pjKz/j71e99fcYQPwqlD9uH1bAUjBHv9PMdD8qgHs/awggwDAaFT/ncK8/rV4CPYCdUr9eHANA3tA+PxyGor40qVM+SzjMvfjC6z5z9OS+3lRXQJLz9b5Yqbg/gWvHP7vwKL8ZUrs/E0fOPg6kwT+JYYc/DxxsP4WcI0AKLiq/OclMv++NGz+rCrQ/lvgevzPgWz2VxBpAbP9YvmO+iT9SL/8/A2/dPn+l5L3XfBG/Rrq6voO6vj+CxBtAN7A8QOwzIr9wYwo/2xE6P1hMWr8GwVTAfGoHQKuXK8A4Z/c/YnxjP/iQgL/rPwk/z3WbvzgFHz/t3o4+MSS8Poqs2D7298O9Q0qUP5pTqD61blM/KO2wPQpTDT7APA8/64BRP+v+9T7grGY+hYMpPzEP4j9vhz8/LRzoP7NIpb+8wM0+SHOFP01cTL9oqzg/z0QWQA3JST9Y6fY/36ClPpOzrT/1JoY+gIqBPiVnhj8LnsO+LSyavlnjdT/W+hG/Bl4SvbkhRr95I4E/gqgFv/MQrT/XVv8+SuSvP2F3nr7EcGq/pWitP0xKmT/6IGw/+pDivEoaKz/QKoVARv4vQNuDyT8m4EdAtx15P3cBt75Ad8o/RVd7Pj2AuL63GHm+T/3/vnlCQT/km7g+s4+CPz0Byz6ntfw/a/6DvgDjDEBAJwq/+++mP1wBI0C6Az6+obcNP5Lc8T5KbkA+IeNXv6UO0T83wfA936Q9v6QflT9EWbo/nEeUvwzmkz8Rw8287GaWP5sLA0AjtTrAPAknQN467D8c8RnAYke7v5HRwD6VOHW/diY5P5pObz9PmPq8ANTzPyXtHEC0jwpATXriPxWzu79GYjk/gQutvVVdpL6MLkrAOB2Ovye2mT1NrTVA6XVZPyeFKkCMFQlAG9HavonJyz9mz0E+My7Kv88OaL9Q3A2/1Mobv4Lqtb/Rctq/7Kczv+J7W0DmS/g/asN1P5wansB3iwFA",
          "OfvqPq+VcL/+iaM/uJERQIAi9T+p2z1AxlerP2YUfL/PBxZAD38DQCn+HL61GUq/0p67P0iG/T6RZNk/8NS2vlzTRUBUbD8/2cmCvqDJhj+e6hM/q+baPWo1PT/nJQTA2zNgP4o/1r5jc84+8cTlPVF3nT8O2Qs/epBWPuGQJkA9o4k/x4daP4Vmhz/CghM+S5f2P5B1774SDnM8RGi2P/DquD+jQfa+jUqYP32ILUBETmg/X0ocv5wAmT8v0UU+irQ8vngHrT8XDbm/Kktyvr7rcT8mWN4/uIyWPxFRSED7Wf6+xwv9PgNUlb/OQ+s/tu49PzmTyz8/32/A+aH7vg=="
        ],
        "moving_variance": [
          "0AkmQaN010DeXUdBlvFrQepWZkAruShBT47lQDyK6kGSp0VB3hrJQHjm0ECuHIZA48fPQAEcSEFR9kZBcpgnQfPDDUEdhCNBSdiLQSLye0H88xFCG5aCQfOxykAv+kVCjzKfQbk91UGFPwlB3iBDQuYuvUH7STJBw7D4QVcKNUKXSTFB0RW1QJOEPUG+G21Byj/gQAN1KkGgRglBaIsHQVaaEkEeWE5B75a5QFoZUUFnf+5AUu23QVIUxUFlfOpAM8wAQkriXEJQCKBAmp6JQYhEMEEl33VBSaRCQUv/h0F8XelBpGE2QVFdFUEwmS1CHDkeQYkujkCsmxJB/dsnQSkyh0H7y09BXZ/iQTMcSkF/8glCs11kQEuWsEA7GCFB7Hd5QVbaL0BR/+BAyO3fQFJRYUHR981AJ/ARQa+2d0C/PRtBXwh2QcDXdUCzThlBnUraQUL/EUHV5u9A96qWQBWxIkCELBFBE5RVQTIMF0GrkAVB5A3uQNFMjEFM/jBBLoOlQSmzT0HJEURBRCgNQQkQJkKB5MBAaAmtQQb21UCLU9RA3r9GQSW4gUEvp8FAzqGXQL2ZKUKzyw5ALEUDQd1CxUDrRT5BqJGyQYHCgkK2vwBBP0wEQR2LRUK355pAyjNFQUqkDkHH0GVB9a+UQIq/nkEJIY5BnIOIQiKdEUFHseFArcYMQZ8NKkFHExpBKhe3QfTAM0GisGdBTZg1QUCxAUH2LZ9BkV8cQbGesUAl2gdBmSuDQP1heUG3C3NBi0nrQc/quUFY7tVABFCQQSSH80Cxp5dA9QihQctdUUERD1VAMs/MQVIeBEGxTMxA+qXFQSb+lkJIOWtBKnosQVRTV0HWYsNAWEMpQUiRL0HsIJRB4DKMQatUE0HQimRBczsdQb85EUH1pZ9A9wXdQQ4Bh0FGFJpAMlvtQD6lTUEb/CdB3SLqQXL5U0Gs0QtBTbWnQH3RZ0AbUZxAd1oFQcbeJEKiU51AkaFTQb1eEUFHXg9Bj3C7QI+sEUJa0YBA",
          "Nz0hQqREN0FLL9NAhyCSQfzRnkCuvoRBUchQQULFBULW0AxBr73RQP+LT0G8vQpBhptBQgdghUGswodBp154QgK5t0BJ0gpB8e0YQbjETUE5+CRChSg/QZNGukDWPMFADqVxQZOgyUDrYEtBKXJfQURCv0CMNFxBkl/zQardBUE1lzNB8M6NQTzFS0FIQmtBy3x9QWRkGkEn91BBZAXRQHbvLUHRVrBBNCedQMQ6ckHdWJNB8iCyQOhx30CjE5RBE94FQbRIPkFnR95Ah9hjQQS3y0CfIEtBPFlwQMZKrUDw3LtB73dDQccUkkD812tBgqoXQYs170Ay9sBBYqQbQQ=="
        ]
      },
      "decoder_batch_normalization_12": {
        "beta": [
          "YMEZwEC4K79zmOK/8nZqwNtnVL8/HJW/c0qJvy8wDcBpI3i/axJSPyZgNcBF1NE/MJDXv1cNrL9oeBfA7ctVwPHtjz9aqAjA0VOEv/ncLz4IcO6/kHOBvklDkj7PKLO/oMRLvwuGFcAZElHAdtQLwAWcLT/DYSDAz7Y6wAe6jsDyAvq/c4oWwAeZMT8lB2s/WNDFv7zG5r/yuG6/qR36v6CBo79WRWPAOZsqvwrme7+qAeu/41tdPqAMyb5PGtc+rMm+v/UG1b9oTw7AbJQCwAEHmz4tcnq/qxPHv3kV6L8wSYy/fiyIvqaugj9cb7q/NelOviEYDcDiEG2/pfUEP14pzT4w0dG/mKZSvx4nh79ZRQ3AhMQBwDUfir9ZuLm/S43Vv813KsDukTA/vyLSvwmoJsBHhv+/hToOwBkN379qOxTAwNyKvw79Oj+8oCDAqOnMv+7gL8D3dQHAyDiQv3i8nr/VO+q/66LdvxS9IcDnCEC/1Qj0v2ONjTxlypa/3RCNv8RPiL8SE7A/naTivvULgb8H/UjAtCOvv62NDsDKGei8e9Csv16Qkr8rLaq/UNNOwBEIZr+yWhTA0NyKv8bK+b9ijqO/r11FvzJ0V79d2CA/xsmNv9O+1r+7eyvAfmUMwIFaob9kma6/Yn8VwFMOnb+I3jC/3A6QwL21y78DCyHAeCFYv8QWZ8D0HdY9XJ9vwKB9+L+/5Jo/ZsKXv8yM2L+JXoI/dIJxPxyIxb/qYwq/Yu4Ev/nvEsCay3zA4umJvNguzL/dtEfA6moCPrRuCcD9sw3Au1OWwMvsIcAxNZfAqDeMwM/f4L8f3oK+w80JwEHdh78PK4nA7wYcv440KMCRNJu/b8Oiv/U5p78ANCTAKHgGwC58BMAaJB6+9vJYPs0pJcAVHgzAY3WFvirhC8BH3LO/7Iq9v77ZEsAwucg+fvr2v9Eei7/qRlQ/sdTzv/NBvL9KbXLAgDTbv9HSQ8ARldU/e9icv3nKyb9dpBo9PBZ2v0JomsCw+cC/",
          "saAKwDPgA8Ci4aK/SlUnwKTa17/UnIO+aQruv4YD1r/lcgPAlqUbwExwy7/vboS/bagLwFS/hL//ONK/fcAewFp+77/A7bW/xqi1vHypgb8Bo46/MnyYP0C26r+0bJq/1+mKP4Xbub/iYte/6x0HwO1007/I78K/cAjkv8eGAMBVrN6/QgMPwGYXNcCTGhnAEcIKP0dVVMBaAIs+fCKDvyCmNr553A7ABDMxvyQe+L+Lveu/J4g+vk4c779h1iO/oAAdv3Mnh7/+lQTA4VqQv71q0r93LEzADxYBwMO6A8C02wnAlmTKv82Onr8gFwrAp+omwI8ZAsDsn3g/vJHMvyWnOcArx1a/trSqv9qQir/SBQ/AQXYfwFz007/DSQ3AA3G1v7mL9r8tiSDA3wR/wAZ//79ASyHAoN8BwAZqIMCcq5S/SnM7wLHHjb+qvOS+6rZiwOZW978DmhHAGvZPPZgfg7/yVOK/mVYEwD8FlL/C6VjAMZEWwP44178pjhjASWQ9v+r8yr8V1CjAnFqtv8JuoL85jfK/giL5v2ZXUL9oX+G+3qq9v/Y5wr+IJhPA6ij8v30Rtr/01gzAMdQawHfu/L8/Rxw+mNf7vzmgrr+TNf2/+Vq0vx02S7/1+NG9Vq95vpGLJL8mnQTAYjOev0rh8r9ORsK/tvQVwHychr9EOk7AQPZlv30+p7/V/tS/zQMGwDP82b/m0ZW/QOKqvytPm79iIBXA5PAtwFq+3L8YzbG/xQcxwLeX2L8dYq2/glZIvyIf4783LLa/qaiSPrsQgD9doYO/wEfuv1hX07+QXwbA7WIPwPywHMAWlka/VsYfv1Dc3b82isS/4cgwv8nfGcCvhRfAdRO/vuNfosBVEuC/C22IPzc22r/CpRvAZR/2P9o7vL9pCAbANagtvodcbb9dnK+/OiJ1wKTrpL6JQtu/XMB8wB+uZ76yetu/iPJWv2C797+9EPu+Kl2Qvt3w6L77p0i/mY63vz8SO8CDuhjAVU8IwLeDvb9XUsS/",
          "PF+KvicM3r/axui/M3ESwEEmjL4XeAXA6+8fwLSpA8CgiR3AZGCNPmXx77+M1E6/8hcgwEB6xT7rziy+PByLvxrkAr/vOATA23m6v4E0FMDfJi/AX1mAPgsAhL+BSQzA2fCqvz4tt7+NJ56/jYetvy2QFsCXfJy/5+RmwES/vL8dDI6/RgIWwOFPvb9pvdq/+UX9v3cSpT3vwKG/H8iUwLIOHcDtSwu/HCy1v/QPUL40+Z/AqU2av6xj6L+LZpy/orDJPaZuA8AFi+e+Jug0wIFOD78eB5u/MGT8vyrzwb/2ppG/CRzrv32bGcAwHEs/D7PXv1NHFsDF9q6/eEQowEh5Zr8+MmS/0VyDwOtfGMBYgyS/7gCzvyMiLsAbetq/hwuev9VTvr+hCWq+mXS6v0rLq7+7798/Lfqpvemd9L/p6h7AH6TtvzC6pj//oPy/r3q/v7sPR7xk6889ZN0mwCPR778dvWPAZLcFwKOSVcCPtGy/+L3EPoxy1L/krq2/sGSPwLHc7b9m8vm/lKv3v5ANg78VjBvADBpgv/2paz9Na7G/ZX+Ov2v277+s4aG//IQgwP0gTb4PJIa/DjbUvxCE7r+puti/nuUOwLceBsAeSC3AzKrXvnVGTMCWfV6+M1uXwIpCO78Aycw+ZWsUwPIX7L8psH6/vJxZv1BSQcA="
        ],
        "gamma": [
          "WSsCQHG00D/pK/Q/rqEvQF0e+D+WL9k/+srYP2pg/D8MsfI/worvP9gfJUCIWc4/zNoJQMxt9D8dgts/43gdQHddzT88zfw/TiHvP4/nzj9Aquo/Z/MKQAA1qz+Sle8/raTpP+kYFUDWph5ADPMCQOp58D9hzhdAyrsSQBdYTkCt5whANrcBQDlDqD8LSM0/41zlP/8/3z+POug/2E/tP0qZ1T9x1hlAq2nuPwM+AEA6294/gBsKQHw26z+N3NQ/R6XyPyYH8D/lMAdAqjoAQA2D3T+WQOc/b2LRP2X0+j/D1dU/6UTKPx25pz/2S+E/+SiyP1MqBUDMdP4/MdSuP9XmmD9Cp+s/z5/XPztFBUCyPvc/WtAZQN+M7T/CvQJAMt7MP/8ODkBMCqE/JDzjP/yCKkABdvM/dqr3P3d66z9dbe0/hNnDP1lW0j9o6RhAxA7rP429GUA2Kw1A3qj7P3e07T+fvPw/4/XqP96lEUAmK+w/kqAAQKaRvz/V0e0/1eTePy0FAEB/JKw/eQC1PzuK7j9bNAJApuzeP69h+D8UAcI/KKHSP+7Y2D824/A/nyokQOhT/j/oSPI/BUrPP0kd/j+vCfs/8JzjP7/GBkAlec4/WtTJP1Uizj9JfQpABa/fP8t+1T+HyuI/9JgKQM2U0j8ux9U/g+0mQGtf8j+2gQpAelDbP1XfN0B2Jfc/jUs7QBpN7j/qFro/Xi3bP6LWE0Doz50/GhrLP9FhCEAOtgBA458EQNSPCEB9FRdAxl7aP19U5T/7XhlArLrFP9CZAEAWvA5ABt0sQC+0CEBOQiVA7JgrQJfeCUCal6w/jBwSQNZz1z/QYCRArYzyP+bv9z+Di98/4KbcPyvi5z/VeRVAgDkFQK5g7j/eu8E/tcKtPzV7D0BmcS1Ax6TZP62TD0B0U9I/uprWP1BtFUBi/R9AmykCQCxGwz8RF9M/CObjP6AR7j99LR5Af+7XP+OdD0C9tq4/JXIHQLIIzz/8Pdo/dlzgPyk8MUD93fI/",
          "P4P/P39H+j8AVuA/+l4AQMV93T/r77M/rsUQQBWfAUDbXQlAD3EYQE+e6D9U5wJAy37tP/CT7T+MNv4/QPwLQOzyB0C3Y9Q/GgH1PzvD5T/oc9Y/0+fSPytK5j/slOo/QSKsP+Tq6j/ZHuU/VMjgP6Cj0z+Y2/E/nAfUP2nEBUD4+/0/w3cJQGGREEAv6BhASFLcP6LfIkB1L74/698NQDP2uj8VKxBA2yzTP1O44j+9Luo/kffaP920CEBeXvQ/WWXxP+F85z/28Po/GQ7uP2LiDUBOTgZAzWT1Pwk33D+IBf4/frvHP1y34z+OFA1AynYIQFMA+D8/VrY/9LTkPx+RN0DPPQBAbkjrP1Lcxj8/4Og/DbUeQNWq1T+A2gdA67jgPwFCBkAn3w1AopUrQEMJ5D/9LwhA3bf4P7wiFECu+eQ/bEEZQCHm+D+LQ/c/Z4AaQIe23j/NZeA/YkTaPzHL0D/PmQFAxUH3P5Ht8j9BOCZAgr4aQAF1EkA31h5ANw/iP7Nu4T/AZBFAaWfgP+IzAEAL6+w/BxkBQE3/3j8B8Nc/j/jjP3Q15T8Wdvs/5VwGQJQy7T8/nwVAQuf5P9YeAUC1LNY/9UwTQE9A9T9YPwlAjKrNP7NA3z/WVeg/Ds2pP0BmDEDxFAZAGAvYP+4eE0Ca2fs/CJcVQK9axD9Ezi9A6wTgP37i8T+9Jds/bCgWQMRaAUDF4Og/08LcP0kt2T86TRVAsmURQDFi8T86OcY/4mkXQEqpBEARphNAM9PeP51P6T8oXeU/LeuqP2+Jxj9Tu9c/AzL5PyTF6z+Hqus/B/EPQOD0BEDrowZAfn7bP36kDkAJRNA/0xPTPxpPD0C8zw1ALLMPQAkiSEDOats/v62aP6BrB0BDVAJA8KzhP4L94j/JYQBAe1+uPzWE9j/ohwJAytAgQLWdtD/XhQVA1O8mQI3DsT9s1vQ/7Xb7P9l1AUA67rc/dwAVQFfp6T+5Juc/blz5P8/dFkANrvs/8VTXP1Pt6D+YzwBA",
