{
  "model": {
    "architecture": {
      "backend": "tensorflow",
      "class_name": "Model",
      "config": {
        "input_layers": [
          [
            "z",
            0,
            0
          ]
        ],
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                8
              ],
              "dtype": "float32",
              "name": "z",
              "ragged": false,
              "sparse": false
            },
            "inbound_nodes": [],
            "name": "z"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_8",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "z",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_8"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_8",
              "trainable": true,
              "units": 16,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_8",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_8"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_9",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_8",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_9"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_9",
              "trainable": true,
              "units": 32,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_9",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_9"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_10",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_9",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_10"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_10",
              "trainable": true,
              "units": 64,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_10",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_10"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_11",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_10",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_11"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_11",
              "trainable": true,
              "units": 128,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_11",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_11"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_12",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_11",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_12"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_12",
              "trainable": true,
              "units": 256,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_12",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_12"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_13",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_12",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_13"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_13",
              "trainable": true,
              "units": 512,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_13",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_13"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_14",
              "trainable": true,
              "units": 1025,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_13",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_14"
          }
        ],
        "name": "decoder",
        "output_layers": [
          [
            "dense_14",
            0,
            0
          ]
        ]
      },
      "keras_version": "2.3.0-tf"
    },
    "hash": "3caabb689ee72160b844052b881dc48273b59e0acc82d4f6898ec62e5a95cabc",
    "image_data_format": "channels_last",
    "input_shapes": [
      [
        8
      ]
    ],
    "output_shapes": [
      [
        1025
      ]
    ],
    "trainable_params": {
      "batch_normalization_10": {
        "beta": [
          "ajSBvDKsijwryz899wupvG/wKLsBhlq7cRYQPGSxqTvKtwe8kKDnPJedK7y+6sO8F5QVvXeomjypx5A81BKJOrs5xjvSP4W8938BvSXBwrx2HYe7ttYuPUg07zoZokY8F+HLPHQzQb3dmRS9jyJSPFvPB7wJI+I7RbbbO3rX1rw="
        ],
        "gamma": [
          "9/94P86lgD/ixoA/2/mBP98Bfz/XLn8/noeFP8RDez/YSH0/8Y6CPwcheT8weoI/Jad/P75Sgz+Rs3o/L6J+P+7egT9uu4M/eF13Px+/gT9BGoI/ujR9P1ZAhD834Xw/hrt1P6BqhD+j2Hw/Vc96P48GgD9LynY/UQmCP3mRfj8="
        ],
        "moving_mean": [
          "/6DkPgWRPD5m+LQ+IEfFPlUoxT6vcI0+x16qPpggcD5c+U8+k4bpPlIiUT75LXg+uYGVPrtxfj48Sm0+h1DZPkU7Qj408Lo+S45pPvQvuj70jXw+uPG0PiqCRz6hhDI+nTE8Phi12T4se6M+QZXAPsKQdj4DhVU+iQ2nPrcFoz4="
        ],
        "moving_variance": [
          "67/jPk3Nkj6+fcs+Ib7TPo3yGT9MS4c+EaejPqL9Qz4Uiok+cZG1P0gmTz7WaYE+A85YP6YBeT7Hesg+XpbYPhZ1Xz7zMKU+DVNPPqphwT4+C7k+V3+WPs6T0T51s3Y+GiYhPpbiCT+qCAY/oKDHPtlJWD4AoYk+77D2Pn7ntT4="
        ]
      },
      "batch_normalization_11": {
        "beta": [
          "QhFVPcrLqbwXlRU9tVwPPP+EaD3igam8/bfoPJvi+7yAjmG9tMDNO4cJVD2mFSw8BwLtO7r2pDpG1ue8oX57vJ0wHrxC0gU9sA3evNsYMb2VJVe8dFQDvNKnxbzYZ+w8DPLGvF61dTxLXmG8AgCuPAPZsTxVsIC7dr8fvJH+2zwF1Cc80WMXvQWNCLuansA8ir0zvW6nCD3VCUK8jBAEPFHLEr0Y9PU5cUbBPJpSVTyeEF+9XEkNOlpmET1cV187tfbCvJdec732OoM86FM8vZ61rbubXLy8Yl7cPHRBGL1mgB+8GCZhPVnoGD0iBoa84/yjvAA0+Dx6dBq8MmtdvQ=="
        ],
        "gamma": [
          "I3pyPxK+gj86LXw/pod8P+q/gz8PgH8/VtGCP/Ocez/vZYI/AXZ0P+11dz/WFn0/TDt6PzANej917oE/CEN8P+RDhT8UzIU/Olh+P4REhj+5cIA/rJuCP/6Jgz8h+ng/+kuEP5/2eT8DjoM/oO+CP475eD+agH8/VoJ/P8Vafz+KN4Q/fx+CP5EWgT+gMYE/vneAP7o+gz/9sXw/+jGCP8FhdT+OLIA/L9h2P5vDdD+IZoA/emB1P+IYez8CzIU/+xiHP36ggT/ztoE/w8mCP+UGfz8wfoc/f+N9PwHkgD8uFnM/fAeBP312gz96cH0/htlsP53FgD/pjnk/Bgt4Pw=="
        ],
        "moving_mean": [
          "cvbAPkO7pj7EinY+Tw6BPpBCxj4Hg6M+ccfpPjosbT6Jc4s+fIluPgxCvj6wBsE+NvCUPjXBVj6/NYw+U2KTPp6toT7yUHA+WIjIPsxujD6QQnY+4gaoPiMriD6zTKY++//BPrcGZD6YyZg+nOzBPuHPoj4V46Q+0QatPsZUgT49Rm4+MyCkPlu/dD441rs+owanPgI3VD6EvJI+lcd9PowbeD5/eqg+xjiJPlcPYz4fxJw+UFrpPpysbj5H/3I+8QqFPikUdj7SZKk+6tjMPuJUgz5o2qk+bF+RPtwfij51voU+oqMIP6yuzD5De40+B82UPlDQ0T6uS50+zLOOPg=="
        ],
        "moving_variance": [
          "N7ifPv37BD9kfXc+5OXWPnKH4j6hft0+nbJtPx5Dpj6z36I+0GKePiU4jD5L9sY+jEJzPk2wjz5Ou84+G+SePvLppz6Qs30+3dgWP53Z1z4z68g+LrwGPxS/lD460K4+Wa0rP9kZlj6jfLI+rwEUP4gKkz4hqrI++a8QP0O83D5aq50+v9sIP090sT7tV7I+Yb7TPsFhvD6XIMg+oi20Pthoij4L9tc+oTt/PvR8QD4wuKw+RczvPuj9lz4OTec+X3cFP1FcBT9uosc+lWjwPjW8oz6ElsM+O4dqPjTGoT5+3FE+gfI1P73Buj7GFI4+g5VwPpmi6z59E64+joChPg=="
        ]
      },
      "batch_normalization_12": {
        "beta": [
          "g834OyInbru3AAC9JMh5PAdBfjzR0/Y826D6vPtplDzDVwq80HiYutepAjxGHo28hkllucgbvLw9cLw8wuanvGLuDL2vLT28SeQUvCJqujuB1o+7PFe+u5y6CD0w6YU8yAR3Ow1uKzo8iX68rzzkvI/PQjy2cJs79KlBvfASrDsBz6+7p7h0O/JJ7jy+a2i870RrOxtmBj1ftqs8jhFcPJSBxrw8YeM8yHtOvU+p3Dzyyhi89nF7vOjVYjyKqPw8ZmGZvMGm8LyQcjI9asFgvLC1iLz96Me8MqfivIVekryUTAE9YUfLPNiLsrxjE+G8jVsqPGgYFbzVjkm8gyTnugJ8MD2pZ4o8sDKJPM8AKb0Qhyq9J9s2PLblwDtJjg49yjrUvCs8kbwraMY6d/TGvL3pCr2xQE+6rHiXPHaIrzxCSxw7SrMyvDcZyrw+ua48PUMIvR4+Kj2Yhc04Q3PtPE/hYzqiH1Y8KdrNvBsTRbxDwvM7JsgYPaZIEDzyOmU76Si9u2thSj3gbIE8/NUzvOfShL06qAe9rd/0PCU6ybz9Z8o8zNyVvCJgTbzh9l27KhA3PUhfPb1mDHs7mBOfO6CLc7wFThM7hAl4vAz9iLzABp48lNwEvbgNCrzQtW+68aIXvX+78zs3KaS7rHinPAbj2zxTGsU8zNxPvaQTVLw="
        ],
        "gamma": [
          "DPOFP6p3ez+RpYQ/bmpvPxX8Zj8ikng/ujR/PwolgD8dU4I/kjCFP88rez/73HM/5ZKCP0dRgT+El4I/mOeGPzmueT/J7nA/LI+DP44ggT+kaXg/dMZ0PzLtfz9JJHg/kD+GPydafT+LvXo/IJt1P3l6hz/WxoA/qoR3P1VLbT8Lg4E/By2DP2pegj9ckoM/jdl/Pz3VdT+8OYE/JV56P3Gzhj/Mz4E/HxmAP3v2cz8JXoE/avlwP5P2gD8SZYE/5iuBP+uPgz+jZ4M/WIN6PyY2gD/9n4M/jYiDP7lAhD/AmHo/E/WFP7aygT8pKYI/owmBP9Wafz9OIH4/IgF2P/pafD/hm4U/0XZ6P9Jiez+nJIo/0HSDP5u0gD8/I3M/gjyCP6gKdT+pToI/pUaBPz2Sfz/18IQ/PrF0Py0ffj8eX4c/tut7P9iMfD9Tsn0/4TqGP/Idez9IlXk/EXqBP+qQgz+5AYI/psiAP5NVgT976Hs/U8N0P4rhez9ApHI/XZiCP+K4fT/JsHg/7nmIPzUNiT/x9Xw/s6J0P+RngT9NWXQ/td95P+Olez8Tq3E/XOyBP8dHgj9rroA/hDSAP18Rfj//54U/qqx/P9jrhT+NPoA/UnN5P1zdej/7/Xk/rJ2BP/f/fz/2d4U/o6iAP4ZRdz9eiXs/JvF9P/fEez8="
        ],
        "moving_mean": [
          "NCvgPg9edD7orZk++Wa9PgxKnz5hD8A+GzASP9g6sz5phKo+FJ8NP620eT7RLJk+swmRPnGT+z4gh4o+JrtsPsyW3D5xHrs+6nvNPgbpLj8oCNs+mpf6PtHV6T71578+Qn3ePq+j1z4fjKY+EdQCP2syxT4fu4Q+R851Pj5DmD45f6Y+TeynPvphfD74HYg+aWztPtmFdD7nDaU+Spm7Pj155z7Da+A+t+vBPqkUpD5ESBk/UXijPp/7jT7NRaY+V5ChPj4UCz9VWwk/h8qvPk1KqT7/5eI+RBezPsN7jD4uVbo+iTerPqtB0z785+U+vBnvPrFAsz7RLtM+b5TjPvS7qT5X9os+SK0aP4hL3D7/neo+CQDDPjhhgD6bv/U+QqqoPgpEpz49Ft0+sjyYPkh9oT46Vr4+bqe7PgknoD6FCQI/X3iOPrIf2T70SZw+EGblPil0vT6WVPM+1cfvPtJL1T7yK5A+JLXzPsprvD7C3p0+e+TaPmqhYD6ugP0+CBHAPlhM6z5SJLU+ayTkPlqbrz760oI+vyOnPsVD4T50fxg/3V+iPsT+jj4zsd4+wYf9PpuYzD41opI+8yGuPge8uj5bQaw+STulPi4hwj6z3cg+EqiTPjXQvj6Kl6A+rFzBPpeY7z7jLKQ+uIWNPjn+wz496dM+Z4mTPmdDaT4="
        ],
        "moving_variance": [
          "dc5SP2YO1D7UqAI/cEO1PpNPvT5WvLU+28NCP+JE6z7oGfU+1dpYP0cQqj4Wy98+GFPpPlsDbD9Sd9I+crK/PiZf4D6Jl6s+Rh8PP1iUjT+UuCw/hmXzPgO7Zj9MiSk/yDtwP1DzGz8wpr8+gqEtPwldjj/9oBo/GnCjPo3trD4uHgU/3IwyP8aR6T6tWB8/A0SsP9vbsD7husM+ttAfPxlqlj/eTOU+crEoPy+Zxz71dWE/0ybYPmxqjj6Ioi8/R/LcPtYcSz9e4Us/bXI9P5bzHD/qFBY/iPICP3Cg4D6hrbE+UMEyP0lsKD9bpds+ByKMP48C+z5tBv0+kpIPP++lJj+muB8/uOEZP1NxAD/cL2Y/KtclP0NvAj+FKbM+yeAcPzs+2T70UVw/D1P3PntW2T5C4w4/ThDTPteG1D5j8TQ/z2f8PlMLCj8JueM+4xstP/jJDz/r0OA+BQpnP+ARkz9Jhxg/4Mk8P0cb6z7W6MY+jpWbPkIvnD4j8QY/ubdwP75rCz9E9g0/Sbs8P6SIJD8+wuk+0M3xPhzHTT/byBg/EsUVP1LX1z4TPeg+848rPxaTJz95ASE/70szP+oJ7D6Lq/4+NnsAPxTfKj+fLT0/wDa+Pt+0wj6vNAc/SL8lP4IS+D7FNhg/NkvKPjT48D4kpCQ/CRSTPu43ej4="
        ]
      },
      "batch_normalization_13": {
        "beta": [
          "QeOQvYGxGL3pK1A9UQeUvPVxPL0xcDI9xFDovDftCr1lJH07SiIDvEuYQLz7cx89FNhkvdl7PbskAeC8RgLCO1616zw4wFk8qwvePL47Ez222zC9geVlvQg+hLxgzke9HEilPWDVLD3RDOU83zsGPVuLa70z6L88kM/vvIC3BryfPXW9MWy2vDjMC73uFjy8UqxZPQx+rTxJoIQ7F2uKPabHBL2o/hS9i4k0PV5X4LtflVs94lTEu4RQpryZ3FU8Cr8pPKdvNT0iwhC9GO4lPS22Sb3nYLm8L7N3Pd1Rubs/Wee8D4AAPX6wKD0HmL08VPGKPd0KM714CB+7PUSjPJ4sSTuQ/3u9/+ELvRRygLwwBne6v8o+PacHSDwUpYY8O734PBAinry2H/U83AUIvTjlOT2kyC49YjqGPItNML3V/7U8xA5gPSj82rzcoDA997oXvFXIAjs/QaW8dew+vZnqDD1wIZ+8qWd2vfwYhbwS8xa9JuBMOwOK/zwx9dK8RZ14u2ntgDxlop086t+KPZ9yh72uNAy9EsQVPXeoKTztlts8JMlovNA8ibwI/OQ81spEPb/lhj2ralG91wGHOylAa7xHdNw91dw1Pbp+Aj2Je2I8BxNvPVtUOL1iWy28p3AavHNlIzvCCAm9wvczPbePP72Qv7K8HW9UvUWcdT3Ptmw9cnqLvXPZCzzmWm492d55O7zMc7ziznY9CBAnPXAHTj37tTm9gQXNvFPTfD1+qUa90U0HvTweI727WAS95CGVPDnpRj3LnwC9ViZfPfi97jwU8ZS81Pk5PX5PRrzpfIU8WlLevGLrrLw1lkw9x9osvaDjJb1Ed0K9CiwZPaZ+CT1HoQ89dloJPUtyr7wt/Ee9ywgRvRpVPrysn3e9OJH3PBEjnLtEw/M8aijAvOHpGT2TL4C8NRw9PZVDPTxE8oo9yjGNPZGU1jzuPuQ8XewQPMs8kTzX8h69t+lbPVyJFj3ivF286bs7PfcDXrxl6Ug9WFRSvM8FJb1RGWE9",
          "dD/MO0wUKj0YDTa9wxARPSYfkz179PC8RT04PYDrqjr6FAY9sT9DPWIqCj3B6Z88z30FvfbgKz2H0DA9mwrkvJvvn7vhlUK9YeoPPfROQj1UKsu8MFptPcKpnD2CT0g96DsIPAOsLLyIIH68dRdNPcc4tDx5qHo83ZzEvKf0krzvFzq8TlhlvQmxRD1CmRa9gsMUvP7rhjxADsW8Qh0XPX+eFD2elcE78FxgPeoNHD1VTEM9ppZ/Pa8bTj0Maiw9jZkoPae2MT2DAFg9LjtTPVmaNr2whUK7NtHou72QYzxf14s9Y1YuvepDkbyo+4687f7oPIgDUz3O7Te9QRYovQ=="
        ],
        "gamma": [
          "RHhvP/3ycT/f8m8/IXZrP57mcj9diHI/U6ZyP26ibz+rFm8/h3xvP3rcdj/7W3A/mWlvP5Ukcj+HgGs/4kFxP0VlcD/FcW8/D8R0P/6fcD+1IXM/Ull0PwMDdD9oBHA/HdNuP3zgcj9dW3M/4eZvP4orcT+/3G8/cONuP1dmcj8X/nc/L7pyPxcvcT9Hv3E/NBZyPzIadD95tnI/vO5vP8CgcT8kXnE/0LlxP5xLbj+P0W4/DphwPzGScT+3CHY/0EtsP9Kvaz9K33A/QpFwPzPIbj+hF3U/cip1P5NUcj/IWnU/T3NyP/B9dD/d3HI/nStrPxhGbz9+8HI/0GBxP0XQbz+rQG8/OFp1P9NscD+epXE/7kR0P6Inbj8st3I/yjJxP9Sjbz+xQWs/fWp1P/lLcT/49G8/f45xP1jCbD/66HE/AAtuP2tXbj+5+W8/GLxyP3Mcbz97x3Y/HhdzP7ULcT+O9W4/ezRxP9Wmcj+ia20/pXlxP343cz/jZmo/DNl0P937cT/bc3M/SiFwP7oRcz/Jm3E/o9dvP1twdD9+kG0/f+JoP2Kscz87Omw/Ou1sP+r6cD86JHE/W753P53acT+Aj28/MOpxP+5gcT+JuXA/dHBzPwovcD+JyHM/hY1xP27Ebz/irm0/aOBwP0FPaz/4ZXU/Cm12P6m5bz+ax20/1DdtP9Hmbj+zoG4/4Z5wP7Z1bD+i528/YHFwP6BqdT/3BWs//ntuP/BPcT9mBXM/d5FxPyhEdD/Ekm8/iutvP1ltcj9saHU/E41sP2K/cD9/gWw/8EJxP0sXcD8hwHM/jP5sP5Gzcz8ZwnY/lDF1P0tFcj/VZXI/oXN1P4zUcT/QJHI/onRwP2LhcT/0QHE/L3JpPw1Jcj+S2Ws/HzN1P4sdcD9TdXU/TEZ0Pza8bT+qW2o/TQZxP14lcT9bRm8/jt9vP5QCbz9VpHA/XZtwP44+cD9rf24/gW1wP0PKcD+jeW8/S5puP8sFcD9ydG4/3VZzP4w6bj9UjG0/",
          "uv5wP+iccj9Ms3A/dHhxP2GYbD/sU3Y/B8xtP7mvbz/hMnI/YD9yP2Ccbz8xrnI/ifJvP238cT+JiHA/IlpyP0Scbz863XA/379uP6p7bD9gVHE/vA5vP3eAbj/VXG8/MGpvPzqxcT/W0G4/qaNxP4p6bT8elm4/o+ZvP0j6bz92dXc/XUFwP7sncT+NGm0/YvdwPzvYcD+wUXQ/VyB1P6QucD9lwnA/RuJwP5xQdD+xGG4/2G1uP2rMcT8sjXE/DaNqP08fbj/79m8/xqRvP+ZQcj+PU20/me1wPyv9cz9AW20/BE5vP7XHcj9UQW4/Gn5zP3YMcT8MM3Q/M7BwPw=="
        ],
        "moving_mean": [
          "5BkaP1+p1j7UnR0/lIHMPgbh4j5hRTM/f3PoPiWE9z6GzPk+e9kMP1WUAz8riOM+Y4HyPrZVED9dbMo+xYHTPpCtBj/mL9g+AwYsPwpw4D5jJdI+8vzBPvXoAT/6eck+Oe7tPuNC6j5XNxw/aruwPiypCT/DsLE+8jolP8kd+T7coe0+Cj0MP75m/D5R38s+eLnnPl7D2T5C3gc/rx6zPrFc1T4yZx0/4M/hPtcltz4hbPk+TejMPoxNBD/HuO8+VNn5PmB/DD8ewRY/e/WkPtLF8T79bgU/U8n/PmiHsD4+WwM/7gixPgmH0D6QMQQ/YasPPxJNOz8j59M+UonaPjcjqj72+jg/a+HgPmubKT8T4/U+uK71PnDSFD8NEvI+G02yPoieDT9hpgU/1XkAP4KDxj7ortQ+5AW5PginCz9KsNo+RjjfPjKn5j6JsOU+PMYIPwjS6T5jF9c+RwQDP8Ag6D7/tw8/6+AAPyshEz97S/4+XbcTP8IQ3D6LfRo/KyEFPx8y2z5JYgU/JC62PlH/2T6d35w+GVDSPo/0+T6CDRM/QvXuPsGq7T47Ia4+aN7GPvtr3D7R7AE/TrsFPwe1tD5uk9I+x+DhPp+t9z5xst4+zV2QPvDznD4WpMo+s+m/PqsUuz4SL+k+QS6mPsCasz7FyPE+1xHQPkj58j7Mx9U+EGsYPzpgAz9oXe0+hzsKPwlr+j5rbOI+JOLMPoZO2j5Sdcs+MxvuPu7dAT+vmPo+T6HgPtjB+T57sfE+K0/3Pn967j7w/i0/noPxPtP9Az+aoRw/kzf8PimFyD5gehU/hf3RPt0fBT+xad8+if0EP6bT1z4ijvE+PAzfPgBN4j5QAP8+9LMdP9D1KD+YWhA/hYfaPsTNqz7Ilyk/QojLPoUvHj8Bni0/6f8OP75+BD+Co9g+Wt2iPpy02z6CsBs/7wTtPsVK4z5doSQ/MEjcPigm+j5XOwM/zeXBPqdt7j6J8QQ/d/roPuoK3j4PuBk/6ErHPicuHT8p8a0+",
          "qADFPnB40D4AAu8+z8MaP0Aqvz7I7CE/c5TZPgqDCj8mUQs/gR4APxwM/j7YMh8/BVGzPlLA5T7WFvk+snMsPx6aBT+iAxk/RcLBPmhHDj9nSAU/XW3kPuC9kz6EaeY+/QDBPgtp9j7pDZg+lyq/Phm+6T5a9ic/V17dPmL0ID8aKtk+vBoMP7Do9j4LZfk+8TG7Pmp/7j5LVAQ/1p3mPvfeEj/12gk/lAoCPwbW2T70/QQ/Ml/lPkStzD4zOAM/hnPvPhd+sj5aJec+Hpb7PqPn+z7H6AI/pif1PpmmAT+KPAk/wFUDP6IyAT84C9A+U46/PhZrGT/Xihk/4Zf+Pg=="
        ],
        "moving_variance": [
          "zIMnP9ZfbD8JN5s/C9pVP6yKhD9YGJg/0fZSPwfOlT/D3ns/loR7P3TN3z8YI+I/gECKP8e8aT9F6e4+EGqlPwxKWD9KIWM/cRuwP5FiED8aC6Y/M2x5P5pOqT/NkoA/iYWjP6PosT9WIc8/L8wDP1rIkz/u20c/HilAPy4uqT9hh5c//Ga1P3aXnj8QiYg/yGTBPxN4Vj8tWXI/02SDPyvVNT8oQZg/5FqNPwScVj+iX4A/uS50Pxq9xz9FQMA/uPk4P/GbSz9r1qw/CNlFP8Adcj/sabo/3oOcP38tej/g/Zo/2xxIPxD3sD8qw5M/2DdXP5i7rD8maIw/aEOSPw4VUj8tDHE/iB2LPwPfuj8ygUE/MxSoP1ePsD+aOIY/sChdP39nSz8KOhg/Zu6AP5jYUz9jnFA/L7VwP69ZNT8nNms/oa5PPw7qnT+Izmk/UNytPzyPJz+0v4Q/tfloP22/aD9rcEw/3KZ6P5uRiD8iWj4/puO8P7D4bD9n4nI/zpCDP+QhnD+Hlpw/oi9pP471lz/Clew+akKrP+M0mD8Ye2I/LZ3sPoAtpj8xDyE/mvdCPwzZqz8IxZM/SFLIP/O5fD9qMqs/Pku5P/lOUz93V0o/jbJJP2jQUj9Mr20/M95iP94dgz/yUHw/ac5CP5DIGD+Urqo/qT6GPxPMij9CI2Q/mrB3P8qHgD8Rb0k/fSRrP/1mIz/eiHA/pS1zPwgNXj/W0Sc/5nRnP0ZWkz/iZ6o/OK2YP0oTXz9BHEk/wIdtP7QMlT/xitw/Sa6VP4c1iD/atkQ/QMmNP/W1Aj/leZo/UATgPjwrAkAPI4s/rALFPxQGYT/Lx5s/FPmIP2a1Zj8pWI0/2jy0P71Vcz9klLc/MK0PPwGVaj8Z3oM/7P6VP/dIaz/WojhAiIu2PyrKmj/1/Rk/gfglP86jpT9lHKI/R5UrPw9Huj8Nd9I/k1laP5XBxT+JLU8/uoKAPwWaaD92okw/qflHPxCLXD/8+Yg/rFquPze6nD/YGoI/",
          "Au9BP6Zqjj9yMMA/XCi8P/uiDz8ENf8/fllWP0KoZD8WrFo/1DCVP4g/gD8Zb5w/O8pZP51fPD+kd7s/CF+6P1cRNj8e96k/DF8cP7mPWD+iroo/A9WRP57+WT+s91k/CZIkP14ujz/VAys/sKm1P6oplT9bbV0/3NYgP9VVoT/fWWs/VhSgP8J3jD/EQYA/dwWlP6hHVj9FBYU/X/i2P4HrSz+507E/CNnVP+htpD8wMYM/7+NKP/XnsT/KsVw/IJIbP0uiMT+qUXc/tt4gP8woXT/oZmE/r3BuP+bm2T+sMFs/bHFbP7Fbyj+iFU8/gX1kP3ECxD/BXok/KjYyPw=="
        ]
      },
      "batch_normalization_8": {
        "beta": [
          "TA9uu5CdUbyuaqS8BDyGvG33LT0KrIw7LBjKvFqcQTk="
        ],
        "gamma": [
          "KeSCP/d4hD8GfHI/cSuAP14Xfj9pGnY/BpyAP78BgD8="
        ],
        "moving_mean": [
          "rXu4PushBj+jyYo+OhHePn089j6A3eY+ru3FPl5Dmz4="
        ],
        "moving_variance": [
          "a3INPxpIYT+18Q0/zIpDP86xhT+IFig/XU1SPyPsID8="
        ]
      },
      "batch_normalization_9": {
        "beta": [
          "qJYavawIubzINp28xsTJPP8Grjy1ew+9Pi70vNMTNbyKCzg8hlRXPYhHAD1yYha8sOg5vItMJzzvKqG87/WzOw=="
        ],
        "gamma": [
          "XxmDPwXIgT9Qmnw/UAiAPzmifT8bLH8/bt6CPxS7ez9WK3w/hQ1+PwCNfz+nU4A/eWSAPxAgeD9zPoI/gDqDPw=="
        ],
        "moving_mean": [
          "lhzfPgnX9j7a1Mg+v8noPtPVlT6flpI+IROMPh2mWD5QQK8+SpuAPn+VmT65maI+9dbjPoxdvz7z/Z4+aLPrPg=="
        ],
        "moving_variance": [
          "GH5rPympHD+9CJg+CofUPuLPiT52OeM+YgIxP0r8Bj9FwDM/Y+rFPifLjT7b/50+Y+zjPl2b0T6fNBs/VJj1Pg=="
        ]
      },
      "dense_10": {
        "bias": [
          "gIMAPXQOsDzYV848Gf0NvKlwEjxTadm7Y4aaOzkWXLyowhS6cIcgPKj3Xj2gDf+8XS9ZPTEDWzyHa6k8rCENPbhSJzwP4dU81vK7O0YX+Tvg6gK8eZVavCAwxTvPwf07aU+bPML8H7xC2Ym6SutpPPMVXj0Kv8U7cCH7u9RxCT0unTw9jG3tPAAUXLsANhc9sSZlvEYRhjwapSA6joYkuxLQYjwqbCg9mwXwPA/TKj0mv6s8OtpDvFocDrxSdta8Y+zFvCcSy7sv9/08/IzPu7tDirv0gxy8kmExPMJu+zvJPFc8PXPhutxayzz5QtM7LLRIPQThgDymX7O3qUfAPA=="
        ],
        "weights": [
          "/8/xvSg5HrxEDTS+sZe1vXW3FT7dQPK9orikPUtSCz1zkRa9Qyk1vjvewL1RbEE9JN7LvMQWHz7jESK9MEeQvhvrtD3ss/M9EaNzvfVvHz5TCKq9rkfIvExIHL45lSe8JERvvJsyQT61aAG+UrR3PQDjDL6vfN+8xQhDvRRh572R4ym+Dg7xvcHKzL3lbjY+eyI4vdLv/r1ssC8+fqGWPa+IFD71obs8ZkvGPQdt8D05GY8+OSNUvcrHJLtl1Ue+Bv4Cvk0DMD64lB4+KggxPoasZr60cA2+w0GtvOb2+L2BiwO+68jgvARE2D3lrDk+4bzwvc0iUL3F9tO811IEOhE1DT4ouaK8PkfduXpb3z2knhO9i8l4PmRQpj1SRkq+0w1UvooWSj1VrSY+mbCXPRZh/T08EC48FZ63vVkBsj41NP88MJc1PX+YHL7hR1G+jkCKPmdfs72zuG29QnZKPhbbWz39H/G9XH5QPhsTbj4VfAO+wabCPZOd0T2a3M29TBS+ve9n1D3KNY0+9DxRPtcq+L1Aspe95eEavlIgDD4uqz29W2GnvbdmFj7Yx/+9hA32vTbvpDymAgG8dyNgPtBR0j000Zi9LmVYPhTgp70fb689ekckvVeeI75LeYW9Lp9cO+vm5z3fUWq+kiiavgelEb7BzAe++n5/PgC2lT7dCVk+I7rWvE1lgT5/W0u+fq+MPlAG3L3GV7+9jGnnvWwXDL6fc1699rIdPmakPD6650c+AxMuPbw1Yz403eq9x/OCPqyDGj6+fsc9ovJYPuY6dD6No9I73C1yvVtueD5uONa8XUylvoPvqD2bjJK9suGDPSvemL0rBiC+IAO/PQzzar3ib9i9KUlbPsl/rz3UjKq+qN2NPOSkCb6lDBC+R9AGOhtWFT52qVC+Fp7AvR81ED49UIM9/Tr1PY7gbD6o9uw9TP4gvvynlD3dEUO+oWapPuajzrxc+Yo9STqfvJ5mRTxkyWm9f3RbvrO7EL32SgI+3hCjvjXRVT1F9OE8",
          "1eyVvvvqfL67cv+944x6Puwilj6J2C++WeRuvQutSb4PfLk8qL2yvbPQgL2aqoU9UZXFven8AT4EDIo+IwfevdjZqDwohwg+lLAAPiSEWbw4Hju+PnhwvtToj77qqQS+3Xh6PLPuBz579ny+Q2cKPT/Glz7SLa49oNThPY/Rq70a7qY9cnIgPtkVKj6E02a+JeSiO0gupT1AACU+dtSNvNy1Lz23Cek90YVHvqtLhr2h77c74NlmvuzYLT68kpU8MZehPgH1Hr7uE6i+Y7uxPdxHGb65njo+JOEfPipfUL0JiPI9vaEavkWZETywzF++ZEbtPWXGLTyP5L+9mJNhO0dCTz4GA2C9VIgpPZjOgL1hnmY9fouHPg4HJj6HIXw+jm9RPIQuDj4edfK9O+lyPsxLvzxO+jY+ZZbgvc84iL0v2Zk850NLPRAsa74kXq2+WqTRPdt5ZL6cyog8l6KNvVOEvz31Dy6+NppOPupEtT2DwCm+GsEQvs1c9z3Piow+mOZCPYuoUL1RSW69KbcpPvPJ/D35Fc+9II61PhT4Fz6G9YM+IbEXvhWUGT5cIUO9BqmKPRQwhD5qzVA+iUaWvTtoT77BXLq9/EJDvUzg7bxQ6wo9W+e9PUpFNT5QPmY+mjoLPZJ+Ur5cqg29UvFVvd5QCL7qb7G9A4FavEg5jD6M/sS9ZXHzOq8phr7Gj/69xuinvBbT5DteIYK+DgUuPQUVsj0e1Ag+t5AEPasHrL4HzgA+wOlHPprooj0qgkK8OOo0PVGdbTxSwZ+9AD4Qvl2Sq706FYG+vRKTvFJIZD7WbAm+f3/lPFFh3bwR2ge953ekvS/eg72dI5a9cvzzvZKdDD3gSpK+DXcLvvkokb6GQUI9VpZWvePNmj6R01c8xKZ9PgDKyz3ztpw9hTouPi9oXb5SgMC94ZyHPclxlD4LulK9kcRLvQXfY76sewo95Gw+vgKVSr1RpnY9rBztPYVEvb2Krh69+MNvvMMBRz5IpbI9zxTTvHXsjD0SChA+",
          "xhp0vpKvl75wCWQ+CJUYvhXiDr7ukj+9+gjxvS5AvD187Xc7YCJzPLcZlD5Jr5S+7WcMPRzyxr2Or4O+ALhhPVGuBj7CooG9VBIQvpEsmj6o6Jo7iKHfvbQ707xOboe+OOC8vSjuDT5OLyQ9OYpDPsRhFD5vHQk9Ga/rvDGIID2Ln1K+KQ8IPuMvvTz0Koi+ZeUxvtV27b35lQO+R5bwPaM3GT0vb0c7aZfJPVDiqb0rH4E98KW6OzcH8b0qxSe9Y3ASvOzKEL4IZWk9ppBhvPb7qj5tr6+9JmEfPiI5xrwBbA09DjMvvMDEOD4dTYa+fx98vb7f1r28pPm8wItovrb7e72yynk+e3vYuYGpUj7Eea49lpgpviT7AD6EaJe9GGJ5Pi6IMT68RjG+fx89vKIzvT00YMS8qOKqve4Mo74hBCs95cvzPaAGCz69MXq8VQ5qPcb9lr0+yRU+D9q/ukT2l73WhCQ+TnvgvaAZ0b0rsIo9rsc6vY2oFz6ICzy8UHjLvQM8s73JhAA+WJpGPiFJSb5KFYq8DyQaPsMIh76iGZq8x8+bvXvHdL1luR2+rW1MPgP3NL47wJu8zZuQvAeciDw2D0q+C9ogPryiHT0YOoS98fJKvA+PJr1u0lM+GEkKPhWRLr2jezA+8JZRvrHvfjyUaAs+iqRCPnt3Fb2bOy6+biJVvuCd57wkh7I9h+CwvR42orxxd7E+1PeCuzQHEz4vuj++3E+1vUU0Er418kI+LgltPhirqb1Emu49uD1LvtJdebz/npM+QCYrvmyEjD6NOcy8OR3DvRJzGD6RRD0+XB6HvNYWiD6Vh9S8D5/9vY1a5jy7es28vi+WPmNN9DxKQU0+ZV8oPhJ9/r3cTyG9+/2Ivt508r0tIYy7WsPkPZAwrzu5tQK+RO6Qu5YCErw8OJE+C+I5PXURaj1llMK94aCKPk4cMb5JHy69+ziFvgkQWL4WLpy+q9jrvfyQe70nvA0+EmyHPLm02D1wp5y8jKzSPbJherx4wgG9",
          "os+MPdGVQj3m3RU+VoJmPkNS8D1EQQm+5GE1vEQBjj2zCsg93XpdPoJr+z3mGvQ9DwwKPr9wCj0Z7OA84E9AvZBerD3KqKU8x4hoPul+tDwrBwW9CYefPSOm1D24gZ69/MdKPiSYob39Q5W+E3qNvlh5O75RZI69S7ELPpmgbbzUPBk+MS0/PIuFd71dsw291ZysPNevjL1Raqs9d5MevlTukT4RLZq9q/ejPNrrm7w6nRY8rpvMvNguXj4aBJW+vYjourXgrTtiMyg8/ZZdvlo6fL5jKQK+fihIvZLQTj4Dppm+2l5UPvij+L2PqS08p5NGvmSGzDznHM09iJKZPVvka775f5s9meQJvpNtQz5/2nq+cOMrvWXbiD3wfZS91bGKvnESNj6mWH886zcrPjQ2YL1htcS9lWqePeAyTL1J+ja9IXI0vg444j3jk+G9mOEZvqTYej4AfQY+ClogPTzcy72CU4E9w4AxPb05K754b/U8OWQUvrbxFT4vCA696o6KPR0dDb14j1690t43vqsnsr35ge+99CsBvvLEhLyxgJw9mGlBvr/QRz55GQI+r6kcPQfxbj7TOHk+OLM1vkRHIby8mb29CL5WPh/uCL4pHbq9nxqDvho8a725ObO8px/qPdG2yjzKpRs+CvpHvkOX3r1Co1s+PbugveRPFTrurwa+6GY8Pg/RFL5s2PK9wL0WPlFdsr3Fe0o+rs0VvhhVi74fHZE+FW+fvdLm6zxzQb89x/iLveYP6bwc8ya9eqYPvj6jjD1OCVY+JXI8PoiwDb5G5x89to2xPcLL3j2nOgm+x3F1vrxFcj4B0zI+0z9qvpc+UT58Z5M9l17CvSbsrLyugKO90A+avZLCcb6VPVe9AKIePnM5qj0HDTK9UxPwvdjXAj5DNQ2+DQ+VvT0/ez3Dl1o+rUBFPRhKez6ivyg+YK8yPmAsJ77RETU6+j2TvTSl5b2SPkY++i6DPl9sWb23Z0g9Wp8/PL6A9D3iNTS9sIZ8PseJBz78udO9",
          "JWD1PTwaAT43UAC+ebqtPdhvhrxkvn6+8qnuPaF/gj5IchO+oRmjPemXQL27C+S7xIuevmEzET5A3Y2+x1ihvVoheT15iJy+5lL2vZ6D2j1/YH895il1PUCyuj1pExQ+lZ/LPYqxX760zyk+IWDXvSsfkj2y7c+9eALlPd9DUj4ALaA+wrGGPshHmj1NHy6+X/+rvVk4uD1ChW69r8kTvUoKkr7q3H69NZ9tPsuus77RZHG9nP/uPYIZBT4Z/xA+t229PQ9NWD4nlkA+tz1vPsmnDz51u2W+81yYvjYBMr67bx49vKe4vVB+Gz1COme975Cqu9QX7j0fF0o7sV91PrLPtz2r7LY9o4PXvS+tBz74aO49bNtvvWDHOT6oH44+aGkHPUyYwL2agf+652GHvaZcTz2PztI9PHKzvTG6Kb4T/Zw8qB64O71cwTsDvxs+KN5uPl4sDb6iwc+9mrDwPdrmWzxcPcy99EubvW9alb4xS7S9KG0GvjvtZT6Nwqs9TQlLPFoyfr3anxK+televNNkkr3354u8o4X/vXnuCLzkYWG+3osxvqU8Gj6Tmes70ohqPYX+Az7rJJ2+RWejvijIzL0xS6k809RwPQw5E77sTye+6kqkvqjuDz4T7Tu+tJcOPslNrj73a1s8MH+svZUHqj6N4zq9ce+hvl8veL0fgrI9OjkIvZiISD5nGD0+UQdYPpCe+DwARmG8VBeIvdtWBb5r+gU+cWjyPTeNJj6jakY+UKQSPY4ukz1J7rK9PnyDPXMgLz4/UeI8U602Pk3aYb0gzwe+v3KWPoVhnz0pjA4+zmOZvtLzhT6lmA09EvPNvX+2/b2QyVE+cTpTPjpFlbxIiFM9a8c8viLxxbxNXPY7cCBvPWBbmr4khSk+WtS2vXbgI73kgXi9CWTbvZin9Tvxdm2+6O8aPt3ZjTxzcfU9n9oaPpBRV72gqPm8mihwPafNUD785UO+TcyfPSGpEL0o7Wi+Glopvppdzzz19Si+ftIFPcVBcj43Zh6+",
          "HQoiPW65dTzSQbC9DH3Wvflvmr4oLHi6HfrevMryIb4euVS+01T8vQgAjr2usYw9atJ8vb11Kj3qaY8+0bhTPW01jTxwcMG9P8QpviL5AT5Z6dI9CApBvt+IyLyxj169n3L+PccyBL04JsA9V4EuPRYFjb59T28+hQ6vPb529zyNbha8yb7CPR7C1bxNPty987jQPdf8Eb1V6F2+TNckPd749b1N/qi+WzVYPgYDVT44b/w74bQDPTIHIz6D+L49iD1dvtNbDr2NE2U9D26wvfWmCT42ZL28FHQvvd/cEr6zp5g++JwLPil1/L0mLFc9CpuFPtmxkL7zxRk8k5uBvefRIj6zJNG9PjyBPqt1Jb7eEGy+zrJUPnx1EL35Io29SY9uPmn57b2dGe29eqEDPKdjMT5LHxa+pAKGvWuVLr00eHc+lqrvvBtiKb7YAZU+DRqkuyPz/LyZl4O9fzSOuskWEL5avfk8kuvRPJUnVb3Hpqc9BohYvvtGO751lig9R8EEviGqiz5TJh6+GPIyvu8CML5V05o95Uf4PU3Z+r25KsQ9bAQBvs06WD4BoVs+SdSzvXvIFT6FWVi+y2qcPfR6pz24a1E+xZtxvis2JD4pmsG9OqVtPcmmBz1VFao8SSNsPvWRMr7xhb+9RpmIvN88Dr3VLqy9t8gpvPA4Pj1YuDK+RxngvcuwFL75aRg8mq+kPeZYLz7Yg+I6AZKtPA++aL4+4kc9jklxvq+4K77wG2E+12V4PILVjD17Iz4+UKdBvp0zoD2W1X++zbvVvWa5ejx6N0K+Orvyu5qU0L2SjZw+i4gtPfY0XT1duZ0+noJnvepX3z2rno++2VHoPAPV/r0l3988ELdNPAuwoTsjgpm9gOU0Pbn5qr2bhzG9gg74vcMrDb41weO905oLvSkLeb42Pzq+nWRGvXVcMD189m8+zK47PqRgkL0n1aK+E0HgvIcl673yWfA95t82vlKdBD44iqw9IcphPZpIF767GwK9RZH6vWEErzy78x89",
          "muoxvh00/L2N/Si+SUT1Pfsnyjyr25K9SRTcvVTWGr5mPOo9igDvPWEjPr7PG/C97ZgOPUigWr68y7e8+oQVPcrsGD25f5a8rAFVvfutCb1PB/O8L/IgvRXmL75NS46+jI2PvBa/AL1GGE29TYcyPqyCPz0wVCg+TW+EPfR08r3rzLi9Jv6YvWSYHD0Hl4K8lUx9Pej1ej6HZxi9uGuPvq8rXD0uH389oKQsPgVsP76n1O+8gJnYvYejKb3uPlU+Y3miPTDSIb7SD5u9nsiNvofasr1STra9A50uvnmGQjwg9rm8sZ8yvT8VOr0n1Ni9WQ8DPlHbNb6yDlW+0K0QPg2QSL1Swhe+lgguPSS8RLwDsRE9PTMAvdseyr19mtm8vg1gPN8O8T0XoUe+yp08vsZXQzwb2Ug+MDoAvqk4djx0nJ67dVobviDPM75FWA8+zzDQPW1oGb6/4PW8lCeCvd39XT4YErE+izC2vT2LR7xMDHk95sKavT33ID7qop88Cj0pPp/Jx737oVe+h0wOPW9Ntr1PqJM9sl+zvHuRu73QWIG+tPVRPJ6Fg72cGM+9l5rQvYywIz1V2Qq9/OM0PhUdZj6Bip69xeiJPT2ujb6yrzU+1rVmvYNzLr4nAgO+BD0DPkzCkL7sKkc9WMuBPbE/Gb5YhR49ReeqPUj5NT6FOW4+gAhUPXJueD2CYBs9yYCXPXfNhLyQmue9fT4iPavpkj2CQwe+YryXvgqfNT3XYsU9XssaPuts+j1UwI89bWVVPiShVTwFVlu+qyKuO9RCjD0OAKU921JvvISO1L3NZiM+wPm8uyDZTb1x91I+4C+tPYDTjT1QNVm+n9jhOwOiXzs2Bny+uoKUvSSjjT4+o4U+8+lWvrl1gD1FgzU9CMCqPZilMj4cU3o9v75zvlfZGz1eHBO9BESzvR/nOz7UiRW9aNQLvqqEgr1DCj2+Di3wPDkJ5z0dhkU9PNIDveDZOT1nklo+GBFzvVG1gb7APW2+KAKAvlCxpz2PVUc+",
          "dw95PZTENT5eOzM+ETbQvaJcmr0foVo+H467vcqUGb5P7WO91mppPSu3tL3BFIK+SRiwPTHcPD6B/HY9zXs9PkT3XT6psLY9go6APtGIDr6LTOS8DRmMPULgR77DHAW961mDPdV+1706DL+8iZEHPtmTdT78Ajw9TenjvUw2WD5K1cq9UKYOvjr9e76oqE49rqn3vQH3hD14/1y+s2MNvYAnT77OLyQ9xcSfvc60mj1OqDq+Oq8hvqzr7r1dmV4+dSEjvhVJujwR/Tm+ozDYvJ7CYroZ7w4+zLEOPpkrRj4PSZ88ktRhPmh3Oj5UD4q9LX4XvrH00rytlTq9KZ3nuxcdIr61AO09GeOlPmAEo72WhC49OgpZPIFoS70CQsK9jk+KvCDEgD2cao6+hCmhPpplIL1tMxS8wlDQPT1QED6Kwka+rcpovbwswTy0aB89DZAtPu76IT5pHV0+8hBGPVM6mrz2Fzs98NJ9viMci77m8Pg9hheGvvd6M72eNY4+h4yjPdvHJL1YzPi9W0tQPtxVOD7YNv48DMTrPQePUT4Fso29f7txPqlY9T3Alla92i6LPTfr4L2iejk+Vj8WPqdcPzzbn9s8RlS6vVLRiz5+fDM+grZIvYKm0T2WUjm+UvxWvcGrz71tdOw9KBESPT6UbTwn9Ta9cIh7OpvamD1tywY+m1iyPUT7Gj7SXgw+biJ8Ptkclz6Ddwk+b+dJvYgpVT1xIGK+PNphvmJa/L2/Gl++rHB9vdNUBT6Iv6W7qpcRPn/Knb0Wkhs+BdWKPmVt7Tywllg+leiBviK4ET5E02C+EoFXPmgQzL1LbVI+THaCPm2AGj5Jso4+1UbIvXv9pDzik3E+ID0avkm8LD4KDKO9vmwIPNvcXT0YbAI+wGeLPt4Scj1Nagi+2miyPCbTYj4fi2G7E+dyPo2lWT6+Ag6+52GaPeAEmbyOGp681VioPXpymb3Q4q09+S/rPHyp4r2Hr8g9lp5tvgbdcD4dNAI+4CGZvdcMhj7vrIG+",
          "6ox4PnBD0T2WffY9rGtxPWFHcj2FRpO+kHRGvusJsD3+Q3i9RBKHvfzavz2HZz4+M2crPvW2xD3DJNi8WFPavKQVTL6y/109/7uIvoK0d70AnGo+zPJGPUNcOb52FPU9aTA7vpuPtT37L30+tZq6PVpjQr62D2W9ek/TPYwjWT2WBB29UVGdPTYkWj7bfds890WavhRHhL0RdGA+XhIgvaPVyz1JCWI+/cr9PIXwjz6hPXS90IrjvaooAT4j3eA9V/1Wvrx8D7w7cjK9IQDAvFnUAj5b5uS9z4UFvrfmcL1b0Qk+6CW8PSRPqr10sK093kWAvqaYF778Ul2+ACHPvEHRkL4GKCk9XJCVvjY6TD4cnRy+VwvCPLZZ5b0n8oc+fLcUPbE7070mg5E+71SkvYo5ir6W7UG+vU7bPXU7nr2TZug8v/n2Pa2s9DwAbYU+ZcDZvUwaOz226Iu9wvehva/gpD2XQx49JgGiPvHjcD28BLC9T2BXPvYct71h5Uy+DMJTvQab/r0KS8E8d2T3vFFSvLySwX++9E+8vN6eTj7YNe+9dYtvvreSZT5yC1W7cjKmPThYKb1F4/09RIP0PTjfozvTqpm7wBmQvldM8j2iwzI+Bf9GPW0hSL7mHt69surPvOz+mr0+hAi+1GaJvJbpijxygDU+S8T5PUQufD1Fhj6+DojYPVX7lDuAB4E+GE89vt+xY76oQp4+C87HPfEwIz0K/SM+3yAGvhQi4b3GO5G+GenZPTqZtz0yqLs9OrOzPSWlTj5bGTq9KabivBCAZz6yJXU+gZS+vbxAiL4Hhcw8mWsgvTjBfz2OqOI9FxaXvVKsIb7Y23u+CrSKvU6Nmr4KBPU9XwpJPkYCHD6DUcU9Dttivmkp4zzr/c491NmhPX1vkr743Ou9jD46Piixsj081Yg9Tzu4vFQEOT6gvqI8wskrPtpQkT3rVzE8Vk2+vWIdGz4pLsw9q5UEPjVTxLxsMXG+3kwBvu0fmj3m6Hi+IBt3vtr6vr3GQ7C9",
          "y8ITPbopXjwqzZi9cyTDvRvo6Lxq5A49pF2sve8Qjb1rJR8+FWkaPjF9tjrB3IK+LGOovblNQT03Bf49KikVPrm42702vGo+UPsWvkROZ75tCES+C751vkTcCbwxi2s8z9FWvUnttT0FPCq9B2lLPl2uFz39qT07NgwCvdTiCj5Lx9M8Y18VPsC8wT0Q74q8sSIvvuWmCL6xtHC9g1a6PAPmVj6PLtu9sqFSvgeuRj2il1i9S3zwPcV8gL5DtAE8kgaIPS0pl76dUGm+FCh5POahPj4L3xQ+W8gOvmt+WDt2uqY9mAAaPmC2vb3r+bY9CogIvgkztz0nOYu+3XahPSNfjj6ouB49oz8/Pdq2GT5guty9TYoBPlQJnD1i2889yvxMvRNe9rymklE7x9O/PUKjp71Bbs47tvorPWgLYLzVR1c+g7rLO2E/Yj3/ND8+Pb4iPidnej09/SC8rBh7PJNXq71cXck96RlTPnm4vry10oS9GxU4PuomP77OWYM7K/cHvihVnL54RbC9Q/4KvOuvbz2YZVK+LrcZvknTZ70gD2S+yK5evlARer4bJwa9j8hvPiksrb0hbMy9UjFEvhX5or32yok9XUvqPW10V70pQ/c9RTdDPjQ/wbylPQk+/ZQ5Pa6jOL4JyH09f0oqvCZ3Yz4uE1y+JYkXvUxrTL6pqbE9hNcSPaFIFb41QxW+Jzu7u1DPZz5IFy8+tCv3vc3LWr67Hk0+Y6xbvsjCQr3QMF89JhhkPsurMr412IK+TpHnPFtijLrAk4U93Sg7vhWTsD2APKu819HlPQrLCj5t+IY+ApMBvmYYiz51lQY+bft7PYCoo722Vc29AMcpPmghID7OyYG8WsnQPXkOX74sWCq9p5prPU7cJz7Vv809d98FPhLob75j39g86bCWPeZulTy5WXI9T5VQvnLV772yOYG+sASmvWxEMj6vMGk9zJmGvf7ejrxVZgM+sFqJPcoznD59pCy+OxOavjORbT6SCsK9aaQEPd/xdr3Quym9",
          "oGiWO4gScL0dUtg9U2sNvoNr0z2CCPu9D0tFvfnh9r3dtCK+Tj3QPXGWOL70KWy+dtnPvK3ufD4MuTW6uq6XPgGjED5satA9+TyAPVZZnL37qJW9BlvrvJi3jr0pcn6+XFGPvrPFJD4MW4O9ypejPGfMT765dc49+NqHO0xpeD6Kj4W+djVnPnV7mL7Bhuu8P+M0vnlaHD2iahW8eOctPtlvd71nfA++OKSLvSgTIj6ybFS8HZtovnVv+jwz7bk9clw9PpA5Rb63Vie+d0qWvthW0L0v9fI9X7RRPrONTD6MhOm9joRgvhL/fr7l5Ie+tGBSvr3wVb3iXHE+PwphPqbKWb2LSfG6SzeJvuJalr0Cg6e96mtqOx9hQD2szhi64LYSPobAB7zqYwG+Unu4Pe7WSD6k06G+hlbBPTYijb5Bq2++PSQpvdTNPj2xLLU9NMVivsgCnj3G/3K9Iqo1vpLIhT4qSGQ+H9unvo2Ypz0i4rS8v9D6PX+PJD5+8Zw96+WUPD2rVD7LDRu+Mc8APbBoCz3rt1o+l/Q0PhgRCD5x8cG8PjUAvim5SD2pkIe8QkcOPXq7Uz7Y/Zc8OmdjvnkQTL5OxGA+DYs8vsWWNL7FsX092r/RvUC8ZjxCXQa+48uKvheZkj2dc1w9Ur/hPVinkbzDOoO+jrYUvfIXuD0="
        ]
      },
      "dense_11": {
        "bias": [
          "ZWqwvD/Oc7zRpbE85mULPexrFD1Urvk8XbxbPc4/aLs11LY8MvHIPOQqwzsBZJI8pp4xO6pvGT1DLQq84MJevA7gcD0A6249DXu1PJz8XLxdtIM8p6x6Pe8O8zq9XJq8+dJmvIiSFzymASU9hFQDPV+kobxY1zE8YhM3ulUVHD3z9vq8vA+kvBI6vLj/kr87H4u9u8kNGjy8V1o8UIppPJVxgjsSdYE955ubPOljPj3c7Uk8Myt1PKYnIz0ZUeW7MFhcPHxghTxQpUk8G+0vu9KHYTs7R4o8Z1/4O2BXaTyjEzs9JZzHvHmoNjw6F+Y8+pulu3kzjzye/189r7HpPMy1gDxThhc8UEXaPORJ7DzlmVg8XZsBPceXFDuZ3ow9L0v6uJeB6jrgDxE9QxEyPDaaiDwcSjw83mRMPUTZ4Dy2Czo8kG91u3koGT0/fBg8jeU7vLkMNjxE90I99nx1PB6CBTzy8RY78yVLPPIjEDwW05M8u1uTPXW/OjxioCo9aekcvEo+OD00T0M8+LrvPCTX7bs202g8gFlHPdzx+jufQhY9fTyJu60EODxGSUw9LvejPGXvPTyWHyC8GGxvPCkwDj0Q24a7MR2IOxn59rxMbTI8VPaoPNgX+jwZuS89wqbNPNdllDzd6mu81J5KPChkET2IMtQ85MzoPIkmKzw="
        ],
        "weights": [
          "BPvsuy6iIr11fvc9Sh8wvll8XT41iUg9v0kRPgzNq71CLOE9k5i1vaUO1z3JkxW+oPKgvZyxvD0KnLS9qSpmu+WoBL4bE9I9tucJve8Car2txJq93RyqPdTw4zzXUHa8e88FvjKpGz4Bwk0+Ar++vQ4Dsj2Vt908Cz1MuuomSj3MlE08RTQJvSl9gr1cGai9oKfCvaitcT4cAJM9onp1vO0Tr7vvvys+P2eJvetug70h0h2+WPSIPRtpRj0gfVM+8xvtPdXVAb1KuDS9miEIvh6CHD1dIEo+ZC25PUEltztDnhK9Bg7fOd8KcD3KhAU9C3W6PS6LcD2nyi0+HqMXvoefCD1jPUs9JgqNPPlMgj4oYwQ9OUI3PvUtBj72YfU9U9nZPMf7sj0bkv+9RO0/PaE1ej2ckh89d5ilPbtu1L2BZeM9PP++vBDx6D2Mzf08FMjBPezETD2EtAY+892dPaD1Dz2oPfy8fmI0vTR8zD27+BU9M/HbvR6uxL0RYp49P6DQvOls1L09i1+9FQquuzzFvz3FmyM9ekrFPYoi8z2IIvw9cBuRPfElsr3o/OU9AtN5vNbzF708hc29xt9IvkFU0jwDNI+8yRUvvv1YOj6HlCg+R6/WvRjLiD37Sd49bOoQPj3emTx3Aos9NzIJPUJ/ETzdlpw9DKHnvbhAob2NydA9y+BKPpSJ2D0m1L89xNJXvehECb76WG88lm2BvYdJLj2GKrc9azG4u8dmxz1U+UQ+DbxmPcNvLT3/VfS9A7IqvcU4vj3UngC+i4eZvd61Ub1VCE+9EWCZvf/9oD2cPEG+vxw4vs+IbT6K9We88n+ePJVOLj2ZfBm+Uoi6Paxn8jqnbGy99DF8vZj4eD1a1ik+/AkaPci4J74WNxw9kJreParVAL6Cwkk9HBHGPfMtAz72iTa+UpM3vgHnUr1dY089wpioPJR6b71dQGg+93QNPoPq5L2UBTC9zv9lviabir3LZ9y9nfbLPaSozz3soQW9rDSiveQkFT6bEpg8",
          "gi8jPZPyHr7ksya+oyPovSMz5z1k0mi8x2ZzPgOOID1nipI9C88QvlPCODxdaSg+T8q/vbRdnL1pl7k9LPE3vuMbLL2S+PE8iCV3PQ9cGD2i3UO++0KRPcv1GD0dD3E90Rz1va0s4T3cqdY9MTngvBR/wrxsqSu+wQCAvcS8zL3mpum8pAIOvXLqiz3cSqA8mOo7PnOjw73cuXi9OhOGvZqEab6pj9Y9GUChvXcfLTxYywS+12mIvSjInDw0+SA9/Gt2PA7tHzw0SZA9qFluvD73EL4bGjc9yfggPqK99L1vlL89csJbvt7TAz5ZcDu8wV6WPeBSxb0/uoe9EFYGPtTwjLz3npC9vOLKvQJZn70AJ929gggAPptEIz5agr89I97KvaSkXL2f/1C+r06RvegLh73FDX87OcYKPMFgMb7IN9K9U5W4un+FTb7TAdk9vVWKvUGDLr76CFq9OdoMPsV2+r3vlDY+OrrGvC4/IT77O8g9k2efPVd/EDwp1k+9MAAovr9psD3e/Vi99qRovnu0FT60huQ8EUihvZ37BD5BMB6+iLY5PQo6lz2kvyC9BljovfyX8j16DLy6HVV/PYNLo7rMyOk9iySkPYpel7wnaQk9RUIHvU8BDz4XK8Q9UJF3Pc7ZTr2jOvs8QD/lvdTdzT1h2TA+IJhtvfcx4D3zodg8bVo5vcYEAD4bU/k9inwbvhsbuDznoA09t4cfPtTO8jxw/xi+6HVUPrnP1byJscy8fx24vdGq4z0mmvs9y8LRvY3PdzzEnsw9Z8OhPLgU3b1EuqE9waoTPgOLhD19jVc+9SyZvOT+/r0rAKm9UGnRPJah9rzOdE09iq+uPQuhtr1k6Co9tboTPpp+Iz4bY/W9gT+kvTi6Iz01IgG+8B9vvoUHrbz8s6k7rQ7SPerzor3YJ2o9EJKSPVjgrruhaQO+fpdcPA5TjT3rCy88d/p1vfM5Vz2l/YY7ISydPbtG6LxeZr29WiY+vN1Zhru8nrW9Qh/AvWc1srwaiwg+",
          "SLfYvSN4iT3AyVE93pezvDGkW75OUPM8XE3YPS8NPb3IOVq9nKQkPmAMjT331qO9GB+yvVdg0z3Ah2O+WjJyPbY1Ab6cfMa8W1oyvqJuNr0OM0E+y8k1vYbKKz64tQI+Nt0HPPy3sD3oebE9LdscPaUhMb4s/5O9NDZjPXzhrLyxMzI9vT3Lvfrp+z3oxSG+Wq1ePVOiojxvXg8+c6favXesAr7g1AY9mGQvvq53Qj4DcR69OO8OPsPy6rsw+dY8UnWpPdd2bj2lJSq+SooEvCGtb71YUbY9ox0MPs+mWb7wyPk9qEOBu7g9QL2x73i9rXT+vXBhljwIlxs9BffNu9VQxTtJKf09rNM/vlONPT6zmD+95kg4PrLGDb7cyok9CvPyvYpq270X45Y9aHA0Pmbb0D1wa+e9C/zGPbS8HT01SuE9AKkDvWNJEr0czAU9U0FUviia5b3xw3G+9R+ovR69nTxyhmY+BIVIPtZbrjsrnj++iBCAvKOywzxEgBm85kWuvdyA+L2zwCo9Vd8OvgJkCj2+ESu9OWdlvf0ux7w+Py68SvpTvWYBHz3kMAu9po9APa1CBj4+uBw+fAKSvdIe3L0QQOM9/zr/vCsyRr7JVRq91EeuPWs/0r3tENu9vvI7vbjqA7ssH7W9HUbsvSiWvL3Tc5I9ib5JPcJoBr0AgCy8SUtaPAlWkD3Vta09VGYkPt07yr3oALa9/nEgvaFBsj3C8Fs9Shg8ve8LDb7JmAY+cIkLPMpXQr79pLi8pwo8Pcv1GbyeklE+kkUhPmXu+DwS1G69v9CovTMeaT526Ri+ccxFvXRcsT1wTRK9V0SHPKZgmDsiTia+jEPePZMoGT0Kmsi7V1mdPHoz9r3s2le9Yso/vlAQeL1IgwI+03dKvdlpBT4KM3A9JYQOO+RZ2j2Zch++TjIgPrKfCTzymSa8FC3vPQcjQr3gfus9CIv7PNa3AL4K+gC+gOgmvKBdTj21+Qi++/QZPhc7Rz7zmBm+3DhePfGclT06KxA+",
          "H8WUvNlzw72BnxK9wPKWOwx32D1y00y8XARtvOYC+jxyAwQ+nq2fPN4Yg70I02E94fuoPWM8rD236Vu8QsDRvA0yjb0iXSU+FCG9upp0EDvvK2W9TnMIPdb0vLzOjAY+Mikuvnm+Bz1sejs+Yd7BvZlMRL4fGXw8KW/WPGEkQ72snwW+sZbAvIhZBL3BT2I8jSz+PeU4TT6vrgc+1E6rPSF+9ryK9JY9pEnSvIDcgT2Y+Zc8NG6rPbUfAT4SgbY9IlxUPcrigrwu8J69w8Z5PNHWIr6hpzA+dPIwvuFfqz1S2xo+Qc+MvdFLv70ejk0+YcERvMnJXr5FKsw9dPHOvdgIcL24yMa92gumPRw5nD00HvS9lYBavRMBnz22VSQ9Kl+SPf2bOL61DTA919irPUhSlD2QE3m9YYAwPcq9bjw2Mvu9TCVnvR6AgL2fXF6+iOfdPe03Nr6yuIq9ERcivgMtNr1Koga9rztYve8Tmz1PRoa7PfVnvSLYWj3/b/G9C7MKPAAFaL0vVHq9JVcLvSOIXLx9H8q86EP0PDLUGz4cybs9KNTQPbDjrbxeY2C9Z4ojviyCFD1pBrC9g8YOvknJSj6CUdy8wjKYugsKDb5XqC6+bBqZPV7umD0DZ2c+pHeGPd3vgDyzylk9E3UBPUrDBj47Bbu9RXH6PMvzCr31LAe9ajDPvT33iT0fXaM8semkvVuvtL2RKTa+cRDDvVPi8D2rbDQ+V+I8vc05o72flCu9KCeZvIvOrDzOnwk+85ffOzkXUT01NsG8DIQ2viMDUrxvkhC9NB2+PVIUd70Ijjm+AOfJPQp+DL4qefk8AxplPpDYUL4GUbs80J7zvdusEj60up08SdntPdFOBr2xfHe9WWCuPcr5ej05WqM9aBj5vS4+pT2CbcU783GtvS8yST1vH2Y8mPHAvaDehbwTV/+93PuvPZqYvr2wX7u97FU4O/6M/739E/k9g7wAvgVAZT2Jazo7U0YCPhW93zwA+cI9IG3tvZl88z3BX8m8",
          "oE5EvPrtUD2knZc9jD6JPLa1Bj46DIs9yUh+PblfGz0M7Cs+jWfvve4V7j1n9BQ+dYxAPuc6Jr4QBfS8epaBvehPuT3FVQ08Ef6ePZKtQr7CXQG+EmpAvP1wFTyCUBw9VIovvSTiaj7aRek95uBlvik0OT4IJ4E+UeJHPs+i8710etK9pkoSvr/rmL36pGs8e3u6PJh/WTkwyhS+O1NhPSbIz709Ns68612GvIDxT7zOM0u+Di8hvlk2VzxwP1o82BcjPTfIDL4MlCA97M1gvU4NiD2THfU9BlVEO4yCE76znW67IomSvEJcqD1FZ4u9rACEPcz3br0DTZk9CKURPi19qz27ur499C4pvQ2BhD2BQug7icKDvcBDPjsBKfs9+wMHPuL55L1cXtM9acTXPcXLSz2jsRI9an1hvexTBL0igtK93uc+vshWYT1GKtS8gTdSvucXHD6q5CU9XGUDPlT3wr23yL48X6YtvZCT7j35q469sW4GvOxy1L3EVBe92K8dPK9Y+71SgwA9YeABPdbKtb2abPS9yPbgvRK2HL0A1CW9vA3CPTvO1j0fEaY9Kj+RvcwLkT2G6Gc9767LPZTvET4qD6Q8sGEavQEcjj0hvME99Si0PLoc0TzObFM9G/XrPdxRAL2d+Gk9jEsGPFpt/zwipQk+SPbZvLwDUr7mpOI6DJIOPX0QDj6mCuu9gXt2u6RT+73NJkY8KmNvvaQGhDtSHAK+KgzlPWhoiD2JJFw8CvHkvaIvYL3lWew9mujAvTDnmrwKAue9H2LkPU2nDzy2UgA9qxO8vTD6Db4jDwu8tZTcPRXfJrsLY0+9LKJBPYhE8j01k7A92AGBPdAWzr2CEaE8hh5WPAFvojzwvMG9w/qUvUcJsb0Ds1u9J378PUeKYr5uR5M8xF5wvhV0671OhDw+THR/vW+GBL7W6aq8dQlWvhZcDz6Jkre8fpLmvcPB+r2EWtM9DByYPXLJwD334rM9uG0MvcXPJj75y5y9demDvZzOjD2YVLu9",
          "zhmsvbaU1j3K5W4+URyyPaHfHr7es/Y9xMiKvfTy7r2OyD4+4BQXO5mi17xHHDm9qo7Ou9w+pb2fuPK8kZ22PVxOqDtnEde7PNZFPh+Cqz1g3Cm+yJAGPWJgWz5pzFA+8UAYPuVogT3MBFw9xIDtvdFewb2PERm9yArNPU/CMjusdQ4+MSxWveueIb0fGbu95gmYPWHtND5qlRy+zeUWvik5Ir1HcGe9qWUoPlrnJr6Slz++EuQ2vb1+Az0IB7I85t5fPblxEr3t07896PcQPjODUz3IY/k8qHevvXyH4LqUb189yThaPQKYmLzE+fa8Rwkhu9pMgr2KE9s9k5A0PUpw8L2S7Zo858bJvGeTiryQk8C9TLqPvZ+eCT3lSio+GioBPvN//D0whPI8yJYuvU4AxbrobP88kJUWvlmcXb1A7jU7iyPJPMZhRb2GsAm+NBW8vJFcmr0b3pw9YzVaPkoDsr2HVbw9XMZjvjReDb64zje+01w0PWoQQ73Klz09lt2UPaXDozy0vCm9UtwAPmhRtj3r5Rw+dAKBvbiBwL0/u1o+bTlkvvjczz2baZW9TSehunMURDuXQs871C3XPFVEIr4MAJU9rhiWvYb4kjsFPwG9xQA6PtxFWj7+X9k9fOLKva5UEj5Z8p68ECUqPbatir0Q/xU+FZjOvT36nTwual682IOZvbTV8zwOBWk9u6DMPfgoGr7XBGI+7y/APeAi7T3GUZA9MB7ZvBaXu72gxxo+JJ3iPayJ770ajO07W7rhPBncNT5dLHW9VXALvutwq73So928JIy4u/FXHz2rfLW9oV7/vemKuL3ZkoQ9ozfpPU4+Ob6LJAG9DU+ivSxgxj04P5E8HRZ0vAtVS74GrKc9cmxqvfiSJz5Nvr28hljDvURvr70KRUc9xqULvmdSSj2LXbW7ogY8vVzcCL29um29FeBsPjhb4ry3/6w98dTePKJFHT4ZPtg93fWWPTJwhj26Z8c7a7LQPKEd9Dwr/Gm9YtVzvexKiL1vgwa+",
          "vTLnPDfk9rxvay88gbtrvmPdxzypNF280JAaPnBWZb5Xyp292rhYvf6heL62DgM+AaoTvuGQC77sEEo+XceivcHCBj3nXhK+ZLsFPRGzfr2Oze49K5ipvEh9xD1Ey309dnwDPqgPBr4VQ+i8cYuevYnFVDwyKJ499dWzPZmcgL3k12q9nVa0PIB2i7xl12U+DZx0Pcf+VT5WeQY8tT4kPY2ksjubmN89Min6u09uE72yhAu+84FFvVP1Ebo+0R69j78wPQvKAT4fV5A8ySxJPrCKyT39NeM9CJX3PfAeLz1aVVS+j1I3vS1Qsj1VkSA9BucePtEeub1ERLa8PFw3vSYE3jzKloQ9kdO8PP8ANj4zoWk+OcSAvcgN67z3U1Y+mHryvVMGhb1T2X88pBNOvY6sgL1aX4w94KDSPam5ET6AmwU9ClLzvWSyiz1ZVr09VJo+vvCpCT6BLRW+IszTvTj/Kb079sA9U53nveSN9D1VjDQ+lMIKvi88iLxMQLo9/MnPvVFLpj2X+949yheJvUpO9z181lo9PUwfPhMIHzzw7oq91kjZvf6+SD5vyUY7fb5ivChp8b120fw9SqMsvVLN2buUh/88CNbKPNkMijv8R3S9UcwIvsZQwr16aeE6vyYDPirVzLteuTE9JOcFvZkosb13c7M9zXo4POzcub0Qgbq9GNWevbUcND0p9YW9KBHFvKG4sT2qIvQ9JNuMu6bR273wei8+E9bOvC10Fr4UYoC98w9DPJwQ4r2kb4s8sWz8PW08mD2q7bA8xQgTvnupwj0dubC79t0wvoa3Lr3LRFM+8kdMvLMSBT3GV0M+a0qCvbqC0LyXtO09CRqdPSQ9wTzqnxM9f05Fvbm9ujx/rTs9uv1lvCPyo73rKgG++VN+vXp9ir11tMu9JFgSPUu4K76zD7i9CdiUvAcdNr35JZg9nENKPqQkDj5LBks9q93hPdlwTT42ZyI+yBWmPRRfgT2+rAW+/knlvRJ4Bz1r15M8Zsj/vdK7aL6Ufm0+",
