{
  "duration": 120,
  "hop_length": 512,
  "hop_length_ms": 10,
  "latent_dim": 8,
  "model": {
    "architecture": {
      "backend": "tensorflow",
      "class_name": "Model",
      "config": {
        "input_layers": [
          [
            "z",
            0,
            0
          ]
        ],
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                8
              ],
              "dtype": "float32",
              "name": "z",
              "ragged": false,
              "sparse": false
            },
            "inbound_nodes": [],
            "name": "z"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_8",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "z",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_8"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_8",
              "trainable": true,
              "units": 16,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_8",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_8"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_9",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_8",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_9"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_9",
              "trainable": true,
              "units": 32,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_9",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_9"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_10",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_9",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_10"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_10",
              "trainable": true,
              "units": 64,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_10",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_10"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_11",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_10",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_11"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_11",
              "trainable": true,
              "units": 128,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_11",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_11"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_12",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_11",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_12"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_12",
              "trainable": true,
              "units": 256,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_12",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_12"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_13",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_12",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_13"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_13",
              "trainable": true,
              "units": 512,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_13",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_13"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_14",
              "trainable": true,
              "units": 1025,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_13",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_14"
          }
        ],
        "name": "decoder",
        "output_layers": [
          [
            "dense_14",
            0,
            0
          ]
        ]
      },
      "keras_version": "2.3.0-tf"
    },
    "hash": "5156effa5f8cf1915994f57de941ac1328fabc5b92222699e495a859e61e1e38",
    "image_data_format": "channels_last",
    "input_shapes": [
      [
        8
      ]
    ],
    "output_shapes": [
      [
        1025
      ]
    ],
    "trainable_params": {
      "batch_normalization_10": {
        "beta": [
          "60OjvSn+WT2KYta9CBX4vFMAUbwv4tY6w/kEPZT2mb1lACS9p3ghPe3Exb0nexm9TlsrvQHShzs3yhI9pElNvZ7DHL2pX7+8JIQqvZdFy7xFGSk8bvCnvXApi70lnVe9iUkXu24NSr3YMeQ66vimPOFZ77slbuK8ACqFPc96Yr0="
        ],
        "gamma": [
          "+Up6PyighT+4tHY/A+qEPwyZgD+Y338/M6V/P98oeD/nfoQ/aOGCPwfJez95V3U/Jmp5P6s1gT8s6n0/tS2CPyMPhT/Evng/GZR/P/KPgj94EoI/aruCPyMfgj+C2Ho/M5R7P0KRej+HvXQ/TGtnP8+3gD/snYA/WHOFPwhKgz8="
        ],
        "moving_mean": [
          "VQPEPpfhqz4y/cg+sfcUPxzBpT7wJdk+SY0QP43vuD67hb0+1NHMPpGiFT8sKII+xRA9Pp7qij7t5f8+j5bDPumd7D5EKLE+OK3xPubmZj7oRKA+VZq5Pg5/lz66wMk+r1T1PvnBFj+en+8+Y9IQPl9FWz40fcU+JmExP9bcsz4="
        ],
        "moving_variance": [
          "HoK+PhweDT4sE4M+ZMghPxF2/D1MBZI+dl/gPkrdpj5pBKw+9lcUPrhsLD/SO/Q9mG4zPpVQCz4Tjc8+8/qGPlugdz4YzmM+w8aWPgYPAz4c3TI+FDzRPp/utT6YxgI/7Ir0Pl6MIj/sBOg+cQ+aPVai9T0S3Zw+52QYP9aOsj4="
        ]
      },
      "batch_normalization_11": {
        "beta": [
          "q49Vu/RVTr2g1Ug9QhZkvathyL1IZdO88OYgvSBcZDz3CUY7+z5Ovd25Eb0TepK8r3MSPZiexr2aBy+9vqs5vSnVT7x5lc68+FMUPX6FUT0mggc+DhNsPY1+SL3/xgm+nzFVvbA8H73KCaq8zWJpPcTxEbwisxQ9REJcPJbJQr2BdLy7HoGIvVUJk72oa848Ob1pvYUj27yAmQ29IYOXPay2RT3n1YA9pHeqvTIfVD06d4o7nXOFvbJeFz1rbym+rBx8PSmiJDx3VpA9RtmsPPum6DxpAQy+07kavUcxxjw7RVG7nCLwParxfb11B+884pwaPfXXn7vtmaq7a0uKvA=="
        ],
        "gamma": [
          "bJqHP8lTgD8bpng/lpF2P4hmej/quIQ/t2h9P9BeiD+6Bns/4cqEPyIIhT/H+IA/8n+BP4vmgT9w14Q/nt+APx2Zgz8Z830/dqh2P9waaz96SW8/wFR2Pw14iz9xWIM/97uCP8/2gD/U6mk/YSp9P9N5gD9ye3I/hySEP5xcgz/MFn4/Fgd4P12hgT/MsYI/rmd+P2csgz9nboY/OXyAPzH6ej+PY2Y/DP6FPwaZdD/MeHw/8jp5P95+hT/CaIQ/Oc54P7/NXj87On4/DfqHP2rnbj+leHE/iGmFP75ugT9zwXc/aXB1PyfBgD8PVoY/9XqBP2Kghz8kH4U/QGCBPw=="
        ],
        "moving_mean": [
          "DyhkPgq4uT5BRZA+G4pIPqK0zj7TC8A+ua2OPrX80D5zvK0+MGl1Plruuz6ER70+ZQfaPvPIzz5WX8A+Xr4BP1gV3D41Kqw+XFgrPy4tFz88UeE+F+G6PikUaz6c56k+YvrhPo39BT+Wnrg+Zu8QP10hBD9YixU/g4KMPuc6Sj7qwOo+CUjFPr+80z6K0AQ/LnE7Ppidpj7PMrM+7npjP5MdEz9ECVc+gYWAPjextD4ZN9c+hNXAPhtVSz4ljdk+XuqSProIkj5wj6w+KaPHPhpqaz4eCbw+bVH+Po1s6D5jGK8+b87QPrgtXT4zOr8+/23UPvkw/j6MieI+innBPg=="
        ],
        "moving_variance": [
          "/qrFPp2c1j70TFE+RsClPXihqz7XotA+DKIsPnTUXD6lyKk+lMgiPkmu6j6Rlo8+S8Q9P4yMlj4ibWI+PXtoPlvlmz4csFM+eSocPwxgjz7YUo4+8nLBPs3boj5mZcs+I5FMP/5pHD+gwzU+omkVP1jpdj90UO8+dua4Ph8c7T3dqts+Y30aP/oCfz+G0tA+W39OPnS2Cj8NW9k+AzEoP0b1Ez8fjC4+LZZsPkPMTj4rNQo/LWElP10jbj6L5UA/l1prPpP0MD5GOO0+sVO1Pp4Z+z0pSok+KxWTPgqERD7F6zA+2+oKPs4Epj5oZ6Q+BfUHP43Ekj5bpz4/hsyrPg=="
        ]
      },
      "batch_normalization_12": {
        "beta": [
          "tDA5vQVIEz2o85+8+FH0vLiKbb120gg99OIjPSfPEbuB4Gu9bivyPMHqYLylY4G8lH6kvJcgnbsFOds99pqRPLB/57xh6mG6FnbCPNK7MT2k7Bw9pdXrPGsOhj2xmA+9YOytPVTeX72HRYE9DSTkvLiTnL08AE68eMCFvSE7IL3gL2A9dwS5O9H6gL0+VfE8B6pJPIkxpLyHDaM8OvD+vCMyJT3pbUM9Rd3kPMmmlT0wzda7zxhIvK+e5zsy53K9qoJVuwJKgjsjfSG9sUzDvZPqBb0luJK8TjEPPd52Kj0kSrU9aWsJvVg3y7xXjxG96rVHvHmg1zwTPay8EyuJvU9+mrzn1q+9kEnEvMKAOT0Zv4C9rp4+u7N89Lob8r68uztLPV74sD3wVcW8WElTPTcPP71A+Rg8V5X2PM78Ub0Ajoe9nT+YPA1Mt7twLwU9A6ATvd/KuDwfnxW9+8MjPVzDVbzZSkS9/0FuvM37jr1zmRy9mvRiPZOAgb1JK+o83DtdvbDSPL1VIQy9FlRTvSDioLuSO5y8oX5vvcYXKb32jc47wwiTPKtcCT4feaq7cy9lPZy/dj3HzMs8PH+qPfXFL72WbEq9+vMmvK9pi7uoS7w9Ezq5vafEmjxRL7y9JjiLPLRzhD2fRcA8f7A6vawncbv8GhS9uiaAvPloLj0="
        ],
        "gamma": [
          "C4aEP3xdbz8cWII/Lxt1PxSTez9loYA/diGEPxj4ej+i8YU/dZBzP64JhD9iOoQ/qY55P4kyhz+TbX8/blhyP0OPfz+pcH8/vpaBP1PNbD/ZBoI//UJePwFIZT/LJ4k//XdwP65hij+sPXo/mip5PxzmhT/AboQ/93l3P5Lifj+KS30/JLhxPwm9gD8/3HY/bJd2P32diT/yTXE/ZQl9P7Migz8Hv3k/oE50PxJEgj8nuHk/I8eIP/DYaj/K4IQ/U8iGP9D+gz+IK3U/zqd9P6rogz8ep3w/C8Z6P4d0hj9RZm8/rmeCPzFFhj8jO4Y/SBN8P9xJhT9LyXk/CjiGP4DtfD8a440/TrCHPxCNeD8+fXg/87V8P1sjfT+g2oU//SKEP04eeD+sBIg/C512P+wLhD8b1HQ/U3FuP0N/gj8ShH4/oQ1/P8yrbz+07oA/pf+FP1/oaj+VM4U/LbaAP+ZVgT+OyYU/j0CIP1Sggj+yKXU/tFx7P7T5gz+AYnY/iveMP/acgz/88YQ/rmZtPzvreD8RoYU/Zu19PxJ/gz+uz3g/HIeGP/LBeT/iv3o/Tv+CP9UkaT8VuIU/Ll54P6C5hD+Q9ow/9+p4Pzxigj9WdmY/vVh9P7aggD+dKXM/gH5sP7Opcz9HA2g/SFOIP7Lkhj9EC4Y/P0dkP9Hbez8="
        ],
        "moving_mean": [
          "hXrFPruVAz8fu7I+SZcnPw3Ssj6NnM4+QJkCPzwNzD5JguU+zlISPwz1vj7DH5M+tPDxPogG2D4uYgE/AZxBP2SG3z7Yd64+ndzJPpqFAj+WhJ0+YgH6Plj6Cj9IAvk+pt7OPhM2pD7rqRw/Z4J2PmdVnz5LMac+5EfNPlqFGj+rOTU/GILLPr/H6z6PPAE/ArkPPz4O3z4gAss+7bGLPrEbuD6Zjvs+AC0FPh1P9z6hOq0+pvbRPriL/T559MY+dCzHPoUDwT69Baw+x+crP5P1vj7AjcY+Z3YwP/GwET8YiAA/9DjKPpm62z5UVcc+dUfNPpH/AD93840+RZi5Pu/1wT5fwNY+tGfOPsguKT75ugA/uim+Pi/EmD69Yfw+Nr+APteDLD/o550+IfnmPnSAAT+azfA+knNAP9bl5j502uE+Y0LcPopjxj5/NqM+t+i+PoV2qT5fT+0+36myPkoGBD8O8ro+9EfEPvkabz4JOJk+KUutPm6Pkz6lGsw+RjDmPqkxlz6Latc+D1YOPxd94T6GS6M+43zQPja85z6levU+IBO0PhAZEz8VLdk+lAIHP6KKBD8wbJg+DH3aPpqr7T5gfT8+p2e2PqwRBT/k18A+I2OyPi69GT8h4dA+0PevPq2LPz/KH+k+mTzwPlWInT5Y7Rk/z5/VPhqc3z4="
        ],
        "moving_variance": [
          "ErfQPp+DKD+/McY+2ZQDPwAA7T7v4NQ+I9IhP8mC1D4AeRw/ibOiPgCRJj85uVE/d6ztPsFWtz4P5qM+lG81P6/xCj9+zgA/DmEfP3Gr4D53t5I/e+W9PpdCuz4AL3w/s4SlPnIEZD8Zhys/B3+tPpGXLD/DPvo+WlALP2Misj+oyBs/zKsPP6KR6z4R3lo/9LcXP+6j6j7iXiQ/D8FqPlo+mT41eIg/jrsGPszwPz+QOIk+UtB4PzHNmT7vfWg/kD9IP/zR+j7peFw+472TP6Dn/j4dplY//5hUPzWMGj/RA8Y+szeGP9EnKz+faXc/XepDP0iuzT6LIKU+5cdHP7G6DD+2DYA/bNgtP++G4z3sMA0/T6/APjFPpT4+FDc/TteZPjITLD+Za0Y/tJg7P1B2iz9+Hik/8N5IPwrjbT8DhBI/z0YWPxWbQD88a5o+0K/9Pju1DT/5Www/9cuPPok9Mj+V3oc/ixUGP4kAAD8e5eQ+sKq7PsMzFD8Q8K8+WCt/P5Iovz4MDEg/ouxdP5in2j5nQyA/VIXvPno2pT+61QY/XHI4P9dVKD9/esc+h09FP3rrND+IG/0+NIDgPh0hRz+1ShE/h+tSP7ePSD+S4ic/ht0nP+6eLD/vj7A+SXmuPlDNUz8+KxM//NoZP0cS2z7l1fY//iObPngXSD8="
        ]
      },
      "batch_normalization_13": {
        "beta": [
          "I3AcPnJWlr0LyWu9daCVPabny72kTy4+LK5vvZbku73WH5894Kn2PeX3tr2e9Lg9jhqJvZAD8jtHXS4+53UnPiietT2NJAe+nuDKPA1s37rOb109OX0VPuPyuL0x+uu8dVhwPHLuhbooLT48lRtePnUAyDwETl49PjMbPtDZKz2ydQQ7bW0nuwx+8rw9+Cy+TQ4ZvrYlY72W/pG8oDZvPcpHWz5ydc89wzJ0Pq4ODj5Ggx28uYhvPmajsb02T6Y9UZcOPg12iL1PR+Q9MgD/PaRcI71tC4g+ypXpPVRAUrzqiD88ZRSvvVicwDugGWo+5c7OvMXXn73AP9M9YgBxPnDNAL4k7DE+Rb2qPRQ6DD63rNa7iMLFPEqEebxheNs8crpsvnayIbzfvVo9SOL+PaRQSb7lrze9kKEsO6UrrL0xhii+coSive5pcT2INa49idjYPahBRb0zila9TYYMPuIvJz1I8n09B+vUPeykmT1CeG49vxcqPunWhT3w/AU+/bNHPrgtJz66HLy9Vp5SvrdFAT7Pode9yZeYPYPe4b1YXJA8d2qfvcm1pr2tLQ0+x75Jvat6pjzP4E8+PyzsPW6TjL1et+C9kX4DPeqZiDu76vQ8M5eZPBI8qz2vy6Y9cvZAvcyrGz6Wqia9GCoYvvKm+D0fnQe9FTX8vcrX471TcCQ9HqH5O1u4Kb50OdW7wVRWvSaggb2MYN283ziKvHMr1j0c1Y09BHeGPlOQWr1r08Y9//q7PRdOzLxCyos9+38wvB22y7xWVZ487udVPiO3jzzeC4E9Fnszvidr5z0Pwv897dzKvFjszTzqw668YEL5PClZXr0C6qU+OUkTPgVgRryGVwM+ZQOnPROYJD0LTRY+ig/KPFF/Jr006TU+qPYmPoJKzr3oqbC91tWHudpGIbzetgI+ro1ePuOjsT0Dnbk9Grp3PXa9vj237sG9yQ/1Pd96KD74KI29HqcEPYtNIzoLmDc+/aPWPH59bL3t7E89SKMcO8DN+b1C3nA9",
          "RrgnPRkUcz2vkuC8v55WvBGNKD0eQlS8CBr0vVUZpLyQcJm9hCgDPsahnr3KhpE9Vz77PQAHKD5jy+Q9ys/evB5HuT3TajO+i/cdPs6YjD3fkNO88RNYPj5C0Tyuu/o9Q5CiPYiJF77X98y9nrihPQ9wujrArIk9Voanu/M0XL1+8Qk+ZuR2PsObpD3odti71MmePOX7QT7R+g47j1KkPdIs8j2UBO29V7S9vSaSiD0Ibm29hHxwvZB1070dNgM9usRkPbLeLD5CKCI9Ee4uvOee9r2yhxq+G7c1PlrGwbyn/tA9ZRXdPQimCj3giKQ+cJR6Pd4LXDzsX1M9Bd91vQ=="
        ],
        "gamma": [
          "c89KP5wmUz8hGmA/YlBeP0VVbT82WVA/zwFCP3YuUD/tJTg/MSxWP58LWT+4NFU/UwNUP/wJOT+bNFM/svdPP32ZUT8z2k0/Ey9GP/P8Tj9jNGY/VQU9P627Vj/HKEs/1cJhPwkHYz+FL1w/pd09P5+1OD8I21c/Bio4P1CoNT8K8Vc/jyNaP5byUT9RnkY/iJdJP98dUj+YsFQ/R1dTP6bOUT+KhU4/DN9QP0sFVz/jMkg/wK9TP1OCYz9lEVc/NHFGP1xmWT+ZkVo/Ir1TPwjzQT8phEo/EMBOP9B9MT8dnEs/5ExEPxtiYT++SEo/b51LP1ceVz+lUlo/7XZTP9TTRD++xFM//BprP5g0XD9PTE8/m1lZPxWrYz+PjF8/+kU0P4mZWz/nLVo/c19HP7loVD8ft14/CnVVP/VVWj+YkDg/8/ZGP7eDWz8ZV0g/PY5PP0XsZj+NO2M/kRFeP19jVT9cm2I//u9RP5o4RT9TwWA/3wNZP37jVT/iYEw/WSFOP6cGUz8y0zA/XVk5P2pRVD+qhlI/bV5aP7bEXz9qwlg/hM9VP9IWRj8lsE0/VKxXPxzaSj/IylQ/93JTP3bAXD8JsVE/OGRpPxg3NT+aAzw/ST1WP8XnXj9BdFQ/hNRMPzVsXT+z/lg/PipFP4SCTD9E02I/RMBtP1e2Xz9u400/JL5QP8j0Qj/zAmA/FVpfPyFNVj8BYkw/ifQiP10lSj/WCls/X9dNP/E8WD+dvkc/gTRGPznkXT8pPEk/VMtgP+mMUT9zA1g/zAxGPxSCTT+I0V8/iGUwP1oOWD+BXmA/JzVMP3IAMj8uCmA/VApYP8kBVz+vfVs/IU1NP3roSz/Dc08/GURQPynQZj/MeFA/d0g9PwnuUD+e7kk/NN1KP0y2Wj/AT1E/BSs8P2jpWz8/XVU/9KxIP+/QIj/cElY/4PdMP3uAWD/KD0o/lOhLP4SLSD8RlU8/NCNXPwOSST/stko/jqRZP2esMz+tM1I/yv9LP1huZj93JU8/",
          "MeBKP3MfWz9mykc/tp1lP5qfXT909Dk/rd5HP3xhQz9W3mA/1HxUPx5HSz+bT2s/HexSP2r3ST98OFk/LHpRP3zHSj9BcVg/rSpRP0sjVT+mOG0/+e5MP7RzWj+oQko/+XZaP8d3VT8aaU8/DXFPP/pGYT+oTks/ZhdUP8qxLj9Y52A/HexMPxKiWj9+LTY/MtNPP0ScSz/pu1U/5NJnP75zWz/cBVM/FcRTPyjZXT/eR14/GVtAP41sLz/70V4/qkhkP4/WVz/vhmY/9qpTPy9jST/wu0c/iDBWP1/pTD87zEM//Ho7P9/xUj8EyUo/M3tMP4jVSz/UpkU/SbhAPw=="
        ],
        "moving_mean": [
          "mBUSPzOrKD9BDyc/bWYnP3wXWj9xxAA/YgvuPveNVT966Ns+1rzoPvjHXz8Lmyg/dyFTP2i3ED/5JO0+h5BDPzH3dz8ErRQ/AjhZPwkERz/wOEA/2+hPP94oRT+swbk+WdNgPyVHNj+Exh8/HRE3P/doMT97ZRk/pS0RP86VAj9aaTQ/yFghPzROBz+egzY/mvcgP3l/Mj8Ug1c/hP55P5JrGT8cy1E/5h0KP4+IRD+4O44/7e38PpqsHj/MAu0+Bco3P9zjHz/dHPk+6RZ7P3Gh4D7vI1E/KUsLPwCMgT9FGhA/mDuSP6qzIj+vAR8/uZ/yPknLVz/4DRE/4fruPmkatj//BdM++YMEP/5VwT4S9Ys/j0bePoRxMj+o+i4/oBBVP18DFz/pbwU/c0UlP2DFkD8bbC8/XWj4PvcxVT8sCIk/e6xBP5Bk/D7q8FU/jf5DP8bwBT8jCA0/uRENPwh59z4/5YM/4e4gPxM/Kj81lBo/9lkiP5ZMNT+QGig/Iqn5Po1sDT+OIlU/5JlVPw/T6T7qNYA/uoYKPzTjJT/lOx8/s9ZhP/NxIT8NgCk/3WJhPxT9Cj809i0/e6YgP3S8KD8S2FQ/7QE5P3l8bz/7yA4/MDRnP8CNOT8d1h0/9c4sPy2UDD+OhgM/OfdzP7knBD/Z+Sg/m/wdP//OZz8jIPk+NswXP5qeQj/lnhU/z3UGP+//OD/JRPo+KXn4Pvi4Gz/RMyw/UVkYP9qeIT+1XAc/QiJIPwfiAj9YWfg+xmlLPwXLIz9amhM/feQcP6E/Cz8FJEI/rASsP0cqLT9IDxE//jqiP4SZAT8ibDc/VLxKP89vDj/vKQM/nCbGPkr+KT8dbgA/VygsP0q3Qj8Whig/UqkdP/VeRz8VUS4/H6QBP25FfT++134/KmgWP2XPFD/xzFA/tfP9PpgcCD/Rgxg/TmoIPyqeGD/8rjk/DrfzPsn3Bz8O5Ao/aYMEP/STCT+G3jI/q4VeP/TiAz8Mgj8/BXgYP0q+Pj+AY1Y/",
          "si1FP1SLEz+9YXI/fKoXP01aPT/nMRI/5JeqP8CyWD+6lzk/ORnXPoQ9eT9hAS4/Y1Y/P8UpKT+hQWQ/hy86P3fxuD6Uc6s/JkaUPr1BDz+dMiM/nKTpPmIAej886Qc/4MUwPwP7az8GO0k/0mpKP7gSLz90cGA/96MzP459mj8GeR4/MIggP2AFHz/LQnw/Z8QOP/PH5z7JrSA/9acyPzNBZT+YTR4/oZKKP8UeXj86byg/Dd5LP9tugz8f8yA/beUTP0ksNj8Yfjo/SaIRP+mRuz8E7ZY/G9YxP9TE+j7Fr+k+0gsDP5JNGT93qNk+MKZEP4tKGT+9pHc/B8BOPw=="
        ],
        "moving_variance": [
          "+ks3QAoBSkDOhPc/v0kGQEtvWkAbeGo/k507P7sp6j/Colk/ddEVQLQKfj8y1yNAtwEyQGlJhz/P4/M/mDcqQIN6C0BUbAVA4apvQEcUtT+rJVZAwz9xPwCZQUCgY7k/EtA+QHaQLEBj2BVAZWU3QHkshj+FKxJAAWjLP57yVT8YogJAjiUQQMSMSUDQ+w4/DzGJQJ0ogj8V/QBA/If+P45TsUA3Udw/mHNpQFLcXkB9es8/wrhdQPYLBUBRdyJAVKeeP3Z8EkBIc5w/HXbdP6qjrD8oB0ZA2ik9QOmNaD+6O25ALFDOPxHaCECEXkZAfKCwPzLzFkCB0mdAdLRRQPWVBUATGew/6b63P6FSzD+YezRA+bWnP5lR6j8ngRpAweGhP2SMM0D+BXFAPKe+QBaT1D8EHq0/HiPqP0bUIEB7hJ4/zzCIPwOK3D8tLuw/5n82QPndzD8kY54/IObTP0lHHkDIhFVA3mfPP+S1WT9tz8Q/MRQCQNORFUA0eZA/1BupP0Ibj0B62Jg/afCyP7CiTUBYbrI/qAlnQJG6JkAH28Q/1q4sQORwSz+IUYFAmAssQDTLX0BkCfE//zGcQBgTDkDVfPk/cIUbQGKZ1j9PDjo/ZQYbQIMKCUAfH/g/uiOmP7BqW0AOuDNAdImRP05RR0AiIO4/nDQJQJ0mXEDTAh9Aolz8P0tinz/c2QVAkHahPyHZEEDGJl9AsIv1PqB+XUCGCA1AAbHpP8Q26z+IxntAw28EQPCkzD98zK4/CLNOQJs07z/QumlA34slQAaZgUCg2BJAMb7pP6JJLECsMbM/ULbYP5W2dj+YuJk/DhmeQCMla0Ax9IxA7PP9P60cCEAlTM8/0GgDQDAAXkBuItY/aY07P/3B8D+qcwlAO0fAPxg3gD/bn5c/EZ0wQB3cJ0AlT8w/P14bQKC6Nj+jQwBAsuDRP/Rj5j/cQQ9AgZYaQC0XtD/4qN4/4LxwQBqkEUCexj5A/64mQLAF1D8nuhJAJhXSP9svGEARSqQ/",
          "XEwhQI+rBkBnvYQ/izX0P3huJkBHSHQ/JzbPP9SZO0DcyDlAMosQQLJDpj91+i9AktwhQAJH6D/M5RlAfZqEP2wJ6D+B10BAjdpZPwjBrz90rRJADxgdQGM/Q0APUU1AHPYkQGCoNEB4KCtA0pNIQH+erECuY6A/wQEyQPtpyT9iyQlAhvicP5Hkwz+cOY0/m+DfP9pRhD/FQydAujM8QPzf3D98kLs/hDGFP+dQNECFhyZAEd0jPzzdZT+fecc/D5HlP5ti0T+xfihALZk2QFmXIkDeWsU/UWkkQK9a7D/iUQ1A918aP41FwD/h8/E/w2GuPzOwN0BBZrs/qswkQA=="
        ]
      },
      "batch_normalization_8": {
        "beta": [
          "HUvVPRH4+b1n1Q29xxfPva3zLL6x2iS9OuYdvcVmVrw="
        ],
        "gamma": [
          "nxh8P//7gD/FyIQ/fj6BP7vIgD/vWHw/o9h2PxPVgz8="
        ],
        "moving_mean": [
          "Z/1iP2cTIz/v32E/GfVKPwecWj8SMhg/ASVQP+K2Bj8="
        ],
        "moving_variance": [
          "o7w/P+t6bT/V724/bEGzP3GlsT/39yA/UAptP0CKsT8="
        ]
      },
      "batch_normalization_9": {
        "beta": [
          "qQMIvcHnsz0GbTq9ndWyPCjf2bsZziw9rFwoPZSDqby4oje9r7UVPNBz7bvHWgg91ZzcOwv7njz9AKc87JYkvQ=="
        ],
        "gamma": [
          "OvpqP2bQhj9Fp44/UnJvP91MhT8HbH8/o9Z8P6cXeT+mSoc/OzWAP/S2bz8aUXQ/79aFP1zKfz+IUoM/VuluPw=="
        ],
        "moving_mean": [
          "gqzFPgMR/j4b9zw+eFmUPt1XHD5SBQs/94nEPsWuCz5KSpM+O7/lPhXRoT68g6k+lK3/PpW/mz6s+NQ+E1RfPg=="
        ],
        "moving_variance": [
          "amQ9PrPp2z5TdjQ+Ks28PiefBz70nYA+XBg9PrplSj0jIeY9IQFBPqtjpj5ao0I+wiWCPjmfzz4xUB8+SVMsPg=="
        ]
      },
      "dense_10": {
        "bias": [
          "mTVIvV5xKb3cKY49fkglOxHbor0gdr278rMYvRUqnjsrNuK8ZFBGvcB4YbwVoFE9GHeavZJWHzougHi9i9FXPUFKGT2h3Mi5wUxvPbZhDD7+YII81BNEu04oRr1oUM+9z8T5PKGT4jxmxQE9feXSuWVHv7xZzmE9BKEavbMUIL7aR3S7vv+/vQMQuTxAfl89qUoMviawTTtrlc+8K2K8PRW+xzxADD49NQXtvJBQ0LnOUG08LDbfPJzEx73kR8q9AC8UvPArjD0Hr7U8ze3HPFyVb7x5ABQ9z84EPHeuBD2iSZA9qReXPSEOcr2ZcTa98kNPvfSb+TzNmVc8I3GHvA=="
        ],
        "weights": [
          "9tnPPVqSs70OHZu7hXAGPhdQuT3cL1w++2EKPpFW9L1JZNu8Os/oOz8tpr0HFjm+jtI4PpMVCj56jLi9tO38vaKvbb7+86e+1082PqmysL3NvOO8wVl2PjdRAD6zGSC9nl8FPuv97L22GN+9soPvvZnkqT7Isue9FhESPrHpgT7B5pG+18ZNPm+1BD0ito894tfSPYV1oD0G7wm+V/6UvPc0C77xNFo+EqcZPq0kg75Jyrs9OOg8PYNF4DsH5BA9c0MiPgTQbT23Sj68sljrPa2hEb6RwVI+yQm4Pcramj0LZNw9CTHdvWN8Qz4D4w0+zqOEvnrXLT7Khgi905MDvXMWWr5vphm+I9M8vmyvjL6gmQu+QTvHPPp2Fb5fMJW9+lnGPVCAIj3j9yw+6LOfPWASWb0kOLW9FXtAvsWDs71oYSO++r9iPqxOLj7GUg6+2cbJvJHwUb5JNim8BAZPvoXDhD6mOYw+IwspPQKBiLzKYyG9D8U9PQogjL16fGA9vxcMvqUtyb0ZeSe+dDakPpviMT2Nb4U8FnMHPdZKCj4ldwm+oBcNvvC4ab0Aqwm+oqwgPoHSID0u1KI9P/sNvVqjej7esYu9wJkdPmF7xD6ZdZ29rm9CvsnXGjt8DQc+QWUgvpjR+jxEcWO+G70ZPmsiJT0o3Ze9GURGvovGOzuoixS+kKlpPoFh5r0c+wS+vMCGvf/0Mr40dLM9nH0zPmTS/rs01lU+mJ5Yvmc2Xzy790m89ZGdvu92LT3gx789fKBJvgVpm70JTYi+kji2vgYoPj37TQU+Zk9JPlonJz5qYAY8aoXAvccjIj6SBrY9zusIPjfxA74f+Wy9IEucvZtPeb7lyxU6EfgXPerKKL5i/mM+KRZGPfKHjD2xDny+l7Vovoushr5GMBc9ehC1PUrn9j3+zP290EyEvqaXyz1oaoA+v20QPlthKj4zLQs9hgekvQ6nTb2khIq+8ItkvpxLtDxduti9JAJru7HDIz4tGOW9spKWvSxHjb2gBG8+",
          "Ou1AvnEEqL5X2Uq9Ncg6vfvnij5QfmG9r8KtOwZ4nr78w/K9KcsyPum5hb1Y6BU8RypUvXbQxj38+7Y+g/kBPmIwVD6UVUC+rs5LvW9C1z1JaIS8zzEsPARUoz0sduQ87xtkvQFrTb5FNX6+3QM9voo14bszYtS9qb4WPdSuJT7azBU+TQ1tPnxaU7u3PXY99gQYvcvAGL7uXYg+H7sgvL81Pr4QpOW9PZimPqGRfTyg5o296LIoPkNSGj5Bxq09fvylveZUd7xNoLg8r+/Ivcu3+L38j8Q8e3+BvgHnCj2WFJ4+l+YvOcvYBrypuMk8gFI+vtAjkL37Snc+sTBUPcQ+gD0MrTY+ZBWBPsqvZz3Y0yq+YsayPMpGpj64wuE8DL4sPVB9F76mBiq+yquMurmKaD4PKMs9Fr1VPiIJ1r28z8u9PkoOvs6Ze73iJVW9vLDlPRBy/L1WXGQ+ZmL8PfpEHb5EXZ292VcnPjv0sz31rJm+egiVvVh+pzz+vU2+12THPYW0Lz3Ww1g+isuWPWEECz5DkW69fOKovJCH0L1Z5I+9XgftPd4p2TuFqXe+vxTtvYK0K74pmM09B6gaPmGtjz4pVMC96PhJvifHG70eJ0a9S4n+vOGnLj1HaEs9Kk3zu1qAET5v8ys+yf35PSArY77jw5k9IaCRvlLSoT0jk0Q9QnkhPgJ3/T1DXXY9FFSvPQ4BN720Ci++t7TEvV4udb6NnVK+s2SmvTrkhDwZxI89dpSFPj1ZMb5Im529M+6NvevWhz4jfyO+HdjDvWGxo73gAju+gji4vdyeB74RFwk+h65DPoA5Zb4btZK+1zl+PKiXp75leWG7SJJxPikUUL49oEc+3CIfPCK+RT71kIO+ghVkPbnBFT6mC3C9YCNCPIrIZb01XNM9vum+PW29gL5QqGu9tEhcvUpZ2LzpaEG+aJpkO9mWGT4SGSU+14XJPUo0DD5IvkG+29bcPYiLxr1KElq+nvaWPS7em71VN4A9Q2p2viqSBzz0w7i9",
          "VazDPM/kpjwN45K8KfSsPa7i2rybJlM9cIOpu2/uwL1Po5U9GvXFPp45wj2V2TC+fpWkPUZtyj0Ap8Q9JAWVvapmFr5xWYA8r/ThPXLJ8T0q5XE9Vq2/vcYbR76HX9W9px5JPQSe2bssOFG+609jvYMRMr2Qs00+pKLzvabzsr1UfG69OTyBPcaZVr3P0TS+9YexvZdJnr1AISI8aeeTPikJOL1EUiW+EA44PiCsWD4J9tI9KqAJPpdHKT7b9Xc9Fe6VPamf57zXgLK69cG3vHJWWr6lp7w9L95HvVuNpz3V3qm+tWZWvjcZPL3Dn+29FY0+vUeWij6YJ9e82Ohovri+Wr5JFZc9bryxvXFKZr7YKJg+dbplPuxCVz3tfYY9ZeiJPQAbRLyb/b49YN5wvAbPir6EdjK+bUJQvmwlWj67Fwo+alhdvt/s+j2EZu29kMCSvTf+VL0wcNm9OJDTvQeLR74IkNu9mVI6vgnRB75c6lE9L/gnPaLfT758MGU+PIdzvhZ7sj7OWCg94WSTvbhVZj0nc0y9iefkPZK+1b2RKxS+CfJPvfAqRT5XNpW9NA6rvcefEL49dbc9DFpNvl6FDz14C/Y6yQkLvoiw6bsvt6I+/VqLvit7Rb7RcWA9fmEjPoOwLb41Nkw+HzqaPfO7kz6yFrU+1y1OvbyMhT4/M/s9iPIPPlAylD1iQL89LcCAPpMlNb7SkvK9Sg75vdVNFTvhqd49Qj6WPqOPhjy1CC69YDIjvj4Lgz0/9K+91JaSPlXBLD4i/4S+rQ8lOx3/Y72i25a9bxw5vTb5bj2dr7Y9cJifPLIoHD7mJ/294dpNPox+cT4v5Eu9RclJPPYSmLzhIQc+k6YevrzSPD3Fc209qUhpvGjZoz3Wd6e+8gkAvnVJVj17Nmy9qZRKPSa6u7yvWhw+9Iscvrqpqr29SyM7dRbQvdDQnb5pFlG+DvFMvjh8Cr7jawm+XhqwvPJ/bD19d7+98GbrPMeE0T1CN0W97PVBvK+EXT7+4cw8",
          "dOQKvuw3672Tgy2+xqaFPBhNCLz/QFO+y+8gPZiZZj6AJ5K+7O1Wvvhgqb35kz8+axqoOWqupT7unwQ+mi6HPMtZKz3P+N29ijyoPuPNJruA8749ZtsjvkSaxjxhgYc9j1X1PICNRzwKsEk+ZrYEPtreF75s0IS+DkloPHoNUbwNZ5E81gRUvl7bjb4j+iO+G5AmPGwpoT1chiO+G9bPPUvlgj44ylG8aOipvYF/h74lzQy+g77HOyuhwzx2Ri28S1dqvYkSBr6oJ+w8RhmbPlrWujzBWyc+PVQTvD2yx704epE+2NFZvRqptr0TeTk+GZKBvmNipb1azKI8y8AgvpE9BT627Dg9VYjSvQIiD77TWVU9CqZPPWxEe75Gf6g9UpFIvtVtRj51hQI+UrGnPL/kLD6DTrq9UmQsvREfQb737zQ+ULrbvdTsfT4J5wu+eyJDvaIptj1NN5a+rmNrPT8TNj5qIAY+lJIXvrOiBL50uck9MuRfvkObDT1i+QA+NW6uvRyc0Lzhnuy9G0W5vIbkxb0ENw4+HqJBPr1gqL4j/B6+0qUwvtMySb3ZSSC9jEAqvsPEsD3hMhI+kGcXPhtsib7FnlC9auAgvoFdgr0Tb2m+GOsTugYEe76c19i9eq6uvaCcLr37xKg+su8bvTQ6hz1b6gu+Qga6vV7v5zzI3I09xSyrPnL4qr21EDK9bNnFPbFiBz7ry3c81SozvU3Kjrz7mNU9TXY3u1zrND5sjRS9qdR0PhyeJ73c2Pa8F/HfvdX3/b1pwjK+uWw9PGKT2b2b4047KvCSvUV/H7v/xoc9x2JGPUcYyL1tKz8+gMPlvee+ZT6o+Lq91kWLvXZk3z03x6Y9P2LWvJ56iTt/BI28umZPPu1s7jkGsCq++x+OPnUm3j2gd7Y9t0WqPW6H7z0e/DM9Ql6KPV6CGj4yS4U9YPiwvFRx+70TvBg+lIfyuwRwIz5zOii+mSgAvkClgj4QgmK+YwKtva8OLj5AEIs+qENpvdRMnr1yXda9",
          "rhskPuU1O73LbxG+hKt7PoafZz3LNdG98NMdPh6sWr2t2+I9mRdlvbuCnT3dazw9+sBGOu2wIb7IhgU+FEKOvoihDT0JMEM9YMg1Pt2Qhz0c8+89irF8PUj3A75IbBw+/wyVvGO6Zz2Tc04+ZZYhPu/bDL41AJS9S70NPSbxJj7xBTO+AehDvnEAjT6PVsg8mv8dvXP5770w/7I9IUEJPhmyET7UcS2+FunnPM5we74m2oY+bypDPm9K8L0NIMQ+f2rSPbiK3L1rSkM+mzY5vcZPJD0XjV68rM3SvAOqkj2ciVI+YfBcvoDtAT5pB6M8oTg8viRCOb0eEfK9ECjXu/cSMz3rCcy9++bKPOgMfD1kAWO8jltPva+qGr7Gnbg75WOwPVpaW73FJhk+e02HPjA/oL7GJ1e+N2nkPfvsHD4TNmu+1Q9yvpV3AD6zHq88fVrmPQKhBr3himo+UaoNPeVeGb5R4mI+dMjYu/Nz6TwMAI++4MI2veEo/ryrOHA9rcZnvEA2d72rguY83Y3+Pa0cW75GVyw8JuUuPpu5aT03Wju9U92Rvd6I473Q3jE9i+M+PDahKz2CJYw++5Esvn+CkrxCvj6+E0JZvonZajvcCCQ+O6zjPU7ZuT4qeyS+oysePhckb727BDI+wS+VPmpts70f2lM+7EV/PnOYqb0k9uE9oq4kPBSrMjxqI8w9+UCrPcGbJT6sibu+pw+RvrxH5DtJMzw+e1NavkOKbb0Ukwy9qG5JPsmvnzyW07g9qVhUvbNPT73QU2M9PbFTvb4tkjsA/fm8y9GlvPRqpr2gcIW9gxq7vXG8CL7mydq9ASUrvgcTHb5n93M9KOrNPZRc7zyuZTo+L083viIYYL3n3z88g7/BvR1K4Lz+OAw+EzyhPZdglT1CihQ93YpHvseZbj69J2S9PIpPvqC/Hb7aHyI7rOBFvrFVjb37dqu981aSvm4zHj70JW49kmDRPRD/6DyHxhQ8Hs7QPK/8db4qoW8+bNOHO7wYWz09Y109",
          "qw7MvPAy7T0U+uy9WrKRPYTVVb6iIvi9eYqVvuZRDz5WR5s+wrQlvX4C772DJyq+/nMKPRaocryLX4U9vJAAPmSlTr4Rr6M9SIrcu86hE754CDy+SrYQvmsWQ707JKc+w0o0vt48iz6DVyE9bkEdPiZAe76kGqA+fMBpvVGBDj3fSGS94mxlvZYUlz2oSwG+djafPsbD9LzoRG2+WBXMvP8sKz5XnRg+Q2AuPBTUv73sXmy8rk7nu1pLFz6ja+Q9i5eyvQ/rXb6D15E+5GoaPgbORr6Ey1i81se4Pa60tb3YOS2+IASePf07Pj4LTO68/5kJvuNxr7zt7lA9v4eEvgUHLD6enWa9Rh9PPQL5ib31O+Q9Qu+GPh5gLD7ZjoE9KKZXvbUTu73fpJG+nCh4PbJGDD5Doow+TlaOPaGryz1xzsG8S+UYvVTOo7060jw9m10SPkJa+D3tl4O9KQMzPXNIrTo6gDc+oStEvbWB+z38Pjg+u2yBvVlPhD46dvS5JFQqvlWqpL2kmqQ+LFCEPoQ7nD36gy09i5TyvSetzj2QAkU950yYvJokhb2wBxo8moeOvvQzsjw6DnA+SiWGPvqnzbvAL7o+rvYAvbbj5D1fjss9fY/+vW4UMr4bgVC+buFIPXuNx72gaks9YpSAPsRajbrVqz098pGnvviopb61/QI7Oitlveg1GTyU1cm9So8dPrYTkjpq0Iw9UYJSvQyzbz42i0Q+v6B3PYMWi7yYfOY9HS6dPGARXz67e4k+FAqLPlI4DD7LSz49e6lMvlJbEb0K4f+8upM5vjYxnL0F+MS92DJ/vYrUhL6BZ48+RaHZuysjVjz5I2I8rGNgvVDzXb0ov609YYPWvUEebj41FRo++OwDvlVrcTwYFX+9ZJe5vZvUTD7xWoe9YxofPoyIkz5tg3++RMKsvRtDtr0PaOs98wLPve5lBj3Ss5E+2zh4PgRCfr2WoBM9Oe/BPbx9Bb7878y8BNYhvPSUgD5wgWg7xAKsPUmrlT08W3i+",
          "ZZTJvdc7JL4IWR0+1pGgPJ5hj74yI6w+JoA5vbnCBjzoEYM8bGkGPRxIcr1UM4e9NmTsvTWDKjol3b+9CgfGPVzM0z0DBMm9/S5JvQkIgL5oizm+MSlEPsGwQr4xWwO9J6ONPOCHkL4Kry+8yXs7PhMad7455Dk8vjGcPXWAK7wPiRq+toWoPT8sQb5asg2+v1yZvesyZ7wYiiI+T//APV2m97346Ga+1Wp2PktkHr07AiQ+VHg9PQ1foD2C8sM9/PA5PppZJr11VQ4+lOhGPs8chTxnlwA+IbgEvr+3WL4Vik4+EXHVvVyNd71BNFM95dC1PhStd74h1nA92OaTPpZIjz0STMo7hyWfPs70dDwuUVs+VeioPVBtt7xNv8K+PcsOPprzXD1Bt1e9VuzcvYOW7z19juE9+AxGvk9l6b6YAAW9yc2XPH0hKj3ypmG+bMopPvRM2T3Vx4I+1ZjlPJwHjb4EI7w9UYvXvFb5Ij49Ss680n9UPqDDqz0v/T++320wvnB1mz3tqQs9v2NUPt079L3lfpK9E4iePtMqq77wGgc+9BapPMkYDb7RIye8A7bhPc7VRj7amVQ+dJYuvoCzDb3XGly8LzXoPQpOQr5Cqxo+/X1YvaURt72yigY7c+aXvfE7C74AyKU+KR9Rvdx5C76DFAg9rnG0PYTxbD1ZGJG9qDBQPjs+/D0PzBM+iQRqPpczrz1OBcs9QTnuPaFpiD6I7IW9o9acPe8o/7wC/nk+Sl71PGdH2jxqW5c+lZU1PkNJkj6ojyu+NmlzPpv75zuE2+q9exi+PayU/rqCy3086VlRPUcpMr0D+RK+pczHvbRC9jt6ABK+2pCMvV6RIz4M20A+HscmPaiK2j1e+2S+SrikvZ59Lz4YMiG+yKI1vumWSb2IaVM87xs2PrFvhb0moO29Y//pvfOghj3m7GC9jN88vhO0UL08P4C9+MEyPivrZ71T/Yc+XBGNvY32gL1sqhQ+PMiFPi5pFDzItxe9lrYbvtIEeT1bnQ2+",
          "S1APvcUnnr17oRM+HpwHPh2ILr5568u9SG2IPqsMoD7FUI49aEC5vfLIRz7+Yr88GRSIPnTGJjw+9ca83h+ovV79Nb1qxVA9Q1t6vmAwLb7zAoM+n3wqPvfBWL6sR5g+iFQ3PtwS1DwiNsS90HspPtYETr27xKQ7FE4ovpgkob1uWSo8xWiJvfA5hD2dNoW+3ENUPu1BZj7LiSw+91CTvdscgb65eVy95/JdPs2YiL2b11e9EK0fPY2D/z2+KD8+k00bPAy2ab36Jlo+nXi9vaFGYz4rVgC9KcZePmeMWL5Jchc8eyIKvseTED7G/vm9e5RfvgTYB74SPUo+VEwUPs1cij4TuMk8OAa0PYuwOj02V9E9f73aPTI2gb14UJO+pz8+vrQJaL0XRVQ+SSu3vJxILT7Nbb89K4pNvv6xV75M+H++eImHvQpE/TxvC3O+9WIGvXFv1zy3D5g+plHoPc8dE74b0+O9pCcevm+KTj3FUec8H2y/vaRzJT7f5sS97u6RPSo6Kb7WxEo++fsfPoXRCz43tsK9unB0PrvaHLqTHou+E1L3Pcbv/j3Dnyy+Zg5tvuhnqL3zAdM9G2eVPVSNDz2XlTs+LQjJvVhYFz4J6Ya9QgGOPh1rGD3hdYK8n9cDvqzRUTvYu709AuT8PW3BvT3tqxu9QB0DPUSlvz3ScX48UaJsvZPkqz3RCiK+xLcqPm15kD1V97m9v+9hvWWfNrwrpdI7EA7ePca+oj0Qm3C9iexkPdNFuz1bIGm+Vo/1Pchnv705/lK+9OxqO/Naqr4HmYk94l1BPp4dyDxmNkI9kgqGvF+vd76Uh/k8LnWUu+dzPT6dLmi747P1PU6JhT2ELpW8q109PnBxUb6eKN+9ehaYPhNiFT4HjoS9E+lMvtfEEr6dCHS+Q7W0vVr7nr36pnY+l8dHPnzqrz4SGBK9xhQSvstQU732AJK9sKyLPdILZj42iMq9lESOPhB/Zr06khQ9UcE5vDXx0L2ziTQ+KpkmPnzalz3mTVu9",
          "osQQvk7GYL0VQ8Y9WLK9vb/1cD5oOrG5fKqXPULmmr1XMcC86qgOPRQ6cr6qNjY8v7AdvoKSoz1U4I0+vSIqvq8mr763MU2+yRpNPufRbb1/zEO8BFnLvX4MYz1rpbA8dAgVvjZBrL4FErM9CVW0PX+rM72sXm49Xo4WvhExq71A1fO91LwcPq4iUz3hXPs93PlNvlM3IDwYvY89kOLWvWsf+jvNgzY9JtihPblGGz6bjaU91gl/vUih3z2lKIs+j+QxPlOUiT59VDw+O6qUvnss0j0DNi++JkmOvSaaIj6e5Yg93xvHPUY2xL2Az+U91TAFPtTl0T1mHYO9d3H7PT5S2L21GlU+obsWvgN4QT40UpA9gbxMPkoQFT7Wuma+NEkvvXZxrT4Jot+8EDLHvXjdE77FAxu9UoX0vSJ7m73AfBO+q/o8PuWu5727RkA+8H44vhsNcb4uLiy6uE/iO+/bv7sTUJK+rKxzPULe0T0cGwq+t6iMvoHgqz03/uE9a0IvvrXx3T2UJXC+n7awvTJbjz1XxWq+RP+ePqsqCzsU2i69Gi4du8SQQ72HxnI8VpNQvpqyzjyClRa9ZHx2PYx0WT6sjBw9D7YTPp+3Nr3wRaq9WHcEPcJ1lD3My4i+cZ1IPaY7DL1kChu9RWAxPnWf9zsN3Ms90LrIvVQ0kT74Wvy9t+jOPMbcij4Mwgu8AemaPckPLD4fFnE9+8ILPjnEUzxsLq49QdjBPWASy71i3na9yVoOPvyMhr0gMpk8014Cvo6xYD49lJi++hnqvJiOLT4SHuC9c0NWvOu+KbwFK0g+A9IZvtJbKr7VDCa+DBIMPpINg742Vrm9yxysvUEh0jxO8ZA9Vr1tvkxRKj1sGi++InDSvPaIhb5mgEK+G/sRPuFVIL6F542+TFQovh+a2L3QDpQ+ZpTbPWhjtD3Ol5c9A5w5vZmZiDyEQ+c9NRHMPawZ0Dzceu49Cdecvr8Go7193oO+VOt9vn1cBb6YiEs9W9gYvvMuhby4Or+9",
          "3P1bvmdjhr4ChAw9yctsPa2FFD4BWUo+7HcTvvWnsL0+KaI8+jQaPZCojrzqqmi9ZyaJPmhnXLy3g6Q9Uvn3vWJKWz7jy1++B5gFPoN8KD58xB2+0iVAPqY7LTocxIM94D67PSdQbz6SC5y6epuRPtzZyT01GnM94pruvE9OLj5r8ZI93VMpPriVN73G6969GmaKvYP9BrzOnGo9R1CtPVLHTD7Txhw82CFqO+hBB71Bw1Q9+gF0vQK/BT45foI9SaBxvqKvlz73qHs+TYK0vI0RWj0IgZU+qd+kPQa+gbzO1jQ+j/gdPPR+8L2r4hy+H0p6vVRXFzzEpFq+Es+jva+K572rQqG+oCPbvSzxKr13T0M+X18gvVyhZT5RQeK9Jq4/PlLKqL1Vram9WYycPT5SrD3F12S+hrsLPuKJa77aCMw9rXIuPLhZmz2Gw5S9nuT1PZpOCTxvdxm9w6CTvANxqL0npGk+mflGvk7fBL3zSQs+MJ6HvXSshL5oXqC98TGuPvLLxrxopFi98AcHvptxsL6j6d89oeuPvc43Rr5P7bm7fCSPPt7EJL0M1s+9Kl2evgOZ1r09BZS+h3/1vcOMvz0VKyu+tT7zvRObKbuZ7IA84eTGvO7+hr5NgVi+GMHAvYXGn7zPhyk+rdOBPtnvQLyeISE8MS6WPlPIBb447Yi+/BWZPjul6z0EHOg9ktDzvDbIXL2CIzo9RaBQPL1f/j2C5Wq+gJK7PiKgO757Ejg+2qgrvpqzar0BmzI9umiiPRhOBD4nCyY+bbIOvtNC0b0sux6+aTxDvc5MHj58tH8+Z7HUvXrhdj0A9ZS+mF6PPqjYYb2WpWo+VUDjPf7nNb6GuPm9XbhKPZFT+zxla0c+QC6tPm/z0r37ikC9UL4dvVkDWj7WvR0+HbhcPpyGPD5sVOy8y++/vT8cu71wmWa93WgdPmEVlb2hbOS9Ksgevfvv3L3ismm+x3NUvmhTPr4L4QW+Q+DgvdOqyb0Rs2s+L6B6vgLm3r0Z9/69",
          "znMWPAfTNz3sGSg+9zKSPqZVqL3b0z49YuWSvs00jbzImZS+e839PVaXF7sCpZA9DfKhPeinNT3nrX494DNxPg2SkD4Ore88WIikPpeFNL6JusU9a1GkvRT4+zzesJS90y21vAMeMT0U7/Q8H+GMvh/VNr5phsE9VqQivlqMtT306os+1UkCvhw5zjuuJGQ+ryUCvixi67y+oUm9T98OPStEKD4CZ1K9YKaNvdL6iD7914u+nWIZPnzOAb5olpG9k87CvRio3D3euTy+fo7hPcvZLr7Rxo++4pk6vlNTHT5buKA9VQYyvdl3ij75q14+AJUUvnVgS7111TW+y5XsPYWfoj4L2C0+sTCRvjEOn73ZzB8+fBBKPjpXO70oWjs9sCyxvL+znT2EubM9iyBVPQmUiz7mIgA9w5dbPtknND7w0qC9P15jvnWRfL6fh9u6UDW0vgR4P70+nJQ+CS38vQrrTT5FfOY9hHs0PldIFr4gIxQ+4G9tvRiahz22sv+8J8iWu0eXPj0WBBA+iyyYvQg8jz13cie+OV3svTnCVr6DuBo+8bmbPL7CR76VYHg+4tGBvdJe8D2m9As+wvq9PUvPYL6eKBk9rMgJvs3aXD5thky+dIR+PqUuWD3Az1Q+EDizuZyrnD1ddSa+lXTlPfHtD70Vidw7P1dSvSJNbr4="
        ]
      },
      "dense_11": {
        "bias": [
          "PHDMvOaciT2htIi9beKEPLp3Iz3Rl5K8eU9hPK0CbL2TWT695EKdPVmKTL28C8C9d0UJvFTY/jzguTq7EvWgPW2XmjysDO28gGGFvCgBXjwUn7K9TBkGPVTC4zzsDe28EtAJvbSQJ71Spxg9NwWXvY1VHL1cKq+9sIIAPV5P7zzed9w9wh63PRCOajzc8sO7neidPHzaLL0cZQK9b+YAPKSgHjw0HWK7UkQOvkbykjuWyYw8FoKhvU0kxj1+qvc75GBPvdAL9bwuZQI9Y/FlvPAoRLyyeaq9inbePbwfkL0Ne5892A0WvDLTRztpMZu8AHoyvUaJMz1gikW9qZ8TvcSF3LtjWrg64Q30vPEDCr4JCvy8Hlvwu2y8qrxTGia9wtvmvePyWj0I5LO8sq8dPfKMhzurNa05+D2gPW11Eb1bpmM8+BiUvKhZpjlGEoW9DT9wu7MWK7zsegO92qcNPUXfnbwDf2i91asPPALm1r1YaH+9YM90PHcQar2room8Q1MvvICoNj3V7zG9hJQhPZwY/zzsDp69eW0lvc5VRLtj0y49LztEvVBKazxj80U838FUPAAWI7w+nkG9GsqpvEZq3rxxK+S9JO6FvSpgv7p5fik6S6RcvQxpwzye0l08inzaO/v+jj1sV2g99evZuxiwX7t7+Pu8hiwxPSN8szs="
        ],
        "weights": [
          "mD8ovWK4ML7yJ/W9hmKnPQEiuj1NRAa+R5gjvr2DX75OMd67EzH2vStCnL3uKIM90TibPKKatD3n+G+98XPGPWdeMbwzE1K7rwUbvvsuO76q42k+TtZePHYqjb1Se0+9U+xdvWhVej38Ie88A9UsviaX/D0BsDi9q5ZiPXcdnD1KWXg96wiqPS27xzwFDk8+Bx17vWLKQb5k49a9xHUePmJGET5lKXc+9KgrOrtkKb5GUQc+GleMPCe9ar6O+Io+CRWoveptWrzIWqe9xqvRPbtxVD7C7eW9NYdtvm2wEL6kfU2+BdE5PvG1kTyqO3a8Y1cBvietwjzu1Uw8Yxc3PpUf1D1kERg+2namO4/gjbz6W4k7SNq8vdDxVD7SjZa98b2/vHVsGD2nGao+qcdFPTX1nr0kMvA9LpKQPcH5gD21IW69x9tHPCpOAT7uigs9Rjp8Pdf3Qb2e+Ty9O/CUO5vJxL12R+Q8XMAyvdmKs7ynVFA+0LX1PM0BszvRewi+tr2rPagqij58uxC9OoIKvvqFOT5hrhs+oQE0vYIToDzLm009b98OPvKyXb6115g9QgjGvfbfuz2mehO+xhujvABlCT623CA+v5twvaFXTL16cs28Fg0nPML+prrQgNM9w+bQPZhVab5Q05S8+Jx3PStY4j0ks4E+njKhu1CrMT7OubY9yDtfvJAD/rxyCxC+Mew4Pk/mKr1PNUu8DIivux0vKjwS24I9bL5/PfbIkD2A/6+9WKOLPRYmgjzto6S7dtIqPsUb2z0ogCA84a+Jvkoyl73lyV++7AFcve6ODb6eWmg9qduKPpZSlr0h36499T1Ovf6wUT7eO7w6Lg84PlGgJb7sZgu+ygbGPToyyj30RgI+w40jvZx+tD1xUlO+DHIavjOdzb2nyVG9q/6TvBlN7DwJaUm9XUntvWOyLz0Gtrc9MoLjPE5C97rF1A8+5qkTPvIATD5vWj2+aOc8vo2CGb6crju7oz3WPcyZirzHLtO8BPtaPCqjpT3XgAM+",
          "Pz23vbvFIL79FZs6dBDfvOLu0D0QaD29RTI1PUc3wz1N9Uw9DNWLO5ZTRDxpozO+hHVdvlqYFL4GYJU98+tuPtGpDz5hWMQ8ibekPC6U8j17XaQ8JMd4PVE/r70JGFe+NW7rvWH6E77z0SA+JKOFPD/U57wpoaU9A/H2uxdkVL1Ijp29Zh3jPXBbcTwtrf09U23BvM+yLD7SNgK+UhtHvWU7/j2sOJa87+vBPXet8j1o+Fy+hdX0vR+7kb35Xqg82WmevSBOqjz9BC0973nHPckooT2SI0U+r82pveA1Dj2BEPm9fljZPAuqRL7+Z509o71cPvCMmT2qBrO8/OCPPURYjz0WuLs9bpsVPmjIkL2It2S9z89IvYLbNT66ZpW5Q06PPdhC27xdh8W9PXSCvXBPsLvtray8WjzBvZd/Ej679zq80kNevgfxaj1ePs29ETR7Pna1pbxX6rk9CSTgvW8DGL2xkSw+8ZICPEWNgb34SN09P1ZJvBczLT75NGq9NSuLu4C1nb2h55w9st5Jvlv4Fr4GvDy+WAtKPYnnRz1nmLs98J6kPRPAhbx7jW2+9kFFvk7uL76zT409EN49PqQtxr39un88gqkUvu3TEjzC5ZW7JeYHPZoCxz0kYSO9kfsFPisCBT6PbHA+s1DrvNgwtj3xyNS9wWazverhXzyMWpS9DuyAPadyA74g+JA9EQDHvaMzMD4mzh0+KO8evZ3VMr7A/xi9IDT0PWzsvr0ohie+Wui3vYsp7D36tGu9G+atPf2MIz31olU9CWRPPtnGBL5tBja+46SZPZldyT2VAbG7FCkpvfKJgTs5qya71ej9vRYtODxy4s68YEa0vBBAQLpg5qo9E1utPTqtlD3u30+9iY29PXE3gjyuFJE+S+NjvnsFL70wEnc8NoE7OmEN0j2J5tG9Vqi2PT7hfL4qiI29ESG8vRJDLr5hek++yMHGOwvVpL30bzu9gKNIPTMxk70e8Su+xcEsvFZYsb1z/3+92herPTTaUz0j1yc8",
          "ggPivAV7hz3qNcm9GyokvgGfTLzs/DK+xh/hPRa7oDmJpHQ9ZWYevsCbNL2w/Kq8um89PQmzhz2RHvC9vwZJvvX/Y77Eadu9uiU/vEumUj5U+OE9sGyIPaIJgL1S1/29mphbPvAXtr261Z89p2STPZ/HVT0W1tK9EA2ZPaZJRT6mr3a9RmAGvuidGb0XRaO8fmmzvTEHtr2neZW9qCUdO4PLd76YjhI+fMVqPYmEsz1OVri8Fk5cPTEvJr7WU2w92+t5vfNdpj1LXG++NDJ0veNGz7xvdCc+21WRvTfeuz3SwIG9QHvePBGiZD0dKeK9cEetOzkGu7ya2o89TmYQPlxvzL0F3jE+aHzYPdvEFb6AwmI+z0jYPX3Iu72vESi+oeVZverPGj1zdAY+QJs8PjYuSL3m8mi9Id2cu+qHnDwfMZK9fh16PTwP5bz2rBI+HsoBvokBB72IlYE9gqDCPdXTAr7hdho+ECf1PRudmbr5Gjg9X3EAvgVqur2TTzI9YxqrvfLSpbteFgg9VYpZvUz55r2nCNY9C01qPTvGPD48v6u9w2C0Pd8iVL0imxS+mV0VPSAPv7uqF+y9aR10u2mqWz7Hvco9M1cOPl0xrzt3NZs7VAnxO/PSsL1g6j29Ps1ZOYtpoLxIywE+MlMuvmZHDr3N7C+9b3gQPgG1Sb4Pxvo91fcUPpCiDj5rq7K9BE9ivYd6y7wXz/o7HBPOvOA3mT05obE8HdgRvkThdTxONoE9VkisPRyPF71Z3wW+rSE+PoiNKj62kKc9YfamvVsBMj6rOCk9HdXKvX+oEj55GYW8aJFRPBm7DD1GFGM+SPH5vDgYWD6kfIo9mVDPPEmrl73xeES9joIjPasAN71QJhc+IDYhPY+0ajxn8SO+lqCBvSJ05T1UhTo8TehivesPDr4MMkw+skqjvS+qMTxQnSo94krOPR2P5L3FTgy+n/KAPQuTHD4OxGS9sKvoPbWHZjwRBgM+CESuPWyJzbwzXLe7/6qTvbooaz4J9RQ+",
          "xubdPd6vDT1VQyC9Hd83PWhxB75RyaO9VBypOxmyHL1M7Xy999g6vimTxz0qDGM+v/fRvFQI3D3x6Re+Pw/jPcITk70FgS0+XixNPQNhTz0NNP+82ZeEureG1TuKT2A933tTPnXQED0IHTe+LiUKPiWHtD0BCkg9HGQyuwogqT0N4nA84IEyvvsjmTxbzqk9bmwlO8SE4L0T1Gs+btFKvorzAbwgbtG94m3Sve6eLT5IqWo+Rt0wPsAK+T0cCgU+hi1LPVbZgrsIWR88LVmtvdkmTr1Ttwa9VVs6PnpLuj2aE/+97Lw3PaKpwL0DiUE83vgIPovIPD4oj6q84GoJPrOy6r1FecI9O+TFPVgI+jyvmqa9G5XQPKvv3LyUAGE9SydWvmiHLz2Litg822MRPr71fTvUMKw9TNkUvuMlD7tS+Xc8/YEtPh7WkT2VUD2++FByPXC2GT556K69CZxLvs8ZMb2X/ag9nhiEvdzeQT6U8B49rpgfPTQ0Uj6cBhg6Lzc9ve8GxD0JggA+/6XQvOTXQr6Xdno7i17NPQ+2nD2DGCo+TY8oPfh3Ej6xSOY7ZIGruyv0dL5fMf28zzTlPBCSkz10qoK8vZQfvtT66D1Q2o+8eQ7bPZo+GD3tRxS9+zqaPU+as70MVpQ8eLFAPfDNzzufPt+9gNutNp7XO71tqa275gzHvU/VEL6nX7u9cS9UPkEwT72ELvo9mCjEPRPeAL747zS+i+bivEZUlT34WNq9B3gGPrwgdrxUMYE+GEs2PnTWq7p4AoA9mGOEPrcA1bxeM24+5WnyvW6umj3BaS4+wnYOvakZDb6uVCm95nDNPa2hqrxjGDY+lP63PYgnFT2TRAC820wLPn7FRLwBPA69Zb8nPkencD0zwhA+AyM/vjhqg72qXcy9sWKJvQMwRb3SOSK+zRENvvMscz2FL1k+gKM+Pfvxcr0Cj8k9FrXRPUvj7D1jbxE9lba3PRbYDr1WD9s87JP5vTOii7zU8os9ngiIPIZb3rzEmBG+",
          "ubCJvbdEfjy7ReW78k6bPBunuj1+u6+8IJYWvYbkpb0Cap085/oKvsXs5jtjzrM9fCK9vRM9uz3c//i9PQgFvb0M5b22ipA93eaqvbwMgL3v8pW9kCUGPmvye74Hwhc+Diqzvc0nPz5niE4+p1yaO8C+tz3HukI9zSEqPbo6jT0H5Ec9c8sIvmuHu73gFY+9Jy0GvgPUNL1SI4E9doxvPgWwCr4mzmi8yGaMuxkaub2EaaC9Em1eO8UWBz6zYti9gobBvANT/7yoPqC96zIFPjlF0zxQpMc9UJnrvW+BiD0v3PA8mM6DOwGiQL3DNKO91nR8vVDfwz3c9iw+Nl2SvQez4D2KFz+9s9XDPCV9yb2iC4S9jlRfPebzxL2ROw4+SzsiPjq6Jz7SPq+9SLLXvdY2iL3U5jW9OfrAu787Rj0in/M8iFqPvJqlRz05qTk9MVkGPu8pqj1ls0q+XhYbvjcWtT38FUo9gW6QvZgIOr1fEPs9LVgxPkvL1bxWkge9bOiTPde1zj12BfI9t5D7vdMQ+zsvKhG+NtXHvcOxx7vnFZI9hhtPvvevMj6oCUg+igQ4vhdQ3T300nM8KQy0vT26FL395bk9T40dO8LkBD534Dq+1RtnvjNrWz5Mtf27mXdIPes/gr0t+MA8uVsTPp+cXjxGd2U96kAWvnxs+j30MbY93pOjvHtWhT3WRA49+i9MPdlLLz0BhQS+Elwpviy7DT3sTDm+u46xvN4qAL172Oc8sR+aPbi5Dj4sRG69GC/JPJOHqj3Qdjw94fcYPkC8zL11VuS9L+KvPC2C6b1tA8u8kB3RPSQIFD7hSUC+ZZcxvuJ58b1oeUa9GyktvrnLCr3oa6A9iAYPPflCAz7nK8O8W07/vGr+ALxEU3G+xr4svUd6KD7u6xc9///tvQ2jRT6da+A9tlESvqaWRL5T82c9Nl+nvV6xMz46hsy8pJKpO/xrFDyIg+k9pOQHPtij8DzAt3Y9qBzdvC2r3b2ncJE9nSdgPg7NkLwiI/i9",
          "94apPHwV3rsQiK49Lb+aPSfBb771ym8+OLOwvKbZUb2F3DC+P3FWvbaeTL6/7bo9gu9lvfkI9j0s29e9Nn8bvKEWRb4KROo8TuO1vN5ekDzGSNW9FOsBPHk8f73kkeK9TgyePeB+Lb4TLpe8qQsDPUGtBj4uL2s9e61Ivhw1RT4yqk0+nJaVPQvLUD2xPzG+4s6lvYh46rxbzja+xBiyvb6/BT5fUuE9t0MJPqS0CT3/36o9/6tBvK7hn7y9YAG9HWqgPXogGL5aXsE9nC8rvoSlC76meCg9/dnVPKrykL3HDvQ7kf1MPmTKLT1qzUg9f9EbvhLC5L1JM5+9smDuvEoXrL3RG6c95WRDPR5brjzRGI49iPTMvfeS3zx7PBM+XDA0PkgKybw+RkW+PY0yvfZ21r2/VXG+VOvvPf17zzyz/XS+6NPfPXt4xL31PT49c81tvk1+LL3lTNO9BnqJvGViND0UHoC8RxehvWyHAz4nznQ9UTJePe7qUjzJozA+Hr0Dviav+73/QoK8bE19PRyYGr78LbW92gq7vL9IgTzT4Wm8rkwhPfu2wjwzsju9tv8SPgk9fb2IO2E8NhaNPaig97wRhPw8ENiZPexpiD5yvtQ9smMCumtnib1CEAK8HBEivjSLRj42lTc8Q6DIPY47sb0RniC+NO50PXZu1jzgG7u8HEC5PXrFSL4d74O9i3vLvZW9y73hMjm+5MINvsH0Ebwn6Gs9A7wFPr+kUb4oDEG9ep+BPQMk4D2EwKo9nUAvPjq0YT0SyB4922rrPfATVL3b0IE+z2+yPAl+kT1AoGe+f00aPMBiBD3o+Rm9SSCEPikCYL5F1BM+9Rl9PQrSFj0VSBm+9zZHvP/7yr2nvT4+1OCePdOvGL40geo936sXPFDi0TxA+ri8WMQbPucMVDv/2d+9+BOdvWy6Cr6wJ2E8cBcbvm2CST0Fgmo9w8zlPZploj2JWIa9fyWovD8flbxJd6o7Hmh5PETcQ769C2A9cq9kvXju2DwTQkc+",
          "m+GUPWufjb3T1+c9r7i6PNLdG76rN2u9S8d3PfxAFrzNATo+99cnPQUFBD7WrIu9WqKoPdy3Lb6Mww89avEHPo7oBT33n3s8b0YbPukvMz0M14Q9wadDviJp5r3ViZm9G8RTPf51kLwdjvU9JIgJPnriTb0eBU896ewJvmfrBz5AEqu+P6PnveA3rjySZkq+ydKoPf3REb7G8gW+JeC/vKLzJ772kyY8mhsdPtEzB71FR789vy23vSFMIT6jpZC9KYAJPt3DJz24tmi+IKByvZvFbL4FgGa69D40PpcmU77HHCm9P1F0PDeipTxakMc7Z85UvVHxXL777A0+2/k5PY1Wiz6cW4O+4EEEvS/8i71bpn48WJ9OPAJYhrwJvFY963OCvGrpKr3wBju9R4ZAvvc5Rr6omTy8rAEuvvNNRT63j0I+n/H0PNakjL2KRLy7JUBDvQk/+z3YuC49FvmePLTu6D2JPbc8QAGpvZv1t70myQs+s1NVvvwkOb0u09w8TGQqPcRu7z26rOu8/8esPcvvw70n4BA+kS+JPiY6nb0Gsui9fID1vecggb1WBoY7qU3uPW9bLj6xxjs95igjvCqBmj2Z8nI+oMLMvUsf7D1B7ok9SjvhPPFisLxxhii93W1qPv7dKD0eOjI+Z8Q6PoKAib224ui8bC4kvg5QYL7adha9xsZoPTewuj1gkBi7v81tPQlWcj0l1q69upGCPZWXAz4Z+AM9cFkgPpQveDziJGQ+sgbXPVWBob2wBZG9LFPavYF2GT5/Rb696/TZvb6x+rwDRqe7dltmvgu/fj7+uH28bMF9PBu8pLvnobG9HvUpPP0qPz0UWey87ZzQvBdU/7219Zo9qmwSPi2xCr6CtXU9Eq6hPf8KHD0nUw69S1ocPqXcCL4FT2g9oYQ6vc4Ma74y8+e9U/OHvd2kcz0JkA89YamKOz4eZT2k9cg4Z27LPThvNLyrqfo8ngdpvccdYL3XdiU+kuU3PeJm6z0bJS0+udtDvQuG7LxNEX+9",
