{
  "model": {
    "architecture": {
      "backend": "tensorflow",
      "class_name": "Model",
      "config": {
        "input_layers": [
          [
            "z",
            0,
            0
          ]
        ],
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                8
              ],
              "dtype": "float32",
              "name": "z",
              "ragged": false,
              "sparse": false
            },
            "inbound_nodes": [],
            "name": "z"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_8",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "z",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_8"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_8",
              "trainable": true,
              "units": 16,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_8",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_8"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_9",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_8",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_9"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_9",
              "trainable": true,
              "units": 32,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_9",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_9"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_10",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_9",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_10"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_10",
              "trainable": true,
              "units": 64,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_10",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_10"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_11",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_10",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_11"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_11",
              "trainable": true,
              "units": 128,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_11",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_11"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_12",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_11",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_12"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_12",
              "trainable": true,
              "units": 256,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_12",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_12"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_13",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_12",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_13"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_13",
              "trainable": true,
              "units": 512,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_13",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_13"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_14",
              "trainable": true,
              "units": 1025,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_13",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_14"
          }
        ],
        "name": "decoder",
        "output_layers": [
          [
            "dense_14",
            0,
            0
          ]
        ]
      },
      "keras_version": "2.3.0-tf"
    },
    "hash": "88af681a295565d507fa1d6595e114b482f52e8ea0caef8bef3cdb653a4c43a6",
    "image_data_format": "channels_last",
    "input_shapes": [
      [
        8
      ]
    ],
    "output_shapes": [
      [
        1025
      ]
    ],
    "trainable_params": {
      "batch_normalization_10": {
        "beta": [
          "tOaKvYFaozzslQc9AWdPvHLyF77FJ8k9SOIOvl+fZD1MvqY8RLXYPPXFFbxHrXG8wPrzPPTymztttLi8FP/HPPM+0T1RI1m8oFLHvT1EAz63qHw6Xx6gPGXzJj3CFhA7inuwPN83gD3Utwa9nDWdPTX3j70p8aO8KIaLvSnPFb0="
        ],
        "gamma": [
          "zkWNP/H0dj/fMYQ/e0yLPzj6ij9mPXo/xyV3PyvNZz+3NnE/1Rp4Pxxegj/OSoE/BeSBP+CZcz+D6Xw/Mp11P0nkgz90FoM/tBaGP7epfz9oNYU/+A1qP7FZez+342k/O6KEPyEjdz+qt2c/FJWGP8QIjD+ihmc/e+GBP1SRgD8="
        ],
        "moving_mean": [
          "XQHkPtOb+j6jiMw+BjbvPvVbvj7Mzhs/Fkj0PoD42T66Jwk/Mq+7PpH1iT5Laog+PQ2MPqitfz6CNtw+m2AEP/lFvz5r0aA++LZ1Pq8JED/WkCU+q/c3PoCSzj6msrc+WcO+PopA0j6yYmg+J95HPmVBnD4DQkU+qSqePgr4lT4="
        ],
        "moving_variance": [
          "Do2fP+yKQz4LEyQ+3B/RPpdwIz87/pg+Ep0DP0R1wT5IROw+c2pSPo7qnj5S/4E+6DQkPp2+6T1/wZQ+4m6TPvu+Nz69l8I++rmWPizPBz+neEw9xul9PdItEz5fLBo/NYG5PlN/Bj+vCZw9riDwPauwwz6k3Vs9iy7YPjaHkz4="
        ]
      },
      "batch_normalization_11": {
        "beta": [
          "N9fuO/BiBr77hy69gax6PQjBy7ukCAO9eVjzPXnpY71QIKu3tDc/veSyoryPuzu9exEEvdwzRj2s9ke6b2A7vbCJazxn9EY96zrTvKJCurtsNba8+f9GPLMuXbv5FC87wrAEvgClFz1kJDo9RK2BPucXRz2m2sO9ykooPYIj1jwV16a7Q537PKj1yTwHv6C9SaXVPWp/or0WyyQ9gxcwPbOcFL3lAuG91RiKPbCG5Tp4LM29rC6yPUWfnL0RIay8Bd9QPYnSsr24hfG9r5/PPCTQeLzHqXY9WquZvQdidzzQV0o84/cjPZXPOr7UT+U87pBfuggHAb0oUmm9ikNBvQ=="
        ],
        "gamma": [
          "2eiFP3GKjj+A32U/dL17P0ZmeD/kT3E/ePl7P6xFhT9h4Xg/rMeBP8PHcD+PMnw/cNdxPyRHgT/F6ok/24uGPxc5gT+6YYU/BsCDP0d8iz+fMIo/Y4p8PxifiT+C+IQ/LGiBP7/+gT91nIE/6edsP9gKgD9xXYg/aSh0P99+gD+hTYA/U+GCP4W8YT+SUoE/RCmDP3WBhj+lB4M/Knd3PwfYdz8b8YU/nIx+Pz3RYj/DMIM/zCiAPx8ocj8oZIA/DitzPxU+dD9a2oU/RmmHPwWcez+j92Y/1PluP/x7dT9CMoQ/slt1P20Dez/tOnk/NDt9P8ebgD+6KYY/0aaDPw=="
        ],
        "moving_mean": [
          "xmk2P5Ns3T4m1wE/Cp3OPtxwjT5b9JE+npUNPwYWzj70AME+8s3YPpq6uT6Zooo+9R2NPvhsHT/eyMw+omXOPuy1uj6MRQo/fpC4PuaDAj9j3Pc+ZpYBP6j7ID+MpsU+kKCpPkBm8j44HNo+wngXP0v6+D4XigE/3zAHP0x7kD7qgFs+PBzZPlXWsz7Yd7Y+WqslP8mjmT4TRaQ+LTkBP87Guj7ObYM+jQy5Pjn2mT7QCfo+ZwuyPlEf6T4iF/0+S7ecPomexT6kQ+E+MtHIPpA8rD5Rwg8/LYDKPhdKRT6IP7I+NQ7vPpd/8j4qwtM+9hAiP1EwFD+ShOI+5lvgPg=="
        ],
        "moving_variance": [
          "C3dcP9O0PD8j8rE/APOCPgBT2z5Cq30+2BSRPokSoT4LCCE/JYgJP2CsOT4RCos+kDQDPqJE6T58xto+rpOTPmL/pz7lLwo/37EtP+VnkT9QJ30/wz+zPhCp0D+IdmU/P4UbPxJb2j4Fiww/fVDwPl/C1j7aL70/j5jOPvAQrT7izi4+k9PoPvabjj6xCEg+OtV6Ps2QtD5UowM+YID/Pn7Gdz6jDAc+3FqOPgFnZD56Zbk/hPmWPhVROT/Ser8+UIJbPq128T6CZH8/c7vbPgxbxT49DKI+dnCQPgCpaz6Mt04+wAb7Pl/DXz8Hrlo/qOwaP7IPhD9Y+D8/U48MPw=="
        ]
      },
      "batch_normalization_12": {
        "beta": [
          "Ex7lvXajrTx7NjM9TXsovXRPQDsDURS9Ub9APa6mj7yG5XA9U25UPQ40Yj0H0ZO7Uz8KvpPWi71DkW+9PHkYvfg1vDyAo8I8t6+nPdqYWT2R1a696N6OPRSjob3n5kw79tW5vPOjTz20Zga+25yMPfcWlj1h3SM9tskjPQubGT0NnE088/IgPWVvGD3Izye95yx5vfssmTz3NL89n4B5PXDnDj0rIjk8UUR7vYRj6D34Bey8AMqTvNHK9j37Ps29JO74PeB64DyL90A87BPRvSNIr73DHxM90lvAPYwgmL1OzAi94yXNOomPcTw/HjI9EScwvapWsLwUyoY9TxiVO7fnNTxLZ4K8j+OlPKbgRzyIqic9VRksvDI29j1TZe29yWalPdl9Ab51CEO9Rz2gvZ0NFrwDPWA9thMGvKZQdb1M3gW9+rE5PbS1nr3CgcE9ACMsvY8Mmr0FJI095NAVPiWvuDzJo808J/+CvdtEr73/6rw8EGN3vVSJ+Lw0TIi9Si2wvajZHL3kkVG8AxIZvVb0r7xk4167U/JMPfi0PL1SxtU9U6ZjvVMnMz2Vi/K8MZLXvMeTZj30hRo9+0FpPRXHIT3Ublu7mZOwPX3i2L0eZKw7XaRnvYgfvb2TR0C9sMeTPe/mCL0wWOs8RR53vbJh7rt5yS68VisrPCVeUb0="
        ],
        "gamma": [
          "AS+KP6V/dD+lIYY/1lJuP2g0dz+BN5M/q65/P7smcj9hI4I/1tJtP3/oej+n7H4/H/yDP3Q9ij8jHIY/UsF8PzNEcT/OO4A/x+RsP/Y1hT8ZHow/vgB7P/0Qhj8VuYA/eBp6P/TlcD8ag38/WRtZP+4/fz/9YnE/+gh2P7M/cD/k/YE/BqCDP7ANeT9gKY8/d9SKP5z/gD93q4M/AcqDPxmCcD/gCXc/0K6CP1ybeD9uR3w/8814PyhWez+TIos/dlJuP9/Pgz8g73Y/pZB1PzxUjD+qm4M/Hg57P8gIez9zWX0/7IZ9P/0YgT8i4Gs/cU14P4E0fD+z3YE/RteAP1VihD8hnoc/TDqCP0g1hD+Vb3o/8/mAP1mrdT+sIX0/Dr2BP9s3gD/CNIY/nvp/P4u3dD/nEIM/bK2BP+vfhj+bfIc/v5GHP3KviD9rVVs/j7BxP+f7gT+mu3o/M1l1P2Nzgz+wcIE/KeCCP7f4jj9KJnE/QAWDPxNmbj9V9oM/1XJyP4BZgD/1KX0/qbmJPxxGjz/40IA/gLt1P16Ygz+uiHM/OIRuP2xQcT+BSo0/6UFoP9NpcT9JUWk/p1WAP8B3dD9AMIM/wFxiP7ULZD+FRHo/ZwSFP36JcD+THoA/CrVkPz0EhT/IO34/OPaAP9Huiz9FPYM/JSKDP3VlgT8="
        ],
        "moving_mean": [
          "YRk+P1eiuD6k2Rw/7SoKP0fBLD9GUyk/jgecPix/yD6Gs5M+oKllPlm1vj70MxY/nkwMP2uOKD+YAzs/jeHXPm4h3T4lw4w+oPrhPj/I1T44fAk/yTjgPsP+ID/XgNk+kdoGP8cAIT9Eehw/gTMQP5eGlj7bWCM/ygsIP5d1Hj9dKXQ+0PaFPmOK/j4N/E8/eANMP7l3Dz8QARM/CLHhPqTV8T5DwtM+9GkZP5mjuz5JO8k+G11AP3J3wD4W4OQ+1GTXPoDQmD5t/j0/q24zP/Y8Iz825ak+MgfIPiMHET/h5rM+vqpnPgKRIj+n5qU+Er3BPgS0HT8r78w+i69HP4n7Iz7Tl9g+I19aPy64Kz+DuyA/lXRIP+K2nD7xWL8+jskTP2a74j6XB0k+BwSFPi/xwz51e5A++zoPP8IhFD8tqMY+S17rPmuc0z6lmHY+mHgjP1rbMT8cCis/MjiwPlopAT/npL8+MyW8PhUgYT8zfto+rrY9Pz8gNz+uj7E+otvYPun4AT+3Rx0/kTghP73kAz9BXGQ/CQ8KP/4eTT+3Hho/SD4dP6bvDT/HpBU/Lzn7Pgp0yj4G9xQ/x2K1Pi2hDT/UjHE/RirrPu/A0z4sJgE/Te7HPnqrlD7ld/M+6B0RP9nc/z4UwJQ+SCQVPwAKAj/MxCM/vjknP3U9MD8="
        ],
        "moving_variance": [
          "MBVUQFsA8T5nYbI/IbLKPtF50D+pSitAASf3Ppw8DT9ZKKc+2mLKPjDXTj9eqpU/oQeQP4LtAEC8w09A75IJP7FIGD/bBNI+NG6jPli3UD/QHdU/uyYrPxkNvD+evSk/KL+RP5B0gT9HbgFA6AmaPtBJkT42h/8+bHtEP7HZuj9YTsE+lF3RPo71AT8W03FAo3hwQPbSkz95uAI/tvIAP3gIID8PRME+NY/MP9OPoT64yvY+EQ4dPxik/T7Mwp4/GWfNPlM8AD9R7DU/vmSWP71ME0Alt4U+EVKqPnUf3T59+zI+7U00PslkOj+0O5Y+QTUEP0e4rD+4c8U+dG05QAUxQz4QfBU/P4ZWP4/umD/zuPQ+F505QMEwbz5zp+c+RkwhP7B8KT/rz2U+n5O1Pv5p1T6fHr4+mckaP42o1z/j1zc/y3JgPxxDHT8NNW4+FBYBP+KXvD+DvwlA9PsxP4V+Rj881ys/MIgQP1NC6D8mzRM/Z94mQEltEUAM45Q+mtYpP3wbSj+UNA9AsBQfQNL9Sj9pge4/VmQAP6OyiT9Yzzc/IaU+PxQjvz7YOARALvCqPvguDD9z8+c+O3OsPjY5LT9X96U/hKIJPyJwlD5i5Q0/fjQbP7MGyz7h3dQ+SEUQP1kAXT9zgo4+ckG1P76a1z5MYL4/R8I3PwgYPEA="
        ]
      },
      "batch_normalization_13": {
        "beta": [
          "0o4CPZ4QSbwuJuo8FOokPnyuL77YRKk8sTyKPoZV0LxI+Le9OcuGPn1YPD0uAzw9JNQFPl3t6b1eESW9tbYXPsft7rztm9s9QmyTPS90vz15GKU+fa6MPuQ3hD7gZoK9dUCfPsDVjj4kE5I+IjMDvYy0Jz4Q9Ci+v78CvoBDgDxo8S+94WdFvm318T0WnRA+cmm1PCrk0Dx0P5k9yGkOvjy07zwNNze+Lk89PhLMVz6kSdY9Nwkcvu9h8T3SsZ69lNZGvoMQTD5OR9m90o/lPUvDdz4WAJK9Hjukvc2PnT2DKb490IKDvIHBAT4HZHI+v/cFvlT7OL4WGTy+d/JLPjKfeD7u3Bg+f7KpPr/BvT2r9C++J1YsPVO/PL6AkRW+0Q6dPPLDczyL84w+XUl8Phu6rDvn4YS9KJgbPs3gozz2K6M4A2qBvekfizzotUW7s+lqPqOYxD3n/pk9WTK9u7on170y7B++eaiIPoflMD0aSs49puaxPb/yFz7TDho9zP6Sva1i8z1Tn2A9BEAEvRfIoD20QG6+W2qgPQq/vb1mdRG+s91wvWduyz2qzHW90ghAPb4RvL3a1gw+5NOCvWyzMT5oVSa961w2vgXKSD27GA8+sRgcPcpe7z052bE+DkupvVLyTj61aeI9rigtPOjitz4S9gs9aU57PRGs2T0X2pO9kslVvVoK2TxPCkk+mrAvPmWyvz3f36s+y/qcva79iD3cQYE+E+1iu66+T737ass9yRePPn5Zgz1NnAU+0d0NPtqMrzus/Bi+uPIavhAIBD44Fqm9x0lmPkvY8z1fLBk+PLC+vNFioz5ItgM+lzevPfVO6z1SyEy+AOP1vUoj+7unIPm8rsQiveDMd701uMO9tfTFu/iB2j363NY8NonJvCA4pz6WADk8giINvghYQz305CS9Gof4vWin7T1MTR69Kk7cPa6p4D2BX069YJHCvOnuVb18eZg+SrsiPgmMEz5weAu+4nvxvXItfL5z/ms+oBIhvo0GST5D7YW9",
          "Ls5JvgN5iD5EDVE+F00lvoBooj21cpc9x4kFvsvR0jwSRos906kQPuuQfb2NXWw+ln65vImA5j0CKJk8A345PgNiDr6nMv89EK28PZugbb03jV07srN8PkrftT0JgCU+o7AiPeq4BT0guEY+n5bKPfUdgb0Rr5m9wzjdPOm5fr2ORYW9J1QtPeVfkD1EtCS+atFQPtRxmD2JzIg+2b31PDVEgr0oVqS95hKaPm7I0z2WHJI+tQGIPsRiVb4Rwp+7HxW+PJQQcD6vFAK9k60DPtSGxDy9MOE9bWz+u/QOeL2e4JI+y+5DPrr15r2rc7M9NfLTveqZtj133Zk9C6J6Pg=="
        ],
        "gamma": [
          "vTtGP439Rj80pkM/qfpUP0M9Mj96c0g/ithIPyliUz+vsUQ/4vFDP2wfTT9IBFY/P7lcP3B/Rz/AJFA/FDlHP5z+Tz9ONk0/2AZEP0LzKD/wTi8/9I1OPxaLPD908Fk/+Z5NPwz2UT9Al0Y/ti87PzxGND8VjEw/QpJoP6hrQT8nuT0/G1RoP9mDSj8kNUk/eBZEPyvKOT8s9k8/471NP0/OQD9+3W8/NN5BPwwHSj+ffkQ/if9RP3pXOD+7G0A/KJlMP9gkSD9ioj4/urlSP7N3Tj85zj0/QHlGP4+cUj9rKjU/tB5RP0k7Vz+Dfj4/R4JOPzZ0Pj/4OVA/32UyP8VfMz9L0Do/Lrw1P4igUD9ID0M/V/pAP5/QXj8o1jU/bBRLP17eND+O0D0/m+9PP88IVT+k7F8/UQdKPzHZVD9ppkU/XT9RPze/Uj9CdTk/kc07P/sRST87Dz0/ojJNP63uUD/fXlo/3e9IP3a3MT9DqUQ/NzdeP0s9TD+ZiGY/YEVJP5zORT8kb18/RzdcPyVvUj9+tjU/Td9RP+WnVz+zlmk/D6BfPwkXQD8fRTo/DVphP+DdTz+SMEo/ldg9P7LYKj/rZE4/UFc6P2MzWD8XJUM/md9VP3LdOD+dME0/zFtJP6mCTT9YSWI/0Us/PzXxRT8ADys/BC9JP71qSz/I5ko/1vJYPyQ3Wj/mFEQ/unFEP4YJVT/rAS8/1RI/P5DyTT9/XF4/VYpAPwxdZz8KgD0/1KQ6PziOSz9AzUY/tZkrPzL/Yz/VT0o/5IJPP03AVD8reio//0hJP8vtYD/NvU0/LnhgP7LhND+AfFU/ZOhKP69HOj8qSmc/tVM4P/FiYT8aUE8/r0lhP8gKWz+0+kA/0sRFP6ALSD/2904/DyJnPwDOQj/+vEU/hX9lPzKzWT9VYzw/5FJVP2JZOz+6yE0/EVZYP6lTMz8meVA/GgZIP4+zND+YlVI/qasvP+s3Sz8e3GA/PDRXP4h/Qj88+kA/DipOPwgfQj+gwkY/",
          "PehCP5SSUz9Gf0Y/WcZNPy3qQD/T8kQ/SFxHP5lIXT+fVEo/kqlCP4h8Qj8K1Dc/NUtRP34eOj+GP10/tltQP/xwWj9aEUk/3vA3P1MpSz8I6Eg/pV5TP2QgMT+Nk0E//AZEPxdRSD8PGzk/fJY7PxWgKT8V2z8/cTNKP5orWz8/LEQ/XVRUP+XbTj8LHmM/TBpUP5gDWT8Po04/apJBP7/nUz9GzUs/+9VFPwm5Rj+OOjY/nls2P4YCXT+pY0Q/MkxHP9i3RD8ltE0/DIhaP3KHVD8gUj8/S0FaP5XTLz8+lhw/b9tBPy0VVj/p2FA/Ep9hP2exMT+xrUY/g8laPw=="
        ],
        "moving_mean": [
          "K0ktP8YW1T5oECM/RGQBP1wGqj8XFQQ/CDoaP3NFWD9bHow/SxsUP8maZj9+gQg/L0N9P4IPCz8QymA/Q5IxPxuzZz/Y1uw+iCRKP+BRGz8JlDg/WI3wPg1UPD9Pkk4/OFJIP+lIHj9ywE0/tSU9P0mPMT+aMyI/SGmfP+uCVj+vlHk/dQkaP070gj/Cqh4/O0YUP3i1Cz8yFnY/+UEbP33j/T7YzZ4/kGg7Pxw3Fj85dCQ/hbB/P3U/CD//hZo/QnluP1PWJT8/zDM/NtpBP/4kQz95oiU/VtYFP1aMAj9QPmg/skhuP/pMMD+frBo/AOsjP3GXij8OEnI/F8UOP6w/FT9G0yY/9sn4PlRe+j5M0LY/WK4WPwd+/T67ShM/obiFP/KaKT9+jSM/ZbaUPjkURz89UE8/FY4iP+lEVT9lzf0+/r5CP1NCZz/sqSk/GvsZP3+Ykj8Q5rw+Q301P5WBKz9zG20/7qrpPga7fT/ePBQ/1SRfPwQC2z+mL1c/f3NbPw/UED9UlhM/NH5uP0Sgwj6xgpI/vxENP4MzUD8ElVI/Xa6iP6TM3j52WhY/s/KCP99mQT9M6Vo/P81NP+mqRD8Lp2E/TQFOP7LoQz8WGpM/hhxgP0WhcT8insQ+KG6KP4faXD9SHRY/L+8VP9urGj9qAiM/INtzP8prLj+AYV8/HblMP9TlOT9kmqE+ZTMAP0pUIj8BvUs/QzRKP2poJD9VmUM/Fw88P4m/dT8QJfY+uWwlPwBslz+21VM/OiImPx6SYT/Taw4/5huGP4T9Hj96WiQ/e7ozP+W5Tz8P5AI/mg2EP7evwj68TU8/x7w1P+IiRz+4+B0/HlsOP2NEOD8nVXs/fvNCPyBOdj/+7Rc/rpGXP//KHj+2UB4/WoJmP/xn+T6mREI/n+liP65hRT/YN2o/ofROP5vvHj8WjlM/mJGWPzqYPT9hqRc/fEJvP4atgT92lQw/kIsjP1T2QD/9eYw/u+ZPP/tAbj8N07k/Wu8RPxjqAT/QFxM/",
          "mMFCPy23MD8muz4/XJSzP83KID/DYwU/pbOIPyDWPj9u/w4/dKsWP3WyWz/uV/o+FgCPPyE4/z7WqRg/7K3AP9xibT++i0Q/v/0XP3RJVz8uR0I//9QPP2GN7D7jrf8+IZd4Py6nhD82xjU/97IJP4D9KT/wlUw/8gOJP8XBYz/Esxs/wMxQP2t+DT/7CXo/571kP6Mxiz8IbDw/9u1oP4BKfT/cWFk/uPcRP+PN9z6+UuQ+/h8cP2bagT87gQ0/WI18PwP6FT+WBAg/E65wP5SqZT86eQw/lXRrP11pcj/Z9T4/5xIIP8NqSz+Q5Gk/Kt16P2xcND9EAR4/sWJSPw=="
        ],
        "moving_variance": [
          "s9DfP3ZNTz+S7ghAj9LbP+YsuT93Jvw/UwMiQKAkUEBM9K9A6sQTQHYKmkC82uQ/YdmgQDQs0z8VuApAcN3CP/rMk0Csxrc/xNMxQLnDcD/7mNM/A+r6P3efaz89Sy9ADrVhQOKtNEAU9EdAm6KCP++SlT9V2CZAGk0RQbWcU0Ds1whAXVgSQDC5xEBO8A1ACn2mPy/HAED43KRAt9kUQBlMpD+UVRdBOy2PPz15FUAmeW4/qzLKP99rmj+wnpE/E9fsP2lUCEBkWc0/Dy1gQKMSGkBsLRRAxAfOP6d1zD/q7EdA1Q83QLmdPUCD9Nw/8C6oP2gnqz/hxAdAQADzP2yA3D9Mp88/p9b6P1p3RT+0BQBAGrO6P829tj+geoo/QUfKPx3PLECmfwVArVg9PxK1cEBdaYBAyLwfQFYN8z9S0uI/vfaOQFlzuz8aBqs/45x2P6e4rz/kAFs/2lRGQCuEZUB4mgZAq3JSPxyRhD/6H70/X4qVQFs8GkBlaodAXadHQHrM4T8PgQpAAdSIQKk7hz8Jn5Q/ovN9P2x7gkCAZYdAuIwYQWaTaD9kCglAyTplQGMgJ0CeaGtA4GDlP8F5KUADD9w/+mc/QKLzN0CGot8/fEqSQNABoEAB2Lc/dUEJQAy5U0BkzdM/XmPxPw9klT8zKwg/acXQP9fE9T+0Id0/IulcQHxGtT8W0RM/9W2vP1+3IEAjiJZAsCo7QItuHEBUgmhAjJEFQJqFrkCySaY/Nda9P5ezBUCIOFFA9NbcP93dkUBYr7I/8rasP2IFGkAIYYs/C2XaP4DVgkAetuk/3efRQI15UD8j3W5A5ME2QLCNPkDSHA9AUC4gP5IcOECDeZRApi1kQHzUtUAy7SZAsIDUP4z3yD+ziRlAYrGTQPnYqT+Qcfw/EjmEQBt+a0BU4ApAYzPHP283gD8yQUo/6G0jQOL0yj8xIgJAIeK/P3D5gUCCagVAZ+kcQJkVMUBAOe1AbNpdQAmgTkAjKA1AkuchQM7y2T//OHA/",
          "w+ieP7aHKEAj+TJA2OIdQFhm1T9XFLI/rTt1QAthXkC+xFk/spivP2Iqoz92i7A/IPfzQJ9Yjj9qBQ1ArujtP6u3qkD1LDFAQnCiP40Qnj+EYLw/RD7EP3H7iz932Yg/Xdb0P3oJzz/tHwVA2fmYP6NpRz+Ibeg/bXnWP/CRlkA48ok/ur1DQDDWBUAjVbhAHXc5QPAh6UDr21FAptEmQOjxv0AHkB9AzBobQEaFyD9Ibto/0m0HQDSmy0BRE4Q/FlyXP0apB0CKsvk/vNurQFnXnUAAaPg/rVigQCYSLEBABd4/NnutP0Kxlj+uF6VAnuaiQNdpxz88S/4/V6hJQA=="
        ]
      },
      "batch_normalization_8": {
        "beta": [
          "rY0xvRdMhT1leLc9KKvpPX6dUD3IfRi9xTWcvHE7Ir0="
        ],
        "gamma": [
          "jGRyP0GegD/InnM/JZp9P7WZkj/WHXE/Hs5fP97Ejz8="
        ],
        "moving_mean": [
          "bMdgPwvW4T5oom4/GenFP0rWkD8IFtw+2a5GP849Nj8="
        ],
        "moving_variance": [
          "vvfOP+LzRD9ssCk/KHDdPwPwO0Am24U/wdxZP4ECgj8="
        ]
      },
      "batch_normalization_9": {
        "beta": [
          "ZyZ9vQWwGb3Nw8S7R8kfvPjhT7zar7G98PqDPVEsNTzlnIw7jrXgvCPxJL4Xpxm9WfSpPXqoXDxo+bE9T4enPQ=="
        ],
        "gamma": [
          "s9NsP+DhjT8smH0/khiBPywVgz9xjIE/BbZoP6x7gD8g6oI/AzF0P/3GgD+fCG4/Uld5P5f9bT9tyIQ/q4mGPw=="
        ],
        "moving_mean": [
          "ylhPPgdb2z4z6Tw+MIq2PghSsD7s2/89L/38PrfutD6SiEs+g3DaPs0CzT7OhPQ+tarIPo+Soj5jvS0/94yjPg=="
        ],
        "moving_variance": [
          "hAcQPpXyhj901QY+c29FPoaYvT5tjsU9sZ5iPipIBT4Erps9x0wrPqOkHz+ZLZU+93AOP8v6Gz5yf7o/3EshPg=="
        ]
      },
      "dense_10": {
        "bias": [
          "9+xuu2ESmrswaKi8HLnYPKUMmL0whk27lzT+PR5Qn7z9ITG97cyPO0TenD0uema9Xri0PPeohj3TSpU9wuaAvbhlyjxjmuU92jHNvP/lGb3VjOq57tUFvfFBJT08pyG+GP81vqQB1rmQ5x08BEYQPet+zLy+Xue8wegAPfTdUjyNwqm8KEHQPKtv8zyOPeM967kCPh8zML3098E8WCMePFxU0Dy3DAs8EgDyPJ+Pmz06Is+9qs6AvSIkJrzphzM9320DvGVboz3n4Zq7L+OEvZB6M72qGwM7gTzZPLAjwr0GbLE9umcDPsISo7wjlG294DTKO/Q1SD0QVJ+6TOVuvQ=="
        ],
        "weights": [
          "vpy7PK8ysz7HH7I9yRaXPWrrxjs/sLw7vvcHvtI3HL59qQo+gU9XPuiVGb5j2WE9wKwHvl3aUL3Q+HO+ZfI6vqTrkDzbVoA78/yIujrhgj5FyaY+//9tvh3edD6Rmuc9N3/cPJodVb26cok9kL7wvJLMQ76r4GE+jMM2vmiafTxOrCS9GM2KvMyVjD6wG6q+E/8gvZDKN767n7W+CQmGvvEDJj59vIs9rPoavtyeSj04pIA9MpLRu9Z3+T1al86+h3SBvqqoVr2hii0+qsEOvrUGmr1V89k9lBPFu9wkqz3U4n6+pRa8vW8PtL1C7C4+2rngPaTEMj6BVKo+oJhBPXG32j0nQOy9vChGvNqqkj1h4049vtA1PHuJUz0ys9u9cOJyPlrXyb3IUwY+ZLaCvj3sdr3dt7278nXCPMX0fr58LAm+0hcuPrC5hb1fmEo+oAeOPK+mub1okau+WlqlvTtBGD6Rany9c9AbPtBVYT5oYHe+hDqXPL2azb2OC2S8+uiQvbj3tLsQiq08h/NzPWPxyj1hMR8+Q/SgPVvikzzUlTc+ah5HvOtrZr3NZqy9M5ZLvdhWdj7JMJe8seEHPlNGTj4qRBc+KGyRPbP4lT6L+2W+1yuwvJIBgz6Wuas+Q+puvonOqL54iIG+gt+KveXO/bus1Zy6tCQevnErOj5GJpM9JROfvrGIX77pajq+E0l/PoNnNL1G7Zs97SiXPe83nryI2xy9tfKHvk3Crj2Qaua910shvd3aDryUfUA+vGbUvPsCC76YGqO9+7DCvT98kr50D9s9aL4dvsVSh74dytI9Ez4zPjaRJb17TIO+NoMSPun8TD26oRI8zVm/vTKIFz4EODO9jFlAvkPhmj7KQzk9weE/PXLHkj4VxHs+AYoMPg5VQz35uhM+xto/vv1E8jxYkBw9LaMvPh+6kT6oqnY9YW9nPRoEP75H4ZE8gVKBPTTJkr1cNbk9QOCevo9pi77OO0I+kbS2va5BgL7l1Zk+cHU1vsZSo72bhjG+",
          "hq+kvrBe170uZIS+TKG3vcqyMz5iAkO++iMnvmLxj73JqGo9jKN3vq+Vrr7hy+w9db4pPv5tab6lXuO9npuCvq89DT6HITI+GHY0Putbdb7che+9wPPpvVV3D77R6yU+pvuVvR8lPL6r0ha9z4NNvhSVVj7ShDC+k+WBvlLBuT1y3iu79QWZPvaRSr55Ckm9wMHAPfVRsD1LPCu9Gv4+Pc4tlz61SeI9vE01vVtXMT7cj/49tvn2PY5ogj5mDBC9zCiZvY1u/j2nOlK+0weOPVhScb1aFf08MlDzPMYwBz7hhiM+sfUDviRwW75hKiO9uoixvfh9e74pgKA9ZLElPgz8wz7C1/g7hbtFPivVQ77B3Xu9/hL4PRVRNr0Iwgs+AUOwvRGZPb7xcR6+/oKHPfvvA72MpZG+Ms69vSa1bj4cB7c9+gIUvlIgvj3InoY9UWE1PcTutL1wAYc9uvQYPriXoD4k0+y9WgEMvjDLLb7YJnY+GjY5PpfvDr4C14Q9wx4WvbtScb4Dp9S8DofuPU/S3r5cj8m8NuOyPG9fRb05SRY+5h2kvSqdyTy7nEi9w2fGPvQPg75FgPE8/b3Fvsj8xTwVcGk9c2SCPve1Fb4eeRk9OvJ9vSj2Tb3Bqwm96uM5voWZvz7rKjM+6fSBPmgRAz6jBj89qeZxvbm0I73dAji+ZzXZPertpDwdJlY9ruRTvojyFj2b0ys+MrxGPtrZDD4DDg4+C+8gvizvozvRIDc9zeepPQUHST4b8ZW+WzZbvqJhbD51NCO9zeFgvlK5pL1aCyC+JbzxPFTAC7z6kUK+upG8PkYRQjuxbDc+RmQJvYcqzL15Fqa+NAUzPoWpHj7VvqQ+p5xsvpdSmr1Snya9scoqPmIQeL3QgdU9rEZCvRwCAzxMmUy+F8A3vrh8g74yypS9wsvyPYVAUr1Vvzw+nJXWvE1bA70zdqq8ycdovSGXmL74+zE9awJ0vd3luz0rb/e94+QHvm8yGb51fhu+U+3/vAgJzD2DUYI+",
          "E0QSviHi2z2adSo9WNVRPvS+mz720pU6U5Z0vgaQ0ju76KU9V4gPvjWli7x1Vv898EjKPBUsZDpOIAm+TYguPpi6Tb7dx4Q9YWuOPbKwSr7O49o9KVZLvhj8Ur7NoGM+uZ5uPrCaub3UXA09RXUPvovDl70BV969pVEPvit2qz5JQwK+51nYPEEQpb1sYzK+x0IDPnZpqj7JGx29GKTAPaMNKT4qrAg+5xx5vQWVeT3ljma9xqcGPRzWkD0kmqE+XobOPY0D7zzL/Te+RZDgPVZy3T3K1zO9qPoSvmM4Mr675DK9/kzQvWt1Dr46mak9ukJxvnR1hr6L15+9+c8oPgNXDj7kfeS9vApxvAWG6b2jWWC+sIapPdu2Lj5lOFS+GGZpPj5N8T3aRxE+GzCgvebmQj4GY5M8EPTBPKUdlb4OK0m9gq+JPdLjPL6qBjm+bmM3PFlSn716oZI+QqOAPRb6VjxXd6i+765Kvk61MT5doXs+NGPXvcp2E74+lRW+i4p8PdyTbb0oCKk9cBwHvozQpL7ajQ29Kg6FvYk0nD3IHI09gNspPATnEz2urTk+0MVgPijg873znGM+QjO8PZX7LD0Ct8881ZuDvpp/Vr0LrRw+mxPfvbOr6j258sG9NzQnPY4Azr2buEa+MlMwvcWCZbx0HO898E4wvgoaBD6H2yA+SUSPPXhDlb6oUzw9ujbcPIwOKL1Ia/q9+xvYPe6zSL09OpK+wgeLu7lCUj2R2oI9XUYtvv7h8L2nnDc8ZZN0vUK9ZD2pViG+tHWGPnllTb6CXSS+2Ik8PUnDL76kxio9mCjoPRKugj0O8Qc+RyWOPULhKr5lwnM8We9hPdaW9zwGPFU9wrE0OmHYED2QZos9RzB9vhrtTTxPDMY9WWnxPHwb5LwPamw9pYFavuyKoD236zI9rkGLvZYiRz3HpZs9wmycvvx2h71WQiA+5aKAPbw0w71eLsQ62WfTPZZnPT3t5xw+tJXoPeX+Cb6hB3++cz5aPhucCbx/B1c9",
          "GTCcvki5r72/Gxy8VyCxPezkBj4pCqa9pCCEPgSHZztJqWI9ULSUvTNwhz1VLeA9Ti8ivr4FqDyvDlm+FniGvsq4Db1f+Pc9BVnCvW95gD6MWmq+CmJsPmb92701P+O9SVM5PvpS1r1rDxo913tQPb0Wprx9Eh0+65Qkvnr93r0usPQ9wUT5vVCNT769hGA9TyUnvlfbIb7GhPu9zxqsPBPhO768rWS9auZLvBRkeD77KL49Q4SjPgVbHL6EAxi9ThokPWpaDT6QX+c9a7mJPbketD0kcTs9XRlPPRcDiL4IQuI9aA9WPkqroT4Umfg9PdwNvo8TAT6Hppm+KAC5PTHYxb1+3Hy+ss0FPgZDMb4r5Y8+jbuePS21J75jw6490vshu5aldT4gPXC9l98EPiJNQL4JUPA9na2oPc9daT7NmOE9jEARPhUfH77djBK+neHwvbkqYb6MFiq+LAkJvhgtOL1WyOM9e9RYPuqJnDznooK+IftvPj7zub2NqCy+VLKFPhD8V76hmiM+DsDevYWlJj3vFR6+qgR9vcIsHL46vKk9zqFWPna2jT7K1e683i+Nvo+Voz7EkGo+C+0BPlT81T1HbAI+nskgPY3sHz7Hlva9q2iEPMERJL4fSZg9pWQLPpPt0LxuEpY7lMKyvgBVyb29b2U90z0TvfWQoL6ljg49+DhePfsZqD3yQao+JBtTPsEC2rtl+WG9OEYQvpFIqj79JAy+li3dPRygxTtMya2+VBGVvaNQyzzdlig+MsejPZjsbr0pjIC+Jr+LPqo0AjuqSp2+eM5HO30lMjx4T78+eMsHvsMzgD07lQW9tp2NPudxJz5w24W9U4AOvrxRnr2j9xe9kC54vncOXj2CMyE+smY1PflvF75ACK68PTmbPdn9jj2+Gu098v2cPgNDZT0g+us9jR5PvMrhBj5J/aG9WPFLPfITqTynJyE93447vWtVZL5zKsY9xH71PBmn2T27dag9yRUivnTNhD4odBy+Ino9PQCgpT35Pze9",
          "yXObvPl2QL71sZ69XUhmPUhrZ7sWRgS9hkIXPsKM1T1E9QC+oj+gvpkUN705aTY+0jXKPSaopb2Cl50+Qb5Gvlr3SLo63709N9+SPUb8wDyhyru9TTsdPl6Ypr2AGzS+ZBrOPazbrT7fJns+S9gWPdee+bypzgU+CDuzvEGchz7YoAi98dMKPkDMED7Oqa+7i0Y6vEhDb72Oz4I8MzZJPTTugb07zk+9xGA5vp/fOzssTJw8J6PTvfKwYL1fxE++VCEovgcRRj4D8QW+ICkMvqi3wz5bGli+09GTvTy8IbynipC+itISPneJcr2XriW+AlsEvqRb0D1mIuq8OeqxPTsOWL7bomk9BnhtvvSNLL7ecui9Wi4aPR13KD0Ul/Q8qBk1vu1EiTwqgwM+6xzrvTjMlb1mIs++KwbYvPHbHjv7Fko+R/XePUNw8724Sho9KLYfPksWKL6Wuwa+eSukvVVdtL3Tw4s91qSNvoyNkr5P5cA+FkHLvVWs871vAyy+j/WOvp/7qTzcNei9LaDFPQdvYL5ogOe9kCHHveZHVT3Iva68d/OvPSCNKT1n+DE+13ldvrYLEbxMe4E+qAlzvpWjkz6cWr8+ZtIrPi7glD2ofkK+18BWPqdYqj1C6lk9pQclvhsdbL4qdbI98AaGPdCPzD3TloW+r40NvZia+zx+U7S+BLaxPnPtFD0F5GE87q1LPLkJ7rw0ihC+0CMIPoTLtDyemwY+sxWWvc6EPb4wUhA9bbpHPr0VnjyKjK68gEpSvA/zJb3cQ1k+vMkHvDDahj4CFkW+g+E8Pqo0gr2SWMA9EeZ0vhSxfT47UKI9pqzlvQQhm70KJO68pr+Gvk8Vhbvx1jU9CevRPfR1M74DN5K+fEXcPec9pD0vWYo+EuWMvtn2Yj4JHCO9ez+Fvkkedb4t/uK9KJ41PeOkOL5IN6M8TVRhvq1raD1uTX09KkhKPKzhcL5CTX0+05T7PbW4kj7n5pI8Qze/PPn5nb6tMoG9pDKqPfQfczzK0EE+",
          "bgQ2vh18cj1mDUs9MTYJPWiakz2omD++qy0yvflMCL488aI8oeGhPT9NwT1RFME9kYMdvpNnAz0isRm+tjZzPo022rxEfGM+amcVPcaRMT3o/yU+pSaGPicT/r2+1z29TWz+PXHMxT0ymn48QuWDuvZ5yT0ixMy9OjOhvSH2SL1iJzG9M6tavZYEErxyWha+5A2HPV1AQr7VK0g8+ojdPYMZj758xbU+8FF5voJQCj4H3pY8Gv8rPJZaNz6s2YO9oC90vGp7gD2s8xg+L9WlPQPP+b0Hdg29f6EpPgUT+j1x78S8E2mRvd1eU74mmtq93J+hPDWwt72ki5q+NlpJvrKbrz0EswK89vDmvH1djT6vjA49xi56PauWdL7oE6S+arDIvKUWAL7LSaC+cHNkvvRHhT701NY9yRjLvacaiL5FMcy+FlIyPlOIb75tgCW+Md7nvHRnb72j2UC+/Gr4vcYKIb5Wcxm9i0SWvld7fT4Bm6k9idwvvFuOaz6EZ6S9+hMQvfx2yz2VBRK+FX14vltqB705UgK+PM4pPvgneT18Iom+dGpAPhZJQ77SwK+9UD4avloDiT5csC8+ScnjvXMvtL1Utby9OYRMPnefNju9B2k+3t8gvoD9f76lIOE99+WyPh505T0YY/k9dsVWvlh6g7zeOJi9sv23PamRVb7t30c9JeUFvmSglz4YQqQ9MKVUvdePHj3Fo7a9oh4EvXEZ0r0DIdo8ASckvtjWfL1NBIG9dkHWPWTWCb6CLWa9RiuvPpvM/b2h6kk+9GhSPn2Qez6B3Yq8DhJOPjG5Ub2ODBY+o1gXPVMxhj3TrhC+Ff6ZvoSbWT6vV1S9lZsdPhukuTxGKAy+DCSQvXfXFb6RFis+918KPi6MXb0zN1u9pQp3PYll0z0G3pq+8IuxvXN2wz2pMhK7zmyuPmxVA742er297lugPnSUvj3JzJC+WBJHvtJdQ77BzC6+j9upPfdZobxrtKi8lhOFPoT9yb0F+18+Cx0sPSDEYz5SKLG7",
          "GT0UvsCVqj2NJfm8A1IuvioegzvCKk++4G4Gvl6ezr1Mpda9PeZOPdggEj7bQ2S+83ajvLLUmL0LZwM8CIKSvR7cNTv+z5i+GCUBPtK5Kz7ALHI+QJ1Fvk0szL1kbDI+eLnrPduqfrymCay9bL0svWRXsb4WXS0+a3u/PeHGgL5uKZ49OQYqPmQZ3b0A8G47rPFQvjL+gz6WH2M+znmBvjX58j3IjTQ+3AJlvJcbAL7ISpc+7D65PMcZ1z2IeEM9Yrv0PQwKlb7ZR8c96Khlvkpp0j19fVW+r7ZHPZ8OIz3XbJY9ov8VvUzLgz6ljw890OWgvSTK3jvcjws+7JTYPQOr5b1tYq28wofCvMy0tL0zHa88huAevhYubTravlg+e7OkPWK4oLwAZqe76YnGvTfVHz0hR28+SIa6PWapM76lGec9hHNBPsiILT63ioU9fS7bvW5Kgz6+CM09hveqvjFndz5si3++yoKtPUl/mT0nhBk+xVtAvsefmr12WOa9Xrw2Paa6PDyrrpe9LR5hPpIU1D1KggS+n84QPj44Fz71TA0+iH4tPU4lWT4V0Oa8f9KevVGs/L2jyYG+6vPYvENeWrxZqS6+MUUWvl9QKT45pJY+rAwNvuNylrx8qDc9Ec+IveiWij311Qy+0D4UvjTAor7DnEA+csdsvujb1r2MWbC90tLLvefyxjv+myS+QMcqvohsR76vrla8UyAevoLiYz0g7oi98TgbvJiCfL6q6kA9YfbevfoHMz5JcQ++07efPeRYhDx6T8K6D2KvPbqEgb283iy9YqGxvc6MHj44U1E9eAqMPZlk3T3nry+9NWeWOz3I2z00YJs8EJBCPRzyY75ubIk9hrAdPoz40z3UMwu+24l8PTZEq720J3S++vnwvQ8ATbxHpC+9mGwuvnvpQbu6kIa+aIkUvalDeT4XKWK9izObPULiHL71BcA+9aSRPRMqj76NTRW+8J1evGcRfD5xaac98uWsPvcERb2HVYk++lGBPlmJcT5f/Pu8",
          "7cdKvnO32Txg+QK9Z5YYvpyV27v16R0++Ba/vailAT6VvCw+cmGyPo5X4D0t7BU9kgggOnf95z1UIiW+jvBvPsCwjD5l+bw9vr3DvRQbh70lWSi+uKImvL6XPD5yK0C+DmucvqS7pr7t2oK9byTFvU8dHbx+DVU9JB15PitXgL0LqdA9aLlIvrpGTL6yIYc9vqE5vpU1mLwo7O+9Mq/Nu3lkh70JsQy8BwdFPMb0C769z7w90TcZvlc8KD4Egoa+cJsCvmkh/b0DmRa9hRWpPRB3wz1S/3G+pno9viFfQj5GKS4+/6+TPm+0LL4oYcK+79PyPCdWcb04GrU9ynztPSKQCz7nnra+qdMHvlxxIb3ea349URAxvpjMbz1PGSm+bgcdPglEv76EPQ281iltPiuNkT7T6IY+BConvfMkuz10J2O9WQozPaTYDb7W7rO9h4QCPSq/BD7Ri5A+EddlPYWS370kZ5C+WwyJPXV/4T2Wd26+MjOBPaeUDr5UjnE+BMxHvGj5qb2ikYu+YHkNvTbBA77/aue9EgdtvgyFLb2pYtA9SFGoPWxxkD1ikCg9AI3OOztEIjyDX3q96BB3vpkHGT6/KC+9goPCvWw4Nb5nXeu9J/I+Pp9EYb65i8A91seNPh26270kBbS9ksrOvWn2IbrUwaa+w486vrTb8z0TEJO+04FYvgMZHT0g1ji8eItJPo2ALz1XdYA96XaEvvSDpj22OJS+7KKsvZq5ID5MDCG+gzR2vtE3jj4kzMW95fAPvtiitryEDeS9zzQ0vrtJIT3RlcO9ubA2vSLvY77Nyuw9ZEANPHdVSz6N8q6+wQ3ZvTTm5bwhsou8xHy7PcFUMD4Z6RS81CWVvcdPar1QAAA+SSvUPWwJdb5dvCI+YZIyPtq02r1T3a69nJjgPe5IFT7+OJk93VbcPXZ3Jb6+u2A+yxlovN7DKz6FSWG9qq+4PlZSUz1VmCG+/RUHO38bFT7nHle9Vl4UPlM3FD6Na+u9dDSWvtwBnz5U3OE8",
          "ZHYEPCASCr71yis+1WtAvfYuaz5WHno9tqKuvas/vDxszgg+96C5PU0/lD3WfFg+TCVgPcB2nr2Cdro9G+4Dvv7b8D1banO9muTyvT9KZL77Mpu+nb0Xvknlvr1Y8Y29qFADvuDIFL4jk6o+7nH4vZwFNT08/my+cMGuPQr00j1r06E9QuAOvRlvyzwgX6K9eBzKvRSuij4e4Zo9zMvhvRfqL74AJyi+27o2PlreQD6FYto9mv8vvB6HUD6sAIw998M+vvMFxz7x+um7ZHi0POSspz0gg6O9aP2rPjHrqz6ZqTW+gwC1Pp+JkD6N2o+++Zn5vRECqbxLPgA9gHooPvOMp76soxU+Ssd2PqzvAj5zr5u91deFPvutmL1Q0xE98F+OPTj1qL588/29EPbBva9hCjwkO7S96PwqPZZuyj0RhTe93/9yvo18ML0QQ0m9YzwsvRXSBr4MRIC9ApITvkHwiL0vce093x9jPR6sWT0AmZe+JZKdPeTIybzlSjg+U3FyvfzbTb1enly978qAPpjkQ76F22s+M+ToPdYzfr0M4rq8PxeGPVU4RD3muH69wHi0vQd8Tz7OJ+a4pc19vZgA5T0hdR+82KUmPTvZNr7LRVK+uRO+vZn0GL6GzuQ94pG/PU21ir5vjWu9qK6KPNLbcbw5Kgk9iiF/vb0bgj5CPDU+TlTWvJmQWz6InlO+pGDLvXQjGj2MLJy+zSlNPQvFG76l9go+FeMSPoGCdz0hCas9Q1X1veeV7T0jzLq9kBI5Pnj2I76DiWy9TfJzPRVNQb47vGA9ZysCvgMExL1hXwm9qYwZPbFfbj6Etzi+6swnvWZFVLxVjiI+8DzlPd/ReT4i2Ro9DO2sPlmENz5uD0i+hLRhPscI0z0mOzS+EeIOvp6u9T1jU4q+UgzyPX574T0q0C+88OS7PNZdVT3HAoE+g03Hvbt6Vr5P57w9l0jdvWpvsr3Y25Q+BPM+PXadIr2yyKW9p6txPbMViT2a5J28HNUZvdpo0r1Ro4c9",
          "1YOVvYZIEb75fjQ+2MtJvr/ypr180uq9tJqQvsI6hz75+zK8CaCaPSSkaj2+oyE9qfnHvbtAOr7PPRM+E9zQvup2L7yttFA+nkdnPIKbDr4KoK695yEtPsNf7L3H0nC7qk4aPbF/Mb1DddY9W4hxPkSgyzyMswW+r4Ipvq+QRz40Lmq+o+PlPpcXS745p/c8c2WrO0btVj2/Nam8DK3BPpYpaT4Fjds7zwojPW48Yb25vBa+AhlTvj6TDL55Pg2+QDRjvg34Db7pL0E9gN0vPa6gwz1581k+fHDSPV56Bj4appY9f0RaPsPS/b0okou+zyiMPX9BA77Udce94LwnvlupWj5tVqo8pe0ZPt+ngzxQHVM94pBkve4sG70PMaY9V4UNvWhG8j0esVi+QqiTPuFjPz4DKbm9TIlGvdEfSL6WpBy+mK36PbaLwj54dIs+IdbGPI8cYbuXXJs+q2EIPgtQ771j3am91eoNPhlEuL1o81G+d6g0PSoW8LssVMS9tKOsvsluXj4ayUo+BLBTvuVgzL6zgmY+qEMmvr7MSDx1ze68s0ynvSyXqL50oRU94P4evfmMPTxB12E+4tZ3Phi57rxNnU4+JtWivPA6nL3i9t699eplvltdW76TQhc9j6glvlZVIL7prBI+MO8wPstCWD2KjIw+6bxJvclNhz6mwWQ9N6Atvpd61r0Nz/G9PBe+PXGbeb1oj8m9Q/xsPnhSEb0dJC4+jJl8vc0TybxOKb89TEQEvkcn67wE3oW7ke2sPX2XYT0DXH69z1lvPM0OUTsOg6A+0QEePlzWFL7Pmmc+fgYjPubhJT79xfS8bESBPmLQA76d78k9/aSlO7PIKz5tW0K+NAksPtP4uLzYWhe8VJ8tvqPohbyyOSq9qHU2vij7jj6iSyY+dX0PvRogM774G4E9dEsoPYyFTT0zKF++zbwfvnn4Yr6/UAA+Qjw+PtPs6D2xqCk+76kFPSYbd71QAGG9Mu47PlTZpz2sxQO7nBJDvW66lz2RcEy+",
          "EQd0PcV0oD74ZpQ+rA8Bvsg4FD0CH4U+tMeZvmHLaj2n2yq+0QJAvURtkL5TK9g9jhuEvfj7vbyuESE+ow+BvYDbxr3G2Ea9PC7uPRch9rvcYCw+cxxhPfPNmD7SgfM9SGnSPXW5873T5zA+O7M/PhXuAb5qZhM+almKvBsjQz1wbos+tN72vWLXbL26f4I9Zu4GvkY5db3qTWs+ZR8fPkM2h71+16k9nWUbvbLH3b2CHgs+fxAtvnlBvL0vGT2+ZYrqPCvUvT2bcBw+X5AvPhR/uT0749m9EHIaPoMekb2ZcyQ+oR4iPYBhA77F1BM+o0+IPN4MCD4jHc+8XWqcvsHHxj4y7Xg90+RpPnDSgr1VeYw+HL0kPu8/8r2B4Zc+s0SlPPxebD1Hdhu8xKpDvobRST6c8/69gTdkPaimRj1ggY69bE9/Pae+/709Baw9biIPPpA1kz0d1sU9pw1JPmGaGzw6k2e9UUUbPh3HBT6ic+g8OfgePkyUF76oj08+EErzvY8qbz6+MJY9I3NhvCFB6r07NAW9ueeRvQrw/z0iiFU6szspvBgplT7NxhQ8cuAePhPkzD2ELR4+P9fuvR9Jiz3skQi9DluUPog2OD7lA688u2q6vhMUBb5WVj++DeeqvHYYmTzeX0G9xOcdPudRiL3Y43W9knliuwAjhL4="
        ]
      },
      "dense_11": {
        "bias": [
          "tgNZu972kL3BBLs8uKzMPDiAvjxI7KG98NKmvZqwprwDKWW9H+CjvbFroTtNGWC8HONpvKfX9jxibYK9G2Zuu1ktGjzUvwG+QFnMPcDxw7zczC+9dE7tOp82qT1aTEO9/8kKPSotfD1xM4a856DEPI5G77lA7ps9Za9mPDmHEbm/WkK+HEH2vVUbzj2q27i9mpWTvVkPZDxza6c95hz6vGGHWr16Hr48pJOWva6/iT2I5PO6pwD3PTwW47ogAse9V7tOPaBHo72wxh4+M+JCPURPLbvjQoK928D3vDvozby/MyQ9mtBivqANaDtGLw297+ABPZbCQDzj4vE9ZLqyvAFENL4VT568ywWGPSVHGz2Y0Y49BXaPPd07uDwklxi+B0RoPdJD5L1wfw++qRXDvc45DT2Huq29zNaTPVkS6Lw25bw7j5mjvT8nqr0s1Ai+yaw6PhRIQj2KCkw9UoKhvDZyEL07WR+9YRBUvRDz7bwhQ987orQIvQzChjsxb0c8AW2AvOQLa7xZ5eO8SIhwvfsKlzweZxc95TpZPXkCwT2Qd5M8DsdtPcmUnD0QuaC9l0oQPuwEBL2iEUM8suwwPRlUKz14KsQ9VQ6Jvcqj5T0jtIY9hiRlvSO12rxH+mc9U309PTZtBjx2Bm29Ioz7vB0imTzfEnI8IMB+PVokur0="
        ],
        "weights": [
          "iFrQPU2hlbzq9Rg+oNT8PSTZWD1Dn2M+T5OnPKV8Zj3pm5q8N7LOva3gD72PXf+9ykLmPO6ZyT1ltg8+M7CTvSV5gL38I9+6HJntvaLvTb44dwQ+zVlyPeiUXT1dcvO9d3B8Pgppv70ijhg9JovtvARuX720Bga+BBEWvSK6az46Qze+iiUDPYGd/zybuT0+1DfDPaH6Cz68wdY8KNAkvtW3FL1G40C91HYFvd6Ior01TB87u5SYPemrpL0BsKE9oXyIPAE0eDwKfja9tSOVvXFzOD6UXno8n9uvPSAUZj48vRq+w7sYPRs6TT6IGZI81CSyvIPmOb6dU8o9hLSHvDbFcb5gdnG9y6+1PZxXqL09W3Q9yIoNPjlPOTsb0/Q90dcrPrGvVLyhUzw92gxKvllLXL4pZRC+eICMvU7xED7V9qm9JtIAPlwFJL7JDE898jItvuwmiD2wloC8SKhJPa34xruijxe8kaYrvehaBT5mU5u9SjFRvaGqc70k24S9Tx+hPc1MoD0bplg9fOmcPjUl9D0bLjs+ypa8vdInSb5QN6s8w9chPuKpYbwqcpM+mtHXPXRVob1cy+e9qj4hvIx+hD3BOPA9GZC/vUx7oD1eCyi+qAoevkXxxrzOzGs9iveqPZY8hL0LKhO+gJU9PikUUr17ltM9bBE5PeX9G72Ex7U9uCLrPb7zdz2aJ6G8zI/YPBbGnT5oRkA9H1aFPRBrhz3WdW69KmMEPS+HPr7l6Zo9LYo7PUrwCT7jkwu92avzvbC4DDw1Jp6+2O3fPFsQAz5c/du9aOAgPs0b8zxpRzM+cmEEvj8Njz6bEBK+dWcKvoACTr5NWzi+RRG9vQlPubxa3jG+4T/3PYAIPz53CsY9l9sNPponB74MCzE+3dTiPSgyWjwYvAO9YV0mvqcaNr5DDsK9HOAcvmWymj2yhdm820POPABoVL2MnT69IrBVPdr3Rz6Set49gaFRPkqrlz0ehf89DjDnvWNAnbuemUA+vCKHPaAOO75EH3e7",
          "iuCOPTB7Yr287fG9+DucPfhptb1L46I+rEc/vtUfnDyoEse96faPPBg9O70ajsg8loQjvtO+ND1TLqw9uYVlPh/jAj6SlnS9FAsjPh6OKD1NFlq+LKAoPUd2CD33meK7j8nqvJC7x7s7aTu9YIIlPieq7D3ODhM+FoWAvf44azzC1m07Qm01PhbG37xDotk96FqoPbcABT6acfY8pjp5vRaofr3Zs4K9Ecslve7azT0zvZG9bV2gPQx5Uj5LPP88j04PvmXGBr7M8uC9CQiBPXI1hr7Tsys+EuNgvUhbbL1rOD2+23TsvT0+uTzgXXS75ExJvQUjdT0Gtsy8oqRuPjjVbL1nB6u93G4Fvm4d5T3t6Mm7/7aBPC8TnT7DXTS+YiWVvY/tkTu1aN49xrXvPdKoLj50/Ae+/cJPPrUGnb3mVni9b56RPdMv5T1K9g0+rnjYPYVGDb2Oo3a9KdtgPQpwpbyb4949FEqtPeBoE74Qtga+4oKRPcH8QbyLsgY+5m92Po76CT6shK87LXvmvenQML1A8T4+5z6JPJ/AXzw6xJY96EOVvYNJDb5EkTu9zcA1PcAdtL0rhac9eqJJPqhch703ozI71+QePluTy70l9hE9Ng8bvjT1kDx6Vb29S/wBvhgt5z3IYRC8X7iPve2IKz4ej8g7CjkCvtIM4D1pcOs9nAZ0PYckH77urwW+Wbi1vYZGyr04s3m98B43PUyEg71HMro9VRDDPRDSC75amgG+XIwFvh3uCL4LRk2+MGDiPc7eXDzfmaK9+bGgPHE/8j1HnAs+Xv2DvBAn4z0n83c9lQb3PRQ5Lz0Ashk8FOqivehavz3v82i9vn3dvVy/u7ueT/c9y1IRvh8H9T08aIq8A+c8PoSprb2Vbqa9KQ0qPbEgd7206sS9nXQ+PVpbGD3Y9hK+i8bOPH8zx71OcVm++pBMvZ/Q9r0wXyw9WftlvEvQ3z2el7I8WP/PPIjUNT7biw4+kU2QPdC/Qb10NEw9ZXHOPAUrCj6zUL+8",
          "fNW8vc+nvT3uZRI+HMUWPZmpYL6SQoS9WQL7vQHB8b25mvC7GvuzvHviMr2HUsm9tyDVPQTgKD3uWdM9Hu6XvdArVz3Emug9NrQlvTR0WjypE8c8cybjvNL16D3fIWa7rV42vrhGLr4fBN67PAqRvQKOBr5XXgs+UOtzvb6WTr6ntsk9EakVPgy46L0pYxO+Q2a5vTqtP76PwQi9ki4dvLK60L2vLxK+Kn/MveSEO76wyQw+XqQrPRm8JL7GAcQ94moQPZ5jc7wpe/A9U9mDvdtM5jy7ZmW96nFGPgixLT33erc9burDvNOAYL7dUU696WHFu9/+AD2S05G9CQpOvvKnV75OwDM+0VCDPa556T03v6G9AM9OPo+svL28Tp476tFCPlAFtr0e/Bg+C9KdvQsg1b254mA+ThiCvTe4ubwZeHy9kSMRvPnG6D14SsU9l2rtvWgK0D2wzhG+z+rxvVPf7z1xCxk7QNjSPLfRPry/I7E9cy0aPBrpETvYL9Q9ogDdPHdtbD2mHUO+mhXWPMmajL3WC8E9uCQCvnLLNz0r0aE91jatPTinoD1ZVwM+HNTYPQmrgrxArSg8p8g8Pbcc37zprx8+4/TEPZjE+zzDHNA8k0BAPGd+Gz2jY2o+6GYfPtuqOz4i45k9pR4cvDdJTL50EUk+8N5KPh1LBT6USHq9xnyavS2h/73UK4K8pesQPS4P77uMdJS8ZNNQPAp92z0rIw0+e2vkPBZ7Jr7vthy+REKSPPwuYr1Rzoi9+3QxPocI3b3WBwe+DpD9vbljMT5KoGo+wdXcvZkdobvUNbm9tEYgvVFhFb6iaf09YbokPvcTKr4azSU9ZqLwPcXjRD7z/P+8NG7wvMwCO76jMlu+uheUPLhlHb6rc0k+dW4jvkOZwz0aC409/pdKPrcCGL27ekW9SDcsPqXfcj3ZBxM+1USXvZlpbDy0MgQ+bgyFO4AIkT2MjFm929PCvY7K1j1rZwa9QDwkveCfzjzLiQS+8uIdPnys2T0tUiK+",
          "A6k1PrK5Ej0jByo9rwY4vbWaMb6k3vy8y1k4PSkStL1lnIq9zkmVPZM4YD3QKww+wfLfPYnw/73M7Rw+GTgCPin4Mz4zn5q9KD4hPowtE70TV6c9dMHCvX9qSj2vxg89nvw6vVajxD2t0gK9XcDQvdaXGj5TFx695IIvPMlbIr1BPiI+AHWbPXf84j2b8Ui9ofa2PTgepb1aeSO+JDIsPZtSXb4nXuG8t6oXvXgmkD1rrA69rt85u2WkOb6NPZ67X2GjvYr28T3TRx89nKyRvSYcEb1mNtg9CaIYPt4TN71ydkQ+wd9lPjVkZT0/Fgi+Me6KvYteT740oQK9cieOPfVRMj4Uigs9StlCPsP86L1wJeS9NCJKvM4QKjxC6lk9LNFRPZqsMT7pqLw9n9Ecvd3oHj5xoCE+eJJivQ9deD2YO+A9kgQWPmnTXLwYpKE9haILvLlSI748gAC9Mnn6vZ6ouD1dff89xVwPPhbq0709mRQ9VaoDPXMcVb0WWAM+jmS3vJ1cwD0Siqg9LyDaPNos8zxTb3E+NMNVveHkFD7d7xW+euobPW6QIT2s/a49A+mBvUvEab3mvS892EcxvrT9kL3qEzk+77j6Pd36Wjz0pkK+H/yXvTtowr2rai29fs2evWuErT0PCwQ+F7oAPWhmTjw70cI9tXcYPkLJFr0M5EI+hFKFPehTSj0VSwC95YR9PP0lDD0NFxQ9MfVSvtsZMj30iCM+VVzTOxYEWr3OiKo9ZLCBPVo9lL3w7Rc+pclRPrtgDzwwMhw+p5khPoq5tr3hOXQ9CbUZvAlaMD6zQdS8N0IHPl8R9b2IqQw+++EJPcPYwD3KPPy8TVxcvbmqN76RL5M70OrWvD9PpL0b/AS7/GEtPkn2i7soICq9PoAFvu5MA77rdcY9K1lqPYsF0b2IuDi9vA1kPR6SoLw53lk9VFyDvuUDQb4s+FA+ttYLvo4t/T0DDpq9wr0sPilpDL5Mz9i9qOIlvQFZvj0yT2w8Gd7Pu5D9v72meDA9",
          "N34KvuAjQj2x91m9cHL6vWyrGr5N14G95bAYvhmdJT5nYiS9ZvYdvXTcLr6743y9XKmRPddwyb0g/dI8yuU9PhwsqT2MC2a9YDXXPcZJFDz0ywO+1iisPa16Pb00nUC+qzYEPkyWAL7LONG5YcBDPsUiQb7vhVE+1JK/Pc873LyLrp69SsElvllDg7tBII68PyG/vWce3rzh1d69L2pSvobzFr5prhQ+Lhc1PH/DeT1fSfu9YALYvTSaib1eaCs+HiL+PKeCK74G9589b46uu1uFaL65cWm+bRVLvudn4r1fhbk8nVM9vspGI77vmks+q7bUvPBp9rxiUWy9Erh+vZGdLT3Zf/886ZCFPcRqib2MifY9OidGPpM4kr0kgKq9/CbBvSSjVzuJe4W8m7DyvT7OIj7mMZk9BfImPjLSDD7XaWg81CIwPZhKt72sIsG8UWY/voS9Ub7UlrY9pDtWO5UjSb1HYvy9mpUXPULDUzzBQ8w9ytxRvLavF77FzVU+dt/2Onvp5b0MaXW9mgNYPWSHIL6AzTo9IC2ave7rbr0cRRa+/5bpPYHchD6LolI9YzaIvZi8kb3AgUq+A64aPlyF+r2tric91lMHPlrcWLxfP+i9/lxGPbEfWD5Xpcm91y08vkefSbwO/+I7LBbCvPbtJD6NjQq+CT/PvdmZ9rtcoQ49+mjzPWexuT2j0rk9FdQbPn+J1L0QJEg8KSkHPouGHD4fZw0+MMwzvaPzJr1Fjmg8eNicPXhq77xACIO96tmkvMlBRL4nxEa9Eksfvk1FLL3JPoM8tWiNvmUalj0g0wu3OG9qO7dRyL1CScU8kD6LPWaQA7608pY9qdTXPe75a73Mr2880zHTvMeour30ViM98GAAPPXLV742+FM+Z+TTPSrRer25Eh8+8FxOviXwQb2p4gi+FuBOvbYazD2iq6s940sAvbPqXT5xq+u82+iJPVyKyDyHRug9guncvbVa7j351Ug+qXz6O/Jgjj1racC9k62AOhkIIz2Fc4w8",
          "9OcrPh0lPz5ICL6+8a1VPqp7vD2Kb+a9BtWevTYNh706RFS+zFaJPcgo3L12Ck++uaU/vpv9I76/pCG5VB0HvkqoJLwIlRo9AizhvbESJz7S7GW+/zZMPlmexLt1wme9quNBPga/Nj2CgKw9IWdCva4fZD4tq2I9D62nvWgOsL1F2TY8Vk+OvJk297283ic9LMSlvYYLzL1YwBi+xWFoPZeoK72M90k95+6vPc0HDz5pVvY9bd5VvtL/OTweRci8MVghvl2U4j1Abyw9FSIbPYy8QL6c5+o9AS/2PLNhzLtKixM9WZyePeL3FD4ajRk+Ln4Bvt7GWb7wFkW9FfnXvRWXBr2nJ4M7hN78PMTqC74ZN0u9zqsZvTuTvL3v5uy9ElYrvcQM9LyFloE7aEKGPUTMLr3RSZE9x4idveWR2jxv/AG9+VE3PsX7zb2Rtem89HZKvXSN1z0V85c9eUNvveei073HJQo9l0rLPSqYhT3crQq+WhIKvvG2JLyT42++xbemvXs46j1zUSc+SVTluqqkTj5athg9bJQhvtnJ+Dwy65Y97LJ4PXO+GD7Y+ZE8P8sWPstwwT0bLce9/HsTvuwY1LtaCOW8Q75bPPnzNz6/A/K9DfQNPjNajT2KxJ09PnSEPQIbjL0W0wY+k1FAPRgnOD0si649krKwvdMH37vfxuC7jcrqvYVKVzw5Qqw97nbjvZyLAL4vJKm9H90+vG+FgD1MuTI+CXYZPYBNcj6YzlM9vL9qPd2x6j035AG+9rtuvRfUOr7ASfU9bkZMvU17mj0gU0297KD/vf9o8b1vMR8+ZBoBvq9DTDyiQ0C9BY7WvV3iI768svW95B4dPc8Ttz3px5E9SKNuPZKPODwgbqg9TgiCvWj95jy3xgE+5WhRu2DQar5Cj2U9d9TSvaGtOL5bHjU96e5avv9d+b2Ds6O9mMiOvRUiGr1eiSc9+SUUviK1P74W+Tg++mpGPj8N6LzBWWe9hXENvSOnpb3c/tU8RFyCPQCOKj1yOSm8",
          "QLNqva1QKb48mDI+Pt2FPbu8kT4rd8o9jn9uvRSEQD46m2w8gx//PY5LPr3B0Xo+dPmPPV8igz3Odz0+TL2BvQLMFL4JSga8ImaZvUL2iL30GZs8gYVBPSjiyT2yhfg9WF+7PVh7k7udCSU9AOQivtkPUD0EzCO+VprXvRi0CD7Umxe8sOoPviqYTT5mCck92kjBPTgawby6fQs9pLaQvI6u+r1cOGU9riy2PTptWT3Tf+694+vaPcLvsL2AqZg9fhdsu9GAiruZtYY6nto9vq7aNT3Lgo4+abtNPASrQb2Ycgm+jIGeuzYR4j09KQ293g42vSlbob2RVg89rrVUPtg3jbyLD18+8TryvWYTo7zOlmW8RqwUPmnMBr2xM/Q933YGPjTZBj5gpgK++J8/PVUdgzt1ZDI+kNMjPgDgvT2u/BC++MJbu1ZUOT6Xxz29fWafvZo88j32A7U9RAM3PmJJCL1Sdvs9r+YPPd3NMT3MuRM+/3O+PbTBAT26bpW9qKUdvie74j2AkHA9j6EYPjTAzz2NNGw9IVAoPl0war1hr6y9fcL0vXlx/jyi9Ae+jgYtvrhDyz1jAby8MjTzvadN8z18I5S9tgCCPSeyHD7atLc9SUHSPE7mb72RfdC94y4jvmZXlz3t6kQ+vUZxPWt7Mr6OtrM9m6UQvSXbWz5Y4AA+Bakdu/JHoL1yXxq+OidZPTQCob3pyoA8cCUkvhzg8b3jio09uswNPXvEb727GQw+1yD/PN3ZoDxr/0W8haoTvdExYz0I3G08FvF2PtmuhT1HFSA+s3jUvQOOvroICkA+j/+Vvc1h0L10+Bo+ok4avEBO2r2rA+k867x/vQmvKbtI8yW+RO2fPXl+gb2Brw49WBzOPeTCzbp1/rw82kn8POwaC74wUjY+DczavUGl8zyFOoG8EYIiPUfgIr4TRqC9Xn2EPDZ2yr1iFEU6xys4Ox8Oob2U3X2+CvNUPrbZyb1UZcK9EWldPUjNjj1MfxA+v6H8vQoKZLypAJO9",
