{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Functional",
    "config": {
      "input_layers": [
        [
          "input_1",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              4
            ],
            "dtype": "float32",
            "name": "input_1",
            "ragged": false,
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_1"
        },
        {
          "class_name": "Functional",
          "config": {
            "input_layers": [
              [
                "input_1",
                0,
                0
              ]
            ],
            "layers": [
              {
                "class_name": "InputLayer",
                "config": {
                  "batch_input_shape": [
                    null,
                    4
                  ],
                  "dtype": "float32",
                  "name": "input_1",
                  "ragged": false,
                  "sparse": false
                },
                "inbound_nodes": [],
                "name": "input_1"
              },
              {
                "class_name": "Dense",
                "config": {
                  "activation": "linear",
                  "activity_regularizer": null,
                  "bias_constraint": null,
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "bias_regularizer": null,
                  "dtype": "float32",
                  "kernel_constraint": null,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": {
                      "seed": null
                    }
                  },
                  "kernel_regularizer": null,
                  "name": "dense",
                  "trainable": false,
                  "units": 4,
                  "use_bias": true
                },
                "inbound_nodes": [
                  [
                    [
                      "input_1",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "dense"
              }
            ],
            "name": "functional_3",
            "output_layers": [
              [
                "dense",
                0,
                0
              ]
            ]
          },
          "inbound_nodes": [
            [
              [
                "input_1",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "functional_3"
        },
        {
          "class_name": "Functional",
          "config": {
            "input_layers": [
              [
                "z",
                0,
                0
              ]
            ],
            "layers": [
              {
                "class_name": "InputLayer",
                "config": {
                  "batch_input_shape": [
                    null,
                    4
                  ],
                  "dtype": "float32",
                  "name": "z",
                  "ragged": false,
                  "sparse": false
                },
                "inbound_nodes": [],
                "name": "z"
              },
              {
                "class_name": "Dense",
                "config": {
                  "activation": "linear",
                  "activity_regularizer": null,
                  "bias_constraint": null,
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "bias_regularizer": null,
                  "dtype": "float32",
                  "kernel_constraint": null,
                  "kernel_initializer": {
                    "class_name": "GlorotNormal",
                    "config": {
                      "seed": null
                    }
                  },
                  "kernel_regularizer": null,
                  "name": "dense_9",
                  "trainable": true,
                  "units": 8,
                  "use_bias": true
                },
                "inbound_nodes": [
                  [
                    [
                      "z",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "dense_9"
              },
              {
                "class_name": "BatchNormalization",
                "config": {
                  "axis": [
                    1
                  ],
                  "beta_constraint": null,
                  "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "beta_regularizer": null,
                  "center": true,
                  "dtype": "float32",
                  "epsilon": 0.001,
                  "gamma_constraint": null,
                  "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                  },
                  "gamma_regularizer": null,
                  "momentum": 0.99,
                  "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                  },
                  "name": "batch_normalization_8",
                  "scale": true,
                  "trainable": true
                },
                "inbound_nodes": [
                  [
                    [
                      "dense_9",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "batch_normalization_8"
              },
              {
                "class_name": "Activation",
                "config": {
                  "activation": "elu",
                  "dtype": "float32",
                  "name": "activation_8",
                  "trainable": true
                },
                "inbound_nodes": [
                  [
                    [
                      "batch_normalization_8",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "activation_8"
              },
              {
                "class_name": "Dense",
                "config": {
                  "activation": "linear",
                  "activity_regularizer": null,
                  "bias_constraint": null,
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "bias_regularizer": null,
                  "dtype": "float32",
                  "kernel_constraint": null,
                  "kernel_initializer": {
                    "class_name": "GlorotNormal",
                    "config": {
                      "seed": null
                    }
                  },
                  "kernel_regularizer": null,
                  "name": "dense_10",
                  "trainable": true,
                  "units": 16,
                  "use_bias": true
                },
                "inbound_nodes": [
                  [
                    [
                      "activation_8",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "dense_10"
              },
              {
                "class_name": "BatchNormalization",
                "config": {
                  "axis": [
                    1
                  ],
                  "beta_constraint": null,
                  "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "beta_regularizer": null,
                  "center": true,
                  "dtype": "float32",
                  "epsilon": 0.001,
                  "gamma_constraint": null,
                  "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                  },
                  "gamma_regularizer": null,
                  "momentum": 0.99,
                  "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                  },
                  "name": "batch_normalization_9",
                  "scale": true,
                  "trainable": true
                },
                "inbound_nodes": [
                  [
                    [
                      "dense_10",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "batch_normalization_9"
              },
              {
                "class_name": "Activation",
                "config": {
                  "activation": "elu",
                  "dtype": "float32",
                  "name": "activation_9",
                  "trainable": true
                },
                "inbound_nodes": [
                  [
                    [
                      "batch_normalization_9",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "activation_9"
              },
              {
                "class_name": "Dense",
                "config": {
                  "activation": "linear",
                  "activity_regularizer": null,
                  "bias_constraint": null,
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "bias_regularizer": null,
                  "dtype": "float32",
                  "kernel_constraint": null,
                  "kernel_initializer": {
                    "class_name": "GlorotNormal",
                    "config": {
                      "seed": null
                    }
                  },
                  "kernel_regularizer": null,
                  "name": "dense_11",
                  "trainable": true,
                  "units": 32,
                  "use_bias": true
                },
                "inbound_nodes": [
                  [
                    [
                      "activation_9",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "dense_11"
              },
              {
                "class_name": "BatchNormalization",
                "config": {
                  "axis": [
                    1
                  ],
                  "beta_constraint": null,
                  "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "beta_regularizer": null,
                  "center": true,
                  "dtype": "float32",
                  "epsilon": 0.001,
                  "gamma_constraint": null,
                  "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                  },
                  "gamma_regularizer": null,
                  "momentum": 0.99,
                  "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                  },
                  "name": "batch_normalization_10",
                  "scale": true,
                  "trainable": true
                },
                "inbound_nodes": [
                  [
                    [
                      "dense_11",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "batch_normalization_10"
              },
              {
                "class_name": "Activation",
                "config": {
                  "activation": "elu",
                  "dtype": "float32",
                  "name": "activation_10",
                  "trainable": true
                },
                "inbound_nodes": [
                  [
                    [
                      "batch_normalization_10",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "activation_10"
              },
              {
                "class_name": "Dense",
                "config": {
                  "activation": "linear",
                  "activity_regularizer": null,
                  "bias_constraint": null,
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "bias_regularizer": null,
                  "dtype": "float32",
                  "kernel_constraint": null,
                  "kernel_initializer": {
                    "class_name": "GlorotNormal",
                    "config": {
                      "seed": null
                    }
                  },
                  "kernel_regularizer": null,
                  "name": "dense_12",
                  "trainable": true,
                  "units": 64,
                  "use_bias": true
                },
                "inbound_nodes": [
                  [
                    [
                      "activation_10",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "dense_12"
              },
              {
                "class_name": "BatchNormalization",
                "config": {
                  "axis": [
                    1
                  ],
                  "beta_constraint": null,
                  "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "beta_regularizer": null,
                  "center": true,
                  "dtype": "float32",
                  "epsilon": 0.001,
                  "gamma_constraint": null,
                  "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                  },
                  "gamma_regularizer": null,
                  "momentum": 0.99,
                  "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                  },
                  "name": "batch_normalization_11",
                  "scale": true,
                  "trainable": true
                },
                "inbound_nodes": [
                  [
                    [
                      "dense_12",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "batch_normalization_11"
              },
              {
                "class_name": "Activation",
                "config": {
                  "activation": "elu",
                  "dtype": "float32",
                  "name": "activation_11",
                  "trainable": true
                },
                "inbound_nodes": [
                  [
                    [
                      "batch_normalization_11",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "activation_11"
              },
              {
                "class_name": "Dense",
                "config": {
                  "activation": "linear",
                  "activity_regularizer": null,
                  "bias_constraint": null,
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "bias_regularizer": null,
                  "dtype": "float32",
                  "kernel_constraint": null,
                  "kernel_initializer": {
                    "class_name": "GlorotNormal",
                    "config": {
                      "seed": null
                    }
                  },
                  "kernel_regularizer": null,
                  "name": "dense_13",
                  "trainable": true,
                  "units": 128,
                  "use_bias": true
                },
                "inbound_nodes": [
                  [
                    [
                      "activation_11",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "dense_13"
              },
              {
                "class_name": "BatchNormalization",
                "config": {
                  "axis": [
                    1
                  ],
                  "beta_constraint": null,
                  "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "beta_regularizer": null,
                  "center": true,
                  "dtype": "float32",
                  "epsilon": 0.001,
                  "gamma_constraint": null,
                  "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                  },
                  "gamma_regularizer": null,
                  "momentum": 0.99,
                  "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                  },
                  "name": "batch_normalization_12",
                  "scale": true,
                  "trainable": true
                },
                "inbound_nodes": [
                  [
                    [
                      "dense_13",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "batch_normalization_12"
              },
              {
                "class_name": "Activation",
                "config": {
                  "activation": "elu",
                  "dtype": "float32",
                  "name": "activation_12",
                  "trainable": true
                },
                "inbound_nodes": [
                  [
                    [
                      "batch_normalization_12",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "activation_12"
              },
              {
                "class_name": "Dense",
                "config": {
                  "activation": "linear",
                  "activity_regularizer": null,
                  "bias_constraint": null,
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "bias_regularizer": null,
                  "dtype": "float32",
                  "kernel_constraint": null,
                  "kernel_initializer": {
                    "class_name": "GlorotNormal",
                    "config": {
                      "seed": null
                    }
                  },
                  "kernel_regularizer": null,
                  "name": "dense_14",
                  "trainable": true,
                  "units": 256,
                  "use_bias": true
                },
                "inbound_nodes": [
                  [
                    [
                      "activation_12",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "dense_14"
              },
              {
                "class_name": "BatchNormalization",
                "config": {
                  "axis": [
                    1
                  ],
                  "beta_constraint": null,
                  "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "beta_regularizer": null,
                  "center": true,
                  "dtype": "float32",
                  "epsilon": 0.001,
                  "gamma_constraint": null,
                  "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                  },
                  "gamma_regularizer": null,
                  "momentum": 0.99,
                  "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                  },
                  "name": "batch_normalization_13",
                  "scale": true,
                  "trainable": true
                },
                "inbound_nodes": [
                  [
                    [
                      "dense_14",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "batch_normalization_13"
              },
              {
                "class_name": "Activation",
                "config": {
                  "activation": "elu",
                  "dtype": "float32",
                  "name": "activation_13",
                  "trainable": true
                },
                "inbound_nodes": [
                  [
                    [
                      "batch_normalization_13",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "activation_13"
              },
              {
                "class_name": "Dense",
                "config": {
                  "activation": "linear",
                  "activity_regularizer": null,
                  "bias_constraint": null,
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "bias_regularizer": null,
                  "dtype": "float32",
                  "kernel_constraint": null,
                  "kernel_initializer": {
                    "class_name": "GlorotNormal",
                    "config": {
                      "seed": null
                    }
                  },
                  "kernel_regularizer": null,
                  "name": "dense_15",
                  "trainable": true,
                  "units": 512,
                  "use_bias": true
                },
                "inbound_nodes": [
                  [
                    [
                      "activation_13",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "dense_15"
              },
              {
                "class_name": "BatchNormalization",
                "config": {
                  "axis": [
                    1
                  ],
                  "beta_constraint": null,
                  "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "beta_regularizer": null,
                  "center": true,
                  "dtype": "float32",
                  "epsilon": 0.001,
                  "gamma_constraint": null,
                  "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                  },
                  "gamma_regularizer": null,
                  "momentum": 0.99,
                  "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                  },
                  "name": "batch_normalization_14",
                  "scale": true,
                  "trainable": true
                },
                "inbound_nodes": [
                  [
                    [
                      "dense_15",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "batch_normalization_14"
              },
              {
                "class_name": "Activation",
                "config": {
                  "activation": "elu",
                  "dtype": "float32",
                  "name": "activation_14",
                  "trainable": true
                },
                "inbound_nodes": [
                  [
                    [
                      "batch_normalization_14",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "activation_14"
              },
              {
                "class_name": "Dense",
                "config": {
                  "activation": "linear",
                  "activity_regularizer": null,
                  "bias_constraint": null,
                  "bias_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "bias_regularizer": null,
                  "dtype": "float32",
                  "kernel_constraint": null,
                  "kernel_initializer": {
                    "class_name": "GlorotNormal",
                    "config": {
                      "seed": null
                    }
                  },
                  "kernel_regularizer": null,
                  "name": "dense_16",
                  "trainable": true,
                  "units": 1025,
                  "use_bias": true
                },
                "inbound_nodes": [
                  [
                    [
                      "activation_14",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "dense_16"
              },
              {
                "class_name": "BatchNormalization",
                "config": {
                  "axis": [
                    1
                  ],
                  "beta_constraint": null,
                  "beta_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "beta_regularizer": null,
                  "center": true,
                  "dtype": "float32",
                  "epsilon": 0.001,
                  "gamma_constraint": null,
                  "gamma_initializer": {
                    "class_name": "Ones",
                    "config": {}
                  },
                  "gamma_regularizer": null,
                  "momentum": 0.99,
                  "moving_mean_initializer": {
                    "class_name": "Zeros",
                    "config": {}
                  },
                  "moving_variance_initializer": {
                    "class_name": "Ones",
                    "config": {}
                  },
                  "name": "batch_normalization_15",
                  "scale": true,
                  "trainable": true
                },
                "inbound_nodes": [
                  [
                    [
                      "dense_16",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "batch_normalization_15"
              },
              {
                "class_name": "Activation",
                "config": {
                  "activation": "relu",
                  "dtype": "float32",
                  "name": "activation_15",
                  "trainable": true
                },
                "inbound_nodes": [
                  [
                    [
                      "batch_normalization_15",
                      0,
                      0,
                      {}
                    ]
                  ]
                ],
                "name": "activation_15"
              }
            ],
            "name": "decoder",
            "output_layers": [
              [
                "activation_15",
                0,
                0
              ]
            ]
          },
          "inbound_nodes": [
            [
              [
                "functional_3",
                1,
                0,
                {}
              ]
            ]
          ],
          "name": "decoder"
        }
      ],
      "name": "sequential",
      "output_layers": [
        [
          "decoder",
          1,
          0
        ]
      ]
    },
    "keras_version": "2.4.0"
  },
  "hash": "094db34415a238af442e83ba65fa65b4f728f1b6bd01dcc5bb201b4abec0f56e",
  "image_data_format": "channels_last",
  "input_shapes": [
    [
      4
    ]
  ],
  "output_shapes": [
    [
      1025
    ]
  ],
  "tests": [
    {
      "inputs": [
        {
          "shape": [
            4
          ],
          "values": [
            "MF8rv+HPmT540r88+bmYvg=="
          ]
        }
      ],
      "outputs": [
        {
          "shape": [
            1025
          ],
          "values": [
            "y8kFP321DD80xAg/assJP2GFCD/m6Qc/BCMFP1bBCz9ozwo/mqAIP6KYAz//twg/LGUJP0JiCD+qxgU/1skFP8ILCD/KkAQ/KGQDPxrBAz/f4wc//g0KP4XyBj+MRgI/QbICP5OSCT8mnA0/SA8NP8pjCT/GZAk/d6IRP8w8FT+Y4xQ/TiITP1AJEj98Yw4/WUENP3iBBj/UZAE/+u8CP8DOAT9l2gg/+JQJP7QIBz/6ogY/WIwCPzkCBT+93AI/NvIAPwTKBT8A1AY/EgYLPxcgED9vHRI/NeoSP705Ej96fBE/d1URPwruET+CVBg/1EAeP5tZHj9WuiA/45AgP1GLID/u7CE/sQsiP5rPID+2MB0/rZYeP6LvHj9gwB8/rOIiP0DaJD8/ACQ/6MAfPzomGz+siRw/WoAiPxJsJT8ediQ/5EclP8CnJD9GTCM/j5clP7CSJT9QOSU/TkMkP05IJD8LsCE/6nAgPwBYIj/vFCQ/ZPIlP9yXJz/Uoyc/GukrPwyPLz+oBjI/bkUzP/47ND+mdjI/hJYwP5i2MT/BfDA/GPgyPxjAMT9PdjQ/x4kzPz/9ND/SSDQ/jDI1Pxm7Lz+Yly0/wekqPxw2Jz8ynyU/2G0pP+guKT9z6yk/074oP7jaKT8y9Cs/bv0uP/49Lz+S3DA/Mjo0P/yuNT+ETzc/MEI5Py67NT8bcjQ/XmQ0P/ijND9T5DM/RKUzPxp0Mz+GMTI/lPAvP188MD8imTE/yk8xP9KUMz96DzE/7ZQzP57lMD+/PjE/zDAvP1POLD++siw/hhEnP47HJD/szCQ/sV4iP5PkJD/iOCc/NpUnP6i2Jz/SSSg/sqAoP1JoKj/g/ik/e7EnPykfJz+c7iQ/amciP7REJD8s2CM/aCUiP/WlIT9UbyA/QTchP2iwHD8WQx4/AkkeP1rWIT9k+CE/KB0fP6KhHj/t0x4/F5UeP5PlHj/kUR8/ovceP+h8HT9SzB8/nAMhP4gpHD9KHx4/eP0aP6oLGz8G1ho/",
            "duoYP/qiFz+2VxU/WsUWP8jpGT/4nBc/U3EWP1S3FD9/oRY/03gVP9TDFD+j+hM/u34SP9JNEz9M/hU/nJAWP2NrFz9u3hg/JoUXP2usGz9xPRw/kFoeP/VqHT/j8R0/X5AcP6quHj/Vnx8/f+4cPz+XHj+kxh4/8k8ePzjfHT+g6x8/4WkePwBCHT/qqhs/NDwaP80SGD+JWBg/XFsaP7LyHD++Wh4/Xo8dP9B0Hj+ggiA/SBYfP4wZHj/Eah4/xroeP0WXHz/C0x4/1rohP5HKIT/CrCM/EJcjP1DsIj/onSM/BkQnP1mzJj8iRCc/fzMqP7XuKj/JHSs/EyIuP/sKMT98jDA/3L8uP5jhLz+PhDA/NC8uPzP5Lz8ykTA/CwkwPyIhLz/gFS8/ApksP4oDLT9E8Cw/s6ArP/p6LT+ULzA/PhYxP1YBMT/dfjI/4G80P2xTMz+FRjI/vQo0Px4nMT8LjTE/Pz4yP9L9MD/7zjE/oHMyP4Y8ND9xlDM/lFc1P964ND8RJTU/3gUzP7rzMT8ukDQ/cxIyP3aEMT8mUTE/lvkvP/jeLj++NDE/O7QwP8d6Lz/geSw/SKsqP+ZbKj99xyk//IQmP4iXJz9sLig/T+snP6THKD8K4yg/SPAnP47IKT+w1SQ/bqAlP30zJj8wGCU/cPclP9ZBKD/rvic/HhIsPxZxLT+4xCw/x+kpP+IkKT8oFSc/Ds4qP2oOLD+Q8yw/BvoqPxuhKj8rSys/QOUqP4TJLD9Qiio/cEIsPwhiLT8STiw/GIMtP1CzLT96Mi8/LvQuP4hjLj+G1i4/1K8uP67QLz9wVzA/FzUxP24/Mj8OGTQ/EE80PyqSND+kujY/r340P5ThMz/iSjY/1XY2P6meNT9w/zY/ino2P7b+NT9WPzQ/+r0zPwo7Nj+FMjc/SE43P/UbOT8wNTo/2VA5P6S6OD/f1jc/Ipo2Pw4/OT8MWTY/nlE0PzL0Mz9shTM/HxszPyVOMT/ldDA/yDcwP8bgMD/U7TE/",
            "hyUyP0I5ND+gODQ/6cYyP3SPMz/s+DM/bGIyPz60ND8MuzI/kygyP356MT+lbDM/vkkyP8KBMD+oYy4/TZgtP2T/LD+93y0/ylwxPySvMD92dS0/cf8sP/yVKz9NbCw/rbIqP4ZcKj/G7Sg/SCUmP51OJj++YiU/EuwkP4KXJD9YpCM/QJMiP/5CIj/gDiE/iE4eP4yNID8lqSA/yEEdPxraHj88qhw/ulMdP1UxHD8WdBw/REMdPxLdGz+mVxw/et0aP24BGz9mLRo/GUAYP6R8Fz8vhRg/gCsXP6cqFz9bXRU/UlwTP+LwET9bzBA/uYMPP5RjDj9O6A4/bnkOPyEYDz93dA8/ai4QP6uNDT8yaQ4/+OsNP8wADD/UFww/7OIKPxU/DD/5egs/3PIKPwV7CD+jmgk/k60JP7HzCD/uFQg/TqQLP77WCz8Uowo/9u4LP2JvCz8ySQw/hf4MP2BRDT/dUQw/m2ALPwLgCD/DKAg/X6MFP96bBD/qMgc/RTQJP94YCT/34wU/v1YHP1VPCD/rCQg/0mEHP64vBT8UvgY/+7wFPxhZBT93EQQ/OV8EP1FSBD+GSQU/+zEDP56vAj8EbgA/3GkBPzMdAz9tqQM/2fACP/XYAT+bXQI/wh4CP97DAD/gOQI/ZqYCPyD0AT/xsgA/3D8BP4PmAT+6wAE/yI0AP5ccAz92RgA/NF8CP0zCAD/0kf4+7jgBP47SAD9ivAA/ZZMCP98JAT/8LQA/bmUBP0SCAj+oKgA/2nf+PptAAD8IV/8+xgj4Pt7N/T6ezP4+06X+Pu+S/D4iCfs+HNz5PsmH9D421vY+9dz1PhQS+D55tvg+HIv+Ptx8/T4Gqf8+vGgBP3vo+j6xg/o+8av8PthS+j6+nf0+aF35PsZK+z4bWfk+IFX3PsE5+z68fvk+TyD9Ps3++j6xo/w+75j6Pgnx+T4am/w+5rIAP8VV/T6Cu/8+ATb+Ptub/z5klf4+RU79PnwV/z7cn/s+uKL7Pp6R/j7V4vw+",
            "YIT8PqmY/T7/4/s+kWsAPzPV/T4CuwA/Hs4BP38DAj+v1AA/pGsAP9jnAD/1cAE/lrwBP2NXAj8JcgU/vtkFP2ziBT8FTwQ/0hwDP8GRAT/jWwU/lfIHP/qbCD8aJwQ/JB8GP+MuBj9IegY/G2QFP8AwBj+KIwY/kWwHP75qCT/SsgY/snQGP4qzBz+XpQY/ovIGP6m5Bz/71gc/XrYHP3IbCj+U+wk/u5MIP1L8CT/4Fwk/cEwKP9OKDD8kmgs/QzIKP7nSCz8XZgo/ayQLP3bLCz/n7Aw/RxEMP5SWDD9jIQ4/D5AOP6qaDT8ztg8/K5IPP8QYDz8osw8/RJsTP7ztED8COxI/XicSPy6KET+A0xE/BlASP+5mET8fAxA/54URPzi6FD+mXBM/Y5MSP4pfEz9uaBQ/4NATPyGgFD/iSBQ/MzQUP3o4Fj+24BY/IAsWPwN9Ez/UVRU/834WP5hAFz/KERk/4AUZP++FGT9Qzxc/GtgZP2Z2Gj/mnRo//4UcP74oHT+cPRs/ohIbP8BlGT/C9Bk/Q5YaP+c5HT8mzxs/Cx4cPxQ/Gz+g9Bo/xHYbP3MhHT8E1xs/7hwbP54mHD9igxs/TnQaP+KbHT+YEBs/Mr0aP2S4GT+2EBo/WdAcP4QuHD8lxx0/mcAeP1qWHj+7TR4/JpAeP6xEHj/CPh0/0WsdP1kbHz+Kjx8/5HIfP6NzHz82UR8/F8EePxg8Hj+nACA/+AofP4A3Hj+tQx4/yJ4fP491HT++/x0/L9UdP76xHj8K5x0/dMkdP6aDHT/wuR0/uI0bP5RRHD9YSBw/rXMfP4RIHj9R7Rw/z1wdP84nHj8ZkR4/1tkdPx30HD9uTxw/qF4eP6QWHT9aNxw/YHgbP7jVGz8/Ihs/Qh4bP/LVGz8evR0/xEQaP5H8GT+ITRk/0HwYP8r3Fz+auxc/GvkaPwzVGD+eTxk/8uAaPx7zGT/wxxY/8/IYP+IoFz+wLhY/D2UXPy7eGT98sxw/AKwbP6r8Gj8+nBg/",
            "gDEYP69QFz8rJxc/jmIYP1bGFT8GIxg/0KIXP1GVFT9uxBg/Gp0XP8xQFj/EuBc/NLYWP+++Fj/sIhU/hE8WP9zFFT9UARU/yC0WP9SfFD+92xI/RI0SP9HvFD+XYhM/xw8RP+cJET+2EQ8/gcQNP3rKDD+YzAw/9gINP0nUDD8yIw0/2EkLPz1CCz9sRwg/vSAKPwX+Bz9stwg/SfYJP+pQCj8EDQo/YKMIP6ruCT+IAAw/6BoLPzFuDD8GPgw/TlMLPyZQDD/d+gs/UksKPxWNDT9rqw4/3AQQP6adDz/U/xE/oJ0SPx1JEz/gXRM/7s8TP0hqFD8gnBI/zXURPydpFD+MQRQ/UQoUPyw8ET9rmRI/mv0SPwYlEj8vrRE/aqwOPz/hDz+GEQ8/qI0NPzEaET/JUBE/meoQPyxEET/iJRE/J/4QP0xLET9qcRE/SCYSPwK6Ej8xOhI/5ZYRPxOEED8c+A8/V84PP/2SED+HRA8/8/0OP2EYEj82IRE/VlEOP9JwET+66Q4/9MgOP/o7Dz/Txg4/XrwQP6T6ET/KxRA/PnwQP+7RDj/iLg8/vmEPP0MVED+/fA4/HJAPP4DYDz81pxA/G3kRP72DED8DEg8/5pQOP9+xDj93pg8/Oy8NP/TJDT/VdA8/THwOPwJxDT9AhQw/Cv0LPyQ0DD8Oyg0/vRkPP+1bDj+cqw0/JCUNP6fwCz+Teg0/npEMP/CGDD/V+go/QdoKP2gtDD/p3wo/xTIKP1DmCD9mfwo/aL4IP1tmBj+TFgY/vcMHPz7mBj+NsAc/udEFPy9OBj/V3gY/QxMFP3IjBj+BSAQ/aysDP2ksBD8JJwU/IpIEP8jZBT9a6gQ/EtUDP+HGBD96oQE/m7MBP9z8AT9gkv8+oVUAPy0oAD/AvgE/w7IBP1GOAD/c7v0++yz/Pv/RAD9SEAE/rX8BP/tr+z7I6fs+sar6PkII9z6kffc+vfn7PlxP9j6Eh/c+JVfzPl2E9D429vE+vH70Pjsy9D4XUPI+",
            "EuvzPrWu7D4D4ec+g5vrPptK5z5R0uc+zlLmPotS5D7AD+M+ctngPqH73T7feto++WnZPl4X2D48q9k+9B7UPuS00z5YidQ+DBjTPkpLzj5ves8+s7rOPmBmzD5yAMc+g0bCPqprvj6kxcE+hJXAPlbtuj76cLQ+S+iwPnLbrz4W8Kw+LqimPgyUoT6WSJw+YUubPoCxmT6L/5c+SnmQPrlikT4Xq4g+pMSBPryJgD5EgXc+lDpuPrjnZT4iRFw+JqBUPnobRT7mTjg+UMktPix4Jz5mKxY+CIH8PaTy9j2EeOs9GPrEPWwuqT2I7os9wDBVPSiFQD3YgDg9yC0UPRAT1Tw="
          ]
        }
      ]
    }
  ],
  "trainable_params": {
    "decoder_batch_normalization_10": {
      "beta": [
        "xDzGPcfmYT2PaiM8cmXbPKs3ajx058O9qbTNPLb6UT07XbO8CD5hPQGaa7wLvWy8QSW4PWDWgb1/L/Q8zkM2PRZMjT2dUIi+/2fhPISkMb3Gaba9UGelvVyweD1rS2u9TR/+vCntqL1Sgge8Gn6xvTUnajvEfCC+UDYrvZ7loj0="
      ],
      "gamma": [
        "A/x4P8JIfz+vqoI/AGaCP1YKez9W/oU/ZNV5PwYSeT/XfoE/7n52Pyuwej8dqHY/vb51P+LRgz8YHoQ/tFiFPz3Hgj/rbIY/XPp8P20Fgj+7GYA/Fi17PyrVfT8yCno/apKCP8iMcz+VBn4/VlZ1PySQgT9s44Q/ukt8P6vKgD8="
      ],
      "moving_mean": [
        "R6o+Peq6mb19pmy9HYxnPvJihr3wly6+PYvHPeJiHD09SoC8HxiFvjs1sj2TCLk9H7kFPs2e7LykIoQ+JeQFPnmTRD6QWde9g8e5vShcAj6fSKa7Nve3vUHrSj4/ihy+wKeVvYcf9j0YWmS+98/pPYAKobwuzYe9d04GPRX2xDw="
      ],
      "moving_variance": [
        "60LuPalIYj7FJUM+eil9Pqd/yj68cuo96uJ1PvLnlz3NsiA/QSWLPiu/yz3+HtY+gR6tPQkkez5eLd4+WA7vPbxUPD84/b89RgQcPrh8zT6cDrk+59RHPkLbaj4Ve6g++WGJPoLcED4uutU+LWsNPqb3jD1aaP09mrJlPppWhz4="
      ]
    },
    "decoder_batch_normalization_11": {
      "beta": [
        "7UwSvsgeC7zm7+i8BxjBu5fBLr6KmI686eIovU5kG7reHRQ7YN2tvXOCjjznSlu8Zx4PvQBffb051tM8/IlPPYqDKTymJqW96vicvFpOZD2gOZe924MDvAN1dDwUl5K81A/uPHYq8jswGz0+WLlhvbXJJT5fQ2w7tueNvQlbib7+BHG8Xlk8vUn1ybyN/NS80VCkvS69RjxCJlG8/hyFvTMYur05aHY88WDavNtap71wefE8F0vEvBZSjr0fL5K8nSRHvsBuYTxzZRM9UapevdF5srx9cZs8anAyvig5BL2sm1c9JdakvJDTYb1JLiw8Y/JTu/RhyzxfOPk7v2fQvA=="
      ],
      "gamma": [
        "7ByBP6wvfj86noQ/DxiAP3grij/XP3k/3XKBP9kSfD/khoE/lNmBP4vXgj85wXc/BwF2Px+vgz8P438/x8yBP6kcgz8V4YM/0daBP6eDgT+UbXc/PQV7P6zfez809Xo/Od+APxBTeD8MuI0/xWyAP/eDdz+cQ30/ckB5PwqDhj+5cXs/VWyEP/U+ez+eboE/e3R+P7X4gj9DLIA/aJCBP3vkgT+EZ3g/5GeEP1Pyez9XG34/qXl7Pw0Dgz+MXXo/RdqBP+M5fT+lNoE/bdl4P3CHgz+PfYQ/yMqCP6Otfj/p/IQ/ePh9P19+hT/vMoM/WQGGP52xdT/IBoQ/XSuBPw=="
      ],
      "moving_mean": [
        "jCW5PYKgVDycjAM8bpFOvhQml7vZmry9JbjgPDwaWL0rH569rJjEvCBk7r5iyiw+g5QYPvLegz1yc8m9Fw75vZ5aR73uJsg8u2NdPlCsYD47REM+7VhPPXr4ab3oc8i89VsrvuEVXr3++mS9WxYNvcV2Kj0Ycai+KBYFvrMnH74Il1w+iLGQPOSyHr6C3uE96qjqve1lrD0EGp49f33wvWK/9L2XJ7K+hccLvvm2sD2lTc+88oY2vZuOAD76tSk9DYeqPe44570BxIo9CgHQPeQ5uLsO3yK9G2EBOV0yHz27yR+9AdAsPihJeb3GngG+lce5vV8EZb2K1pi9XC+7PQ=="
      ],
      "moving_variance": [
        "HNDMPgY7ez5AoFE/RTSSPqUuMj4EUAhA3ltuPknLnz5nIBw/RkJOP/kCaj4ViBg/vP7cPt2v3T4tQJA+tgdRPsEzuj7EO/k9zrtdPghGuT7npxw/2EB4PSjkxz5N4PY+4hkZP6uHKz/o+ig+vX13PmQEVj/xxyU+OAGnPgIqTz2Kdi0/JWcfPoSudz9HnZw+eZtnP9dTKz+jGzA+5RKWPha/6T57dzI/1sKpPlZdhD7gHic+0vPxPkn/jT999lA+TH0AP5wqej0tcIo/q7K2PabeNT9yjvs9N3SYPRJDsz5VvDs+aoxOPzvZgz4GDb0+ZVU1P7XlBD/ntVs++A/lPg=="
      ]
    },
    "decoder_batch_normalization_12": {
      "beta": [
        "Vbh9vuOMK70btDe8UIeIu8T2p70vEb29JSIpPDZiAb0n0bq9L4V2uwxSXj5zU6u9xTnBvdoO/r080829rYKSvTr6gLwhFG2+cXCqPQ8GuL3v5hW9ibetPHXYWDytMga+VoQAvuLI873vYz26RZlivYGhiztp5bK9XHgCvb+7Sr1iHda93BS1vVD4/7qA0cS8bnZkveHzN70GzEa+34euvIR2e72/Sfy8Qo2zOoG7rL2Ip+Y48R0nvorBzDyPzGE9dmZJvSeGxbzaNoW9sx0rPJRbfL2FCoC9j5/FvWCZy72YYQi+3ZQDO5s8Hb3XGVY9yHKRvg7G3r3uq7K9ma/qvdgiyzo8iA69P+SwvWKUGL5PFmG9275nO7pA8jwxOqa7I2Q+O/H1ib4NPyc8Ot+ZvcXXjr0vPSU8HPbgu3t1wLyxz/i8bcvUvZ+8Mr5INMa8PUnJPT8soLxyKZY9OjkKviWBrr2Y5lO90TjkvbcgHb4C+S29X6DOvVrmh729fKa9TbK7va+l0r3Uc4a9rag8PBd7GT01XaS9z210vUDRb70YQdC9s2hlvcUnv70sEwq9MEkovctyML2r+V69dM/cvSGGfb0Hej29vWGNu1Tcmb0z4LS7zfTruwhOY72oJCa+Qj+3vYdRg70vtxK9eLkBvQLtY74EHlA7Ka/PvQmAkL0="
      ],
      "gamma": [
        "6/KKP8vggD9cGn8/OYh3P+HPgD/GYn8/CwSJP522gz8O24I/y0l5P+FNhD99Rno/XYJxP2cFiD+dv3s/8dGDP5F1gz+n7o8/GKuAPxelhT9L0n4/8FF9P/IqeD8tBok/gB2CP70ciz/nSYI/ZVSAP1uyhT+pd4g/ZOl4P2Dyez9bIos/PFOMP9qkdj8FI34/gQqDP6AzhT8D14w/hq90P4tegD+Vg3w/XTGAP2i1iT+JnXo/wMSHP0B9eT9NSYs/5eZ9PxGzgT/HYXg/U3N+PyNRgD8e2Ho/mmOIP1/mgT+lmno/IY+FP470fT/dsYE/BbOeP61lhz81MoA/y22AP7YjgD9+JII/uXeJPw0ehT+EhoI/X895P9nVhD87VIA/utODP5o9gj+qKIg/JyKBPw9Hkz+f8n0/CWCAP1TshD9xcoE/mXp+P4FYhz9cRXI/oMKKPx6Jfj9sBIE/AHWBP0q3gz+HynU/Trx/P8QBjT+O5IA/n0V+Pyrigz9t4oY/AvZ7P+k2gj9vwII/lvx1P03WdD+a4IU/ZGx7Py3dgj8e0oA/GeaCP49MhT/xF30/kzB+PxNghT9+b3w/IiCIP0nPgj9p+3o/ZJiGP2aMfD8ZynY/mjV+P19wfz97f50/XrCCP8XGhT/ksHU/W6KFP5fwmj+PtHc/2kR6P0PSgD8="
      ],
      "moving_mean": [
        "yFmJvf0AhD1DjpQ+wvlevtWGCL6s4zc+uI3/vF1Isj2y85c9MU8tvj7SpL1y3KS9QidPvv3FAj5PLhA9F/0wPpFrRr4S41y9D3phPY8ogj6kWAK+pWB2PWy0yLxGBQ2+Vt0rPaL5/rxIB4s9epryPYxlEb2v6+w8ZDWzPqWfYT75oFU+98JivQYarD6B2hq+yOFjO2TEjrmWIDq+gEINvo/fyb3JSEM+9607vZCnVD2CcH29rLe3uBwJAT7pDfQ84UPZusXi/b0+p5w93o9pvTbSlL7wB3+9Gb5WvlRwLb7u5ci855cKPsiWAD7u1No9FMkhPu90gL6Grba+FW6NvrMZHT7HuaI+txTaPQGSFb7OjTU+5rUcPbIQCb2t8hE+TQeavsCYC77Bn8E+mzE6POT/B751ZUi8wO0EPnh9c75rvpc9aIpWvH7qEr4KstQ9T02HPIYqWD1C/i48YQrGPaLjw73W2LU9in+Yvlya8j0Z0vi8WnM/vhAE6j3vs8o9ebwkvBuwGD5Dd+s8L+88vksRQz779xY+saqfvl+Y6bxoS0G+6J4NvWEVMr7JL689wsMzPrh8FT7eWII+GfObvRKS8r1e9eo7jajYPQO9+L0kTYk+YHmWPS0FQz3iBQy+j2N1vQNwAz0OnE0+ku/bu6rFhb0VRDe++bNVPNUrPz4="
      ],
      "moving_variance": [
        "De6lPtVDRj6llWE/wBQSP/KAnz1vq7U+JwdvPsJrgz/qJdg9ORo7PxXwiT7rQUo+6FJgP9cSsz2oiJs+CnNTP1Ezbz7nxqI+lFb3PgwQyz4/618/f+jYPhb/uD5VETM+P0ykPkwzqj1fP+Q+rq6zPWUs5z0RPeo9OOYbQKz/Fz83SPw9yOO5PUASCD/QcDQ/ZvlqPehkvz6Nm6g+n3EnP52T0T6xwBk/2oQIPt36HT416io/yeoEP1Uaez4JqA8+YC+4PVk1ID8dJWc/h8PQPvaIFT/MJJM+7D2yPtjPOD/OuRY/R84DPtHZgz/8T9M+pOHAPboVUT157Ao/U9mZPgsZEj9OmdM+vBc+P4gVID559Ik+vtnWPk7anD4As+I+QNWyPWXd8D6XMQo+bb0APvUbAz6QoS8+cCgMP7x8wj40YQ8+sqIkPxc9Tj5tKWA/GxaIPdEw6T6wilE+5xHbPo/IZT9ObtM+BTtQPpX+Xj6l+lQ/iJIQPr/pbz87EQQ/wL0aP8eaiD/fOsQ9eyk3P3AFBD/EhhM/5jb+PsHajT8aETM/8kmEP6QUij6V9WQ/vYh8P/WRLD4YD/s+3ySYPvn1GT/ronA/of6OPugJLz60KqE//C8WPzXeWD7nILU96HvKPhk51T6Ja3s/du2dPlHWfz4oSpQ+xC2SPiJIGz4="
      ]
    },
    "decoder_batch_normalization_13": {
      "beta": [
        "wkIIvnEDpL2B+BO96hcBvgP6Mb36O0s+MiKbvhIMAr73FR29007ovTDzdr2B5be9l92Eva+hgr7sVvG951hivljOfb26tha+ydD6vcx7or17ske9VcfqvWx+DL0VNPu99TArPsgbFb5gYpu9BvhnvVpZBb5f5OW8gDXIuzT55L0DwjG+oCi8vX5kvL38/s69bPz7vKoRKryqzA++7vwqPeT08r2PdxW+OHpivtK6mL2DewC+5B0WPe8IXr3yLNg8pUAyvjzMG77n3om+JNQxPi6Cwr2q43u+3YyBvQ4al73fKwU+ELkNvUixHL7Bg3O+2Dkkvb5nsrxY8549dQUavrK6XzvsZgu//o+HvQKX7rvOcwa+OV+BO/fXCb5ykHu924m+vUeJzr3pZq69Vqkmvme9Mr7t9rK8ECrHvdPbH7uoRTy+ZVktvk/pXL4Ds3q9EutjvTFwdb3sIRG+xxmEPFLxob1rfr88op1pvW6TXzzMfIy9OoxTvjkx1L38AWa7FCk1u+XzAb40yKK+2nmTvU3MA74fSXW9SApiPYSrGL1FdLg9IpNLOyEPMr5Dwyq7iXHBvSfGPr6ThWm9AbOsvYsuQjtMR8m9GZ8SvkJ6k72I8GM7fOEgvtKnJb4bXBc+M9C5PawWX73hN4m9fUsgvJEMQr2jLvm9IN7Nvdz8qb3VKs692IWHvcfZzrwaB4O9wSmGvSxCVr1fJpW7VLr+vSUPjr6pCYC9Lj8sviw55L2ZDOc8Oj0avlcqjb2NRMS9mVDevVZ2xr3hbOe9cgzMPO6AZL1l46i9tla+vbgYM76/ic69EM0DPlPHSL6C3xg+ooRIveCKrrv0CQ6+NvIHvqS8E71SHAi+q/WLvVaRJ75TZCe+krHMvT0RaLzGiBq+lbn4vaPGir12tDc9jSoavVCPYz37HAG+1gYjvud1Tr4vkBm8m9MpvuYnpL3VwEy+bzR9vV54KT4SapG9MufPvctEC75oypi9gQmqvRpYMr4PaeO9S46FvjG1471ktOe9",
        "dcqxvQp8D75IRbG96cT7utbkpb2ADJC9Ti03vKNODb4vTba8PeygvfuOJz1x/ha9mF3+ul54m72fgrA8ktDlvauBIL4KpEW9waqcvA7ynL2h3tG8ljrBO6Vsv73TmEu9l6PVPK2gvrw+6Jm9XKg8vgGjHr37lUy+h+LbvcLITL6LAd68QA4wvZ5RUL3hR829s2rkvewKHr6/CtK9WkQUvjAIYr0/P729eRtKvVv/Lb76q8e9G1kYvSSU17yVyCe9uwC7vXIncL3QMZS+FcmJvdhGkb0oEbq9H6uFvdGqbT3vEoW8wbzxPVP4ob3lMui7LfPTvdSDIL1qqS2+eMHevQ=="
      ],
      "gamma": [
        "LjuHP+TFgj94EH8/6uSEP9dmfz+ncYU/8CCZP2Y1jj8v6Ig/1puOP/nBdj9cdII/w6CLP21Bij9YvYU/ocOLP1RXgj8ooHw/7XuJP2S6fz9apHQ/WvuMP5Rngj/AUpY/8PSHP5QniT9NX5Y/5AmBP3/diT/+hHg/Rt+EPxywhT+3KIc/yUSEP0cQlT9cHYI/iBF4P7GagT/JVIU/aryBP43Fjz89rYc/bDuKP6fygD+02Yg/tteJP6o/eD+tWYE/erqLP6aCgz+Ty30/5aR8PyKWfT/agoo/YUyFP0j6eD9vY4M/QzN6P1BshT9nUoI/b5iUPw4xdz/djYg/QN+FP12EgT8XGZs/VhtuPzsRez8I8oY/MHaOP6jxiD+LXHw/haeHP7I7gT8Si4Q/HNGGP6gqfD9DaIU/uF2HP6Q0fT/NzIM/JaSHP6rNhz8NrYg/ViGIP/rzcz8fd34/Y/J3P6ScgD95wYE/YxWMPxMEhD9GboA/6yCPP8TEiD/ET34/SWp/P7wpgz/5No0/Jnp4P+aggz9Ba4c/S0iIP1hTfT9kcIM//F6EP/2khz88K3w/Z8CBPytfgz9Z0X8/paB2P1NghD8VdIE/jEKJP7aJgz9um4E/SmCFP8afeD/6kpU/GpSCP1NXfz+ZYoE/JJ97Px7RhD+3/YM/zi+IP+5cgT9m34g/qi6EP6iieT9yK4M/UhKFP+t6ez8mE4c/POGCP/QPmT9hLn4/fOqEP9M7iT9DmIE/E16APyUbgj/51Hs/ZWWAP7ihhz/lWIE/mgyAP0iYgT9dH4I/3CqBP1B7gj+b4no/qlSCP8f5iz+J+IM/0LaEP3Lvej/5Ao8/3Rl+P/vchz8lAog/NmmEP5XUjD8+84Q/35mEP+Gufz+fkY8/5zWCP9eBgj9ER40/gw99Pz6oiz+VRZI/xmCFP737jT9KkXo/e0+HP5bEgj/vx4Q/4CyBPzilhD9A+HM/VIh9PyBGhj+LnYQ/myuEP67eij90poI/k3+kP1siiT8BU4M/",
        "Dx6GP+ShjD+vSXs/KWSMPwMegT9h3HY/xYuAP9N7gz/qK4Q/cEqEP1H4gT+THH4/c1mBP+EUcj+KvXU/7I57PyxNhj8lsnk/Sjd+PxCqej8yrX8/S/OAP9HVhT8JVIw/3kiGP4oqfz/fZms/NeqHPye2ej+2HIk/nKeGP8BmlT9w74g/gryCP8nHfT/gAYQ/gol2P/h8fj+mPnM/snuBP6Y+gT+OYIg/AIaCP20lgT8DW4I/n9B6P91kfz8AY3o/NeN7P7rHhj9Tcoo/VsiOP2b8dz9r0oQ/ljV6P29yiT8G5YE/59KDP8rIgD83goE/ElKEPzZvdj9JCIc/ZiuOPw=="
      ],
      "moving_mean": [
        "2XYlPitHND0wDtA9itdWPvAB770WEZW8w1GIvWcsgz0If4e8muftvf/FwD1q6ak9nbNLvoXkMb2NAvE9uAqFvSniN76M15s9XFg0PqUQYb2S7J29PLUwPVMLYL1RGK28K1uovWPgs7z+LsQ9KMazPbFAgb0FguC9HyzavQDzF7xyA9C9NzgLvaGZBDrWIuO6UpGWPWDwWj1EC1m+p/n1vb66zDynSTK+3PHMvTrMIL3eMRS9QHACvmXJvr1OmTC+rpl+vQICmL4HDJE+pyY6viYe7T0V/wK9I3kBvoRFAbuFozK9uVvNPW0XFL5x7pi9HYWBPcAB1L3VHNO8t/jpPWLrAj2OJHu9k9VevQT8KLxBKUG+QIRzvSq+Gb4iAMC9N4cnvsB3Fr4zzqq9sBwePvIiuL1Jhz4+jEhiPs2VXb3fRCS+wJnDPXfS573yQvG9Oj0SvU7dYj2UNk+7mYIMu/lYBb6HX1Q+atHJPCMb8D38Mm++7OkIPa6TfD5JTG298Nhavbmnnz1jkq89ms3lu1hgmT3Qw5I9Tv48vd3kBD43CJY+WoGLPk7GFj3CylE9OiXOPdPGX7vhNg28NaRKvvXE9T0t22w+dMKIvbiebT2XtUO97SsePdSH2r3XCP49QhMBPWD+Tj1tXTK+HBHDvU3wJz79zg88kBixug6ALj6lg/885AD1vb3RlLzsaZg7n1O/vYC/8r2n1eI9onJLPc3Ffz1JBcE9guwDPrpxjD3IN948+Bbovb2phL196J4+FffzPbp0KD2/0c29M1m0vUTxWj4Iv8K8IvBFPRTymLzknQe7qO1NvZAwPr3YRvK9vt27vOzX3b3toQA+YJSvvSGJD720QUO8oi6cPQQlHr65lM29BXDFPajeJT33uEc9xkqxPbJMyr1AmAu9YXv2vMs9oL1VH4o8e2ydPR2Ckb0jfP29Hg6MPac6jT0CSQo+EwyCvt+SXj1fgHE8kp41PjSCFT2U1HQ+m7wAviIXhb0k1aw9ZWhsO8ifRj6iqTi9",
        "U+8/vcirjbye7j49Zt1YvqIQVL6wZ6m9i8zXvfjUtTwtZIK9q5e1vCWUzjwgxFC9HMqRvLlmcz2aKxu91fCCPdmpnb0oTco8lU1svazz7bzrr1g9rbFkvcpAxTu+vR6+cKg5vXJC7D1r86M95UO7PfI0C72APi29VUnZu7Wpuz2HsJA9P2fEPY4ztr23TvQ9xzSevX3kOD1Y3D+9rSyhvQC+Y7tjlgA7WunxPIVX8L3rufy9DHEOvXgKkL2NNAO9Ar4RvH3gxLvrqXM9ix7OvK+XKzxvDDc9tVGmPfMyJ7016Tu9Vfa8vLNmVD2COdK9HCdmPm00lD3OyYo+INOSPQ=="
      ],
      "moving_variance": [
        "gTjGPzK2rz/EBnY+h9JvP5NG5T9RCYA+iLZrPmuqPz4Z7EY/h1xDP/3Sij9cjuc+jx8+PojvDD/i3f4/vsewPfmQVz9YWxE/tJE7P2+udz/AgDc/gQWDP5jdFD/JVXs+cm+YP3w2Tz8K0Y4+VUoxPhSM4T5v7v0+Bn2lPrOBfT/TyaA+Ikn5PUq0Tj4e2EJAGIaKPhJrsz5RDlg+fTzRPhUjBz4p7g4/l5J+P9uC+j9mI3I+PNP0PmyvJkDpU1E+LcXAP7DcLT9xry8+G5x5PqhcIz/BfJ0+w36dP+0jBD9oysQ9C8zRPm2OAEDdmY0+paLbPkay7j7HKps+xPYyP+DJWj60PcU+b7ZyP+crKD9qrPM+etlaPpb+dT/s8Rs/YGtoP2f6Vj/vHxZAoiaRPzS6cD/dEPo/g3KZP/uR5z++jZM/V7HqPsltoT+JI8c/9QBTPshWqD5gXW8/1GPtP7fnqT9PAyY/jkIuQKMJND6JYls/b5+QPuMoxT9udiJA4/rwPitNzD5/ETY+VfIqP6bwpj7NayI/yqBQPocS1T4v2S0/usFOPkcbkD9zy/M+Uq8SPnNocj5chA1AVKsKP4tDAj5pdNc/bQZfP/YThT/dPII/gwe7P+2ZGkCZ954+zPvHPv89fT/8kLQ+6eAaPw2+rj7CbAY/NDXGPZvoBkBk5iFAqXHkPrOxiT6Jvqw/hx6ZP8ZdVD+kVSU/HppdPh/vUD6RC48/1vr3PrqthT8+cFs/NCcuQDtYxT92snQ+t6NTPtwcWD+3ZKM/34xFPw1HfD/xt9E+gwiFPzuMzT9KUYs/RP6nP7Mizz7m/aA/M+mePvSLdj9ZcC8+iEXYP4nFVj/ckfQ+FeaUPsGpAD+zY/Q/d48oQIgL9z48N08/tbcdPx6yvT41HFM+CkOqPp9LWkBP45g+yPiWPqIxbT8yV+k+n0ZmP35O0j+MwWE9gjQIPiqQvj8yGsM/A/csPyTssD9IOgpAjpTgPcBPmT79has/7AONPgEuvj7URxY/",
        "XlMcQBodxT7OeJ8+DlexPacu8D/s9TY+NteLPpclnD9lWsw/CqG/Pny8uj9dfcc/GenTPqKFVT8wcvg/G5KAPl+GAz+hI1U+HBjQP162CT8nnUg+YdEuPwtSPD43I4E+IZ3QPqOBmD4gqj0/KO5sPxwugD/vCu8+LEQ9Pn4uvz7j4Vc/1uRdP3/UyT7i4Ic/WsOHPmVodD92o3w/keDbPVRhtz8J7zhADH/yPr6K2D9HDss/vNZgP5sI8z8vQtE+9eVIPjVG3T6NdV4+qoAfP/3Eyz9wGT8/tt+SP8J7kD73nSc+V9GRPif+mT+NuX0/0CGzPmd29D4YCRk/dzWJPw=="
      ]
    },
    "decoder_batch_normalization_14": {
      "beta": [
        "EwL7vbRaiTxMIp++zufNvc02BL7BkYS+f1uTviHUMr66x369CENlvoJVLb76K2K+l7F4vlF4hr3M5Kc7FX0EvpDomL610Wq995dwPAWgi74l6Vy+bxcbvhPQR71IsxC+E32NvDTNN75VzHk9b9UFvkWZj74MWc29RjaJvCpCh76v48W9RvNJvf+IKb4moJS+iJ5FvtyTFj2QO7690Lw2vkXVJb4EISa+eEo+vvCkSL4NYqi+WQCEvf3/fL617/Q84/8KvuRL+r1gobO85YKMvlPAqLr01yK9u8tJvqzxLr6Gboq9VGMHvsk8dL5/OwK+0zstvhqtMb7O8A2+wieQvJSuA71i+Ia+ZUu3vYfP2r2Heb681GY6vgV7l75p3yS9Jj1Lvj9RB75TAzK+dc83vn8HBb4EJDi+h3/RvVgEn75BkqM82lFPvh1WKr6wEbo9pB8dvgrTGb4bjA++uNxuvmlVRb1N+669YJjmvKo/kL3NS0C+S7y2PZGfZL1JxWi+cCfEvf8hWr5lsJK+uwGbvgp0pr1jj+K8S1aUvqdYjL4jga2+oBKRvUMWkr7CCpu9RD+2uhEWUb79BCi+BC54vtX+8b1svSS+rKsrvhgwYr7XBZ6+K917vguAsjz+eEq+p50qPN/KFL0SJZu+aFMQPNzOC76m84W+r9GEvr8oob11FvS9GQjzvaCMNb6HZeK8SCJ0vuWolb4+UNA8r95YvSyuT75LbRy9fEANvuNSa77Pe7S9fLajvcNaC73guKa+aXMWvoDhn75aP3K+hsb5vd7T+r0KJvS9NN6UvlWqLr6DZFy+0cuavM4gXb0sgC2+EqDhvfmGVr44pt++BV8gvUIPGb6LwwW+6bP8vSXBybzbIzi9CvqtvXAizb7RnRi+WNepvT9grb7EpgO+6SQfvVCptr1afZ+9lFkDvgsqh75Mx4q+XYyTvsI9Ur6dBXy++T0WvpP2w729Zva9RgWKvl4bor7/ZOC9dk5Mvvisd75H/fS93Q0nvtZvfb413n++",
        "D+PfvfQhyb2oGQu9tlQbvmJMfL5T3OO944gzvrYjNL7gVl6+gdgevuIhhb6IPmq+fIU1veSmpr4NjqG+vLdIvqH4w71T3l2+VmqKPc5XT72E16u+lfkbvgp+573KHqK+UZbLO34XKDylGQu+H+UCvvR2J71RRZi+WZT+PDq6Zr5htf++PJ+bvepAOb4gxUK+xueTOXyOBL7R8je++5w9u7F52L0VZxi+VWXyvYoAkD175Pu9fgq4vmB5m71S/Yu+LIV4vt9yWr682RC+l7JDvs5+JL4l8kS+zEWJvaxSm71jQ/q9QJJWvsMGyrwOk507rdAvvoTIYb1Hrw++ygVjvpLPbr6Z34++v7/qvXBBm73uwjy+QdcMvmbQe76DNmu+53mTvog7Er6plOq8ehGOvoqgRb5xnjC+21xDvq1dM7646C6+aXAkvm0gYL6pGrS9VMc8vsceXT2Wj7y90VznveqnaL6MQCG+FToyvV87h74dk/+9VJmCvgmDSr5iLcY7tE49PKQwgb4QB2K+i5Z5vmfUh75m1ZK+xeBuviCLn72JwgS+S37svRjfg74cD+m9EZP1vQgdCr6Hwoe9ApsJvmPQ4rzFhAO+Sv2wveiz0ryR2ky+Qms0vnFa+jwkHXS+6sUbvu8WMr7mQdW9BOiAvpKgV7z23jW+9L+UvWtGOb5GgQK+bhCZvGzkbrxA9yy+yZCWvmyNW77Fa22+MC89vsg6h74JjWq+MgB2vdu1bL4jcxm+lTIcur91U77YYna8OIESvvphob7Q2E++yHUnvlv7gb6PsQS+ELuVvllVKb4kVye+AqxRvhhxdr2JG7e99+xrvuZoQ76JEYK9q4WUvgOkX75qSXW+upzBvSyt370BJJu+mYOOvgHzA76jwoO+j+27vgg+q737lK29qWubvpkxh70BigS+Df5gvt+oA77WdYq93zQtvoDTED1MRx6+ZpunvjfSSL5L5RG+atbnvQNk0b27qCa+viqdvcCoj721ohC+aV8HvnjaZL4CgWm+",
