{
  "parameters": {
    "latent_dim": 8,
    "sClip": "-60.0",
    "sr": 22050,
    "win_length": 2048,
    "xMax": "97.41005",
    "zRange": [
      {
        "max": "5.0",
        "min": "-5.0"
      },
      {
        "max": "5.0",
        "min": "-5.0"
      },
      {
        "max": "5.0",
        "min": "-5.0"
      },
      {
        "max": "5.0",
        "min": "-5.0"
      },
      {
        "max": "5.0",
        "min": "-5.0"
      },
      {
        "max": "5.0",
        "min": "-5.0"
      },
      {
        "max": "5.0",
        "min": "-5.0"
      },
      {
        "max": "5.0",
        "min": "-5.0"
      }
    ]
  },
  "model": {
    "architecture": {
      "backend": "tensorflow",
      "class_name": "Model",
      "config": {
        "input_layers": [
          [
            "z",
            0,
            0
          ]
        ],
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                8
              ],
              "dtype": "float32",
              "name": "z",
              "ragged": false,
              "sparse": false
            },
            "inbound_nodes": [],
            "name": "z"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_8",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "z",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_8"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_8",
              "trainable": true,
              "units": 16,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_8",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_8"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_9",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_8",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_9"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_9",
              "trainable": true,
              "units": 32,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_9",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_9"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_10",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_9",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_10"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_10",
              "trainable": true,
              "units": 64,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_10",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_10"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_11",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_10",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_11"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_11",
              "trainable": true,
              "units": 128,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_11",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_11"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_12",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_11",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_12"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_12",
              "trainable": true,
              "units": 256,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_12",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_12"
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "axis": [
                1
              ],
              "beta_constraint": null,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "beta_regularizer": null,
              "center": true,
              "dtype": "float32",
              "epsilon": 0.001,
              "gamma_constraint": null,
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "gamma_regularizer": null,
              "momentum": 0.99,
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "name": "batch_normalization_13",
              "scale": true,
              "trainable": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_12",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "batch_normalization_13"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_13",
              "trainable": true,
              "units": 512,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_13",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_13"
          },
          {
            "class_name": "Dense",
            "config": {
              "activation": "relu",
              "activity_regularizer": null,
              "bias_constraint": null,
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "bias_regularizer": null,
              "dtype": "float32",
              "kernel_constraint": null,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "distribution": "truncated_normal",
                  "mode": "fan_avg",
                  "scale": 1.0,
                  "seed": null
                }
              },
              "kernel_regularizer": null,
              "name": "dense_14",
              "trainable": true,
              "units": 1025,
              "use_bias": true
            },
            "inbound_nodes": [
              [
                [
                  "dense_13",
                  0,
                  0,
                  {}
                ]
              ]
            ],
            "name": "dense_14"
          }
        ],
        "name": "decoder",
        "output_layers": [
          [
            "dense_14",
            0,
            0
          ]
        ]
      },
      "keras_version": "2.3.0-tf"
    },
    "hash": "17d1e8def88fb81b536cfea05f37b91b2a13e1fc9fb1f67393014ca77f629cd0",
    "image_data_format": "channels_last",
    "input_shapes": [
      [
        8
      ]
    ],
    "output_shapes": [
      [
        1025
      ]
    ],
    "trainable_params": {
      "batch_normalization_10": {
        "beta": [
          "lLOYvc07mrxSg8I8+6jZPadMRr4wF6u9kl8mvefoT71Nm9K9dzuuvXelbT1Rd6m9vx8BvnmJk7yPAEa9BiUkvhqNfj2A+hs6thwFuygTrLy0mEK9GtbyPb3dKr2ad6G8SBeTvS1hCD4/ZZc5WBVyvJVlw7ytz+S8cJIuvrU2RLw="
        ],
        "gamma": [
          "jI9nP3bRhD9C2Hk/0pp0P7gEfj8zLoM/oQ1vP2pUcD8aOIM/7sBtPzKwfD8K8II/mzSQP7P+eT8PyX4/yAx4P+pYeT+NPnc/MmdoP+KPgT8pvos/Gdx/P3h8jT/NxoU/zfp5PzPshD8WqGQ/lD14P7mzfz9ikJA/pAh3P6NoiT8="
        ],
        "moving_mean": [
          "+5DVPnc31T6kyvQ+J9oMPuynFj9jAvM+tMDSPrkvGT+LVMQ+jjuXPnlBNz8nCec+w4WwPgLQHj51dsI+VTaQPoU+oz7U1dw+xVGePnia3T4z+QU/maa5Pjtr5D40dtY+mcXMPtYHIz90kXM+VoudPgq7/D6T/68+kP8PP6tgBj8="
        ],
        "moving_variance": [
          "MsUqPnJfaj8sRjs/YaKGPTSVFD/cGgI/RmifPgiy8j7OsTM/ACA0PjCpPD+kFiA/+AcyP1K4AT7Do0c/pkNXPok94T4mH8s+2j0LPs1NBz9BeBs/Fv1nPo28jj/kJHM+s5orPyTmTj4s3zc9ct5cPilfij5fHSM+qCTlPkK5yD4="
        ]
      },
      "batch_normalization_11": {
        "beta": [
          "aYXqvaNDyrwCAq87uKbQPejuajumlK09rVQOPqajorxnjJs8lxH3vLsr4TujNig8dWV/u6pyt709dn49lqeDvQdN7D2+YJ291PMiPbiahr3VPtW8Wa4RPUfrD72UVd67t9qTPcsyBb3ZU0I+krSKPVyRlbze3qq9j8EavikiNT3+cHu9j9NmvQz50z3o1Rc9WuCRvKCmb70H6hC+vIkXvez3gbzcwii+bgJcPYFXPz68UKU9R+xbvbVs2L3IfGW8p6LZPA+OYL3AYi8+bSjKvTuypbyn3os8ECy4PSRboL3jbxG+/bOfvSGNDL7poii910Q0vQLgqj3sK6K9IyYAvg=="
        ],
        "gamma": [
          "dwJ7P4ElgT9RU3U/AHRjPypkgD8rvIA/+G5qP5uQhj+kaIQ/dctxPxMsfT9wZYE/APGFP2Csbz/xzHQ/5F+PPx1lfT9h8YQ/vWhuP1IDfj81N4M/UMSFP4JLeT+aF4A/EUJtP/JZdj+KvHU/qbBtPwqaiD8OoZM/TL6FP6LMbj/3l4U/wsx1P+9VfD+RXYU/W7OZP1+JfD96GoA/XJaGP+mmkz8OFXQ/YqlnP8vggD/FQ3g/0J5uPwwFhD/ednI/aDdzP4dRZj+PR4Y/ZNeVP/g0dz8lNHg/JCp9PwskgT8OHIA/1bNrP1CVhD/P22s/T2mOP7phaT9Gf4c/gRd7Pw=="
        ],
        "moving_mean": [
          "2ECBPkrBzT5FQm8+t/6hPlPG2D4BSoM+HzJbP/0/Ij/TsPY9tL/LPoPxJD4eDjE/mXgQPyCJJj8QDLI+QB4HP7VJCD9U5Bw/+/V0Pobe8D4D1Z0+QPm4PugqvT53hC0+HaHUPp/PAz+fgQw/sy7iPqs29T41+Rc/AZgKPxueZj4Lcfk+PfsIP2UAHD+BHBE//hcvP9yjjD6fKYE+fTT+PhLHCT+CPAU/u0/6PmYYdz5n980+wH/YPk9wLD4F6Hs+W1+HPntIfD5/sqQ+96MvPxUOsD7hKAk/P1d1PtYfGj//rvs+7OkJPxXEhz4knAM/23ItPy+9BT/zWvk+5kboPg=="
        ],
        "moving_variance": [
          "+eXbPkTftT6L1Bo+J8svPsPFiz8OTlc+PqgjP9rvBkAhIN49j2QQPwV3vD2LIOo+0+hrP4elGj/jCjI+f3HYP72miz6vMwBAIqQYPpK2Lj9v878+MrEJP0xx0T45rZw+PyYmPokcMj+1hLU+ntfJPgg0kz5VRu8/nnN1P1mzbD5Kzeo+DEAnPwAUIj+jeI0+/14kQIm2rD5qn/4+QDGRP98o4z/Vwc0/zvt0Pp0uFj5s9Jw+fuesPpD0gj4R0W4+zUqXPniQFz6GJfA9NvY4QPbIQz+PW0U/XqJuPifPC0BsYmY/e74/P/XElj7tVhA/vMIIQB6vRT/tMoE/eL3ePg=="
        ]
      },
      "batch_normalization_12": {
        "beta": [
          "GXurPYrNBb37YMe9+u7nvdy8Er1gq4m9zOSWvSSfnjt3rn28NxtsvE7pqDxr1oS8EQmCPfYWvz0vEZC9pAy4vSUvwLvJWba9XsQeOrDaYTwFgFy9ysSOPLw0qbt1uYG9mIurvS9CI7y8QZS88T08PLruVz128FG9HEqTPJk8gj2wWCM9kshDPRzohr0KwgQ6AUVLPbyzIj1K3EA9Wo6WPb43i71a3j082SgUvdrYoDvGN667li8hvf5tar3h/I89v4YVvRZYub0nuWy7bqYovYCQkr0dcQW9HPyIvZqWk70SF6a7aaIsvRiclLy0zN29K/gEvoTECb0bTtU9ZyQ0O/p86j2GpQk97zsCvvwrkL0Beue8NctLvXyTlb1qdZQ93QruuwC4SL0ako08jn+Yvd4WhT0FCKq82jvEvUOVVjyu6pU9XqNMPbhf7T1G4Ts9DATKPX/SQD15L4S98essPYzYHr3kW8C9sqvNvWf9nb3/oIo95xNfPeTV6Twp/kk96OD1u3+Jqr3qiHq8XK9TvMcI5rrzTgW9uFffvFqwe70m3VS8n1G/PW8fOL1PpSe8gU0QPe+kgr2mL8a9gPKtPQKw2r0sP0K938kDvb+FLL0RGHC9uuhIPCLTij24GFm9KKimvf44lD02a3G86rGAPX2WDr1vEay99sZVOVHM+rw="
        ],
        "gamma": [
          "VjxyP4YQdD/WTIE/IAt4P+Lyhz+lSoo/JJd8P9EzhT8C0oA/6z2DPzGncj8JSGk/t+x6P6Hdfj+cdJQ/o1CHPzQkgD++fH8/k66GPwThiT9/DXk/IOV4P1/Sgz8rE4A/uXCGP95cgj/yPoA/Rj56P91abj+fJYE/yhNzP/K6fD+k9YM/e2l4P0q/iz9soW8/yAl2P6Ohdz/263E/fmR/P2B5jz/m/HE/4WdxP5zFhD+R94A/bJWDP8Cxiz9Ng2g/POGDPw3GiT/bDGo/uyqBP6KxjD8LsXU/yWl4PybqhD/IcYQ/t42EP/vJdT9vgnU/s0d7P3NYdz8FWWw/HICAP9GUdj9lC3U/xROCP+XmhD/0knw/VwZ/P6CZhz9aV3k/SfOHP8m/fD/a7YE/R+J5P5DSfD/4HYU/BcGIP4JchD+vQnA/vDhsPy8waD/0fmA/oUmDP/FBdD+EPF8/MNxxPxzUgz9ofJA/0/CJPyPYbT9b6m8/LjlyP0o0iz9IPHU/fRt+P8eafj/wmII/G516P7Zdcz+GZYg/4+R0PwA1iD9JM4Y/Zel+Py/Mgj8I9oE/x6aCP8gdhz+frYM/5QVxP1IEhj9JTow/61d/P5ZCiT8deoE/LYqAP6IbbT9BUYE/Py19P1nZeD8rZYY/q5x7P6sVcz8f64Q/8SOEP9kRgD8="
        ],
        "moving_mean": [
          "sm4TPxq52j5blKM+0UEcP+iH4j7sdUA/GNCmPtKSCz9nVhs+MhGnPgcNHz7PG+o+mzfNPqU8GT9HYSk/Q008PxxE8D57DkQ/9EGKPkOEvT48icI+pEQdP7vMBT80G+o+jQEEPzw2sz6q5d8+n7jaPvoG8D4iAwI/y7AtP1tjMD/G8bE+5SELP+jOBD+L3p0+V/C+PkQTkT7PR+M+nWaCPsGVID+n0hM/LxdAP81kJj+jaOg+8O7yPvNBXD+Hpho/wfvKPqW8nz7X7Gk/xQoKPxehPj+9hpk+EhcnPwtiMT+mvUg/TG8VP9L+1z7Mg/4+k88jPwFiCz+EsyU/wR9AP5f2Pz+QjQY/hM2jPvP6hj6twTs/65giP4e2Uj9Mm8M+TXcRP0njsz4NTC0/+qljPwbKtz7Rz7U+9i9MP9Hc+D6XidQ+3o3UPp9URT+h6fs+qHnzPjQNMz/j4Lk+oqJCP/395z6UZko/AKO0Pnu56z42vM8+8QfiPgwp2T6OMa4+iyA5PjZn8T5eUQI/cgbtPqKKuD5StTA/tG25Phe02j69ZU4/oAoFP0g2QD8NRqs+kEYNP47Xjz6h8iI/QzjpPn46JT+VAUI/lIvTPirZjz5ISUI/4SoyPxvvBz9pwLg+YKC8Pobjjj5KOtc+k+4uP4bSqz4tQy0/6OUZP+TGLT8="
        ],
        "moving_variance": [
          "5dtiP1DB5j40oFQ/dw2dP+oK9j+DDWFAsFYQP8pzmD97Tos+2wQnP3CHJD4BfmQ+9MNEP4WlIz9WdxtAZ4tWQADejD9C3mRAb+8gPxe4hT901d0+gLTmPxkDAD9miYI/fjPUP5Ll6j4Ch38/kLGiP8j/ij7oBqc/MzGmP+8zJkCoZ08/bGAFP5fZvT8m9vE+k3ypPkdfcT61TSM/y7GqPqaY8j/ne5A/yQIZQMksGED7qsM/6kSIP3P6kkALUgA/S3/QP0gLBj/0npw/j9iYP7k8SEBmhpE/8iglQNpR9z+EjyNA4ufrP8rnUj9eZ3U/ivIWQKiPkT+Xquc+fy3hPtkbAD/2Cro/q5C5Pk5lNz/gREhAuD3QPsHmC0Czios+QLSlP/iA0j5WZgc/qITvP1Dqwj7O2Jc/S1A7QAnjVj9OpQA/Coa6Pjm4IT9+ZqY+BbYZP3sWmj9gdRg/RtUmPwtAGD9tu3FAgUSnP+3ECT9Bj+8+RoKwPuchkz8F3eA+gY2zPte2hT+reDI/pqAhP9rjKD8pPQdA7coKP8YJhz+xJ8U/ZtXuPvO2NT/dryU/TnNoP+m9FT8NXAVACL2QP38ysT9OMWNA7B8ePxMyJj/GxGNApbg+QIhvGD9TrM4/IoIqP5Zvyz6Vl7I+CoxVPzRvwD4QODVAF2S9Puf8NkA="
        ]
      },
      "batch_normalization_13": {
        "beta": [
          "eIb1PQwyij2P6wA8Sgd4vWZK4Dkhdiu9SaeZvX3C+7xko2o9LaQQPug5EL4IfAe7zzV9Pj7rz72mOQQ+/S0mPpJDXb2ToB8+4v7kPcQsqjz87L48HiBWPeQ4KT5Z6BK9E2iPPhanij0XFEq+Df9EPpptrD2n9yu+tY3Svb3xL73sWas+UkwiPvt9iryRYDC9ufQOPss4Az2aTfA7mKQJPns5kT4SzqQ9RPI3vtHoCj0GkhI9GXWcPKCkMz28yUa+VDXAvRZqwT2D2pi85YSYu25WlT7AGYG9T/b4vU+4+DyBXqo9cHV5PhAmiT6V/ZY9j+HdO0kajD1EwPo9jfRPPXPgUD6OU/k9jASNPaUSjzyCTpU+EgUIPD7ZmD7ilFi9ZN9GPjMwiD5+r/k9hVezvSYfHbzab2Q++xtFPU985j6P3a89ERsTPXfyrLxDvNq7lcSqPiTgGT1UaKK7Wva/Pl7IoD3TxoE+gOrNPJvGEDwCD+m9ZzIEPqJgArzKgl+858k8vQbuSz62bNI72EuUPu/3oD0YSaw+FX73PSiZhb0RsQA+Ee9iPbnvHL6ycxA+uzfxPefctj0ve9480j3gPqWki71Z2/o9y4mwPRdETr3l+Y69732OPhoUxrx06os9/G1AvSJPhb6k5y8+MvlPPWL/OD170qQ9XQqpPXAboz4Y3ze+3SvhPjfjgT0VGMm9CyW9PdvG5D1joU4+erGIvTn9CD2kGek99ehZPjxjgz3aUeQ7kAizPeA3sz6lRUW9JCX7vdMhOz4dUY48iFq5PcbiITyg0BG+fRnMO85NdT7mew2+K7RMveviGj6cALM8l3PMvYPnXj7f9NG9ItybvAVPRj44KjG92/ejPTWaXz7Hlb698CUOvuzikD4meCa+Wo02PZYfsD10GOC9f6LrPPgrJLxd55I+cuT7vSf99z2nGJg9GnjGPFzDNz5Qi/m97/mBPQNztDziWTg+c1+APRq1KD6h+Q0+tRkGvvVy/z01Xrc7w/8qPRVGdzy0Gck8",
          "nAaTPYhGob3M+Mm9wJ7Pu3EPMb3H50K9+0UtveARIj6EBaU7k2u7vXcOkL7zEYc+o2cQvqAyFDx8uBy9qF0vPspqCj63+pY+UKcZPpAg+L2DhBs9WnoxPgzrUrzUkHy9+9Y6PrKXPr7rNP29vly5vRX+Qj3atxW+7WxxvYSZML2iAXi8HRa7PN0fhj3HYDa9id9cPvU7Cb7Ntp89iQAkPY5dkj4McZK9TNQlPlpmljyMcgu+cyUhPXUjUD4yt828p/agvZ59az11/gc+/Wj0vegNoD5EgGY+c0Onvcp1sD77wny+GjdwPDvDqb169W8+JDOrPFS3vD1rJYk+bN83Pg=="
        ],
        "gamma": [
          "d49CP2YJSj/3CUU/CdBSP1ARNT+wJlI/Jp8tP9gDWT9ug0s/eQ49P4u2YD8D6F0/RAY3P2MkYj/vEj8/HIc9P+sTVT8ijko/b9BQPxdoVT+FHFA/PYJZP/siPD/HOlg/Kw9UP0VIVj/pn1E/hRdXPwN9Yj+umV8/63U2P349Xj9kvkk/XQBEP39rSj+8gUs/7/dAPy15Tz+K4Ec/xglXP//LNT8CP1s/r7UmP07/Rj9xtzk/5zdMP2PLYD90uDA/tkZGP8WgWD+ilks/C/tjP5zHVz/MaC0/esxMP6LJWD/X5VU/aQdUPxw3Sz+9b1Q/SbpfPwvQRD8TGFY/mV5KP543Xz90D0k/uN4uP5qGTT/X1UM/hkYvP0W5Uz89WTg/i5BBP3xvRT/lTC0/7z5HPwtiXz8bHVo/TVBPP1YpPD/NIlE/aJlMP64xWD/z7GE/h8NSPwgqPz9Kb0I/S8RTPxr2Tz8+EkM/8m5WP950RD90rmE/zsNcP+tNPD9j+kk/HltKPz41XD/1k0U/BZQzP9A1Tz9DakA/5z9KP8MYSj9dGVY/iB5cPxOnIz9ZATc/8p5HP1HAXT9acDI/STxTPz02Zz/C+1U/2J5GPw/bRT8JhVs/gcxDPzI8Vz8KMDQ/VcVbP6FdNT8VSUw/X75ZP1b+RT9A2UM/uHJGP++xWD8pFzs/JNBHP9EQZT8ZnTg/GR1TPyquVj9JKU0/IQk+P6ZWNz/cxj8/iNxLP44gYD+76TU/Ci5FP4m1UT80oVw//5E+P/LqOT8ig04/S6dYP/79Pz/o3Vs/x1FPP1wETT8LtFI/WddZP9d5LT/xDFM/AKlPPyZwTj9DOj0/lvNKPy5tYD8M8WA/DQBNP1ZrYj/pkT0/0xw2P4lxTj82Ezo/F0JUP+V2SD+wRzM/wOxVP6G9Uz/sWF0/MFc0P6jbUD90/kc/lclAP4tJSD8e/EU/F4tYPzQMXD+sF0Q/gSpGP3/CVj/wfz4/4+I3P8WIOz9RXDA/wDtIP6R0Tj/xVlI/",
          "jOVEP00BST/LRzg/iO07P2ssZj8yh1U/v2pNPzJMRT+t+1o/APhkP4N7QD/BskY/FahiP3hKRT8GT1Y/nwtPPw2xUj9c4Dk/+q5MP1FUTj9+Vlw/a7VBP5+1Oz9db1k/JSxLP36KLT+4JVo/AI9GP5FtWT+fFUg/bQVoP9Y4YT9RVjM/uatWP4+mVT8G80Y/MppfP7F4ST+tU1I/kipWP/rqUT+do1A/gcVGPww2RT/CbUk/1gdKP9aqVT+dj1k/cxlGP4d5Kj/HzzY/UyleP9lRUD/F5Tk/IxddPy7uPD8+1zs/NtJIP5EXWz+JBVg/rFZYPzPBRz+ENjE/xCpRPw=="
        ],
        "moving_mean": [
          "nxTAP2qFBz93M3g/rIYLP4x5KT9blDo/iH3HPpIUcT/UFtM+cIAmP/K1Vz+qN34/cH1LPxmimz9/nG8/IH2aPuH8JD/4zOI+KznlPovA0z4LpuU+CSA1P80Kdz+EOyc/T8c1P2TJHz+V1og/PJrpPswwbD+smrc/Nr1IP2p/Bz+/BX4/iByOPwnHhz+UQF4/wz8CP86xET+RG10/3bWMP3a61z6fzAM/6al4PzLG8z4/Dik/vtpjP9NDUz9B9kY/kAPfPlDc4z74TAE/pSEYP/iXDD+jJkI/LNA2P2Jthj+Ccfo+nOIIP5j5iz+LUUk/K/k/P3AKFT9OYPo+NrwqP7Og4T5qu20/S648P/rmAj9RtE0/Q8cQP4WPwj73zeY+YvFGP7EDBT/AvZU+vUyjP7Oojj8toFI/yL/BPmAzBz+c648/gbFXP82rpj9mYG0/4CMGP9FOpj/AaM8+sS0NP7U1LD+w1Ok+1BMkPwSK9T4Q/D0/odMGP46YGz/ukSM/T9sSPweO3z6u+gY/IcsoPxicBT/hNeE+59DNPuF1Oz/Xdfk+WZoZP6Qxrz8jAy0/76cNPz18NT+ZGQM/mLPpPrD0gz9c5wA/QJohP0FGLz9ZZWY/NP92P2hcnD/gOBY/jIgbPw9wij/LMkM/32rQPtzOiz+9ZHI/EK2LP+RNBT+yWLk/znr6PgRlWz8URh4/n7ENP5mV+T7MZ8I+tAh3P97zlj+wrsg+7ccJP7utTT9Q/mA/9wn7PuTGJj9+fm8/1dQiP2iXcj8MOxQ/RxEBP6RsFz8EN5M/jnp+P9zI8z548IY/FIhoP+VqaD9UTFM/6Pb9PoUIYT953Gw/Y6w2P8a1aD9nXt0+zxRvP39Q4z4oq48/KnMoPxM6Cj9h7po/YFNNP///DT+218U/dzWeP22yjz9l5TM/OokYP2QogT/2RnU/uo4wP3poTD9uruU+PmomP+yeOj9qAoo/++1BP5V+pj67d20/zS5UP1UAOD+qbDc/bBgHP2f5GT/qmfc+",
          "rQvpPnLwij/4pz8/2UyLPwRGcT87sEE/trKhP1I8ED+6X7w+mOM3P5d32T+UcEY/k0ubP2efiz9uTlE/xBbYPo8afD/U7rs+3bejPuHuKj9PUc8+25peP2ozzz7qNww/AIfMPhdTGD9kHnM/QwSOP9elHD9gFII/3+KTPzEWUD8DM7E+MEEuPx9uMD81jkY/rwP8PlT+jz9ouh4/BYEKP+gfFj8b1IQ/2MGZPxUmwj/RokU/nYR7P4N3rj5wZVY/AKBDP+u/PT/K6C0/u72NPwocMD97fRw/4eweP6WOxT7OOXI/85YJP8q4fz8t9yA/dMd+P9GwGD9+2Xg/xZEUPw=="
        ],
        "moving_variance": [
          "WDnSP+uHTkBeTJ5AV+5PQPNOVz8CR1dA/tUQPzvVRUDY3bE/6tF9P1DQjEDPUrVAeixpQF40BUE0sa1AL0aNP072cECiaDZAxnA7QALE/D/q+RNA2y6SP8CTkkAns0BAtlHUQAznhz+ymuFAtD8tP0DlqEBNR0xBqOmLP6SKT0AD2ZFAV9PZQI8M3kCohMQ/5iC8P20zQUD7FJFAGzXlQPHgsz/6Nm9AbE2jP8mJvj+/sbE/J802QGy8hUB80jE/vP9NQEwPaUD3tgpAu+DdP79PgUBwmCM/97loQA90nkAsvBhAp6MyQEJsy0C3lg5A9URfQCw4A0CKYVVA8uqZP2gm/T+rAatA7x3TP4gyuD9HJU5ARmVFPyMKAUBxKIE/dW9uQOup4z9WsPo+FKsgQVrw9kBUYzdBb6+kP9Mo5j+0D+1AzFN5QLQZBEGBIZVAc9yBQLUJpj/hd9Q/ASVgQFqMPkCLA6g/bGSzQHUjgT/27N1AOlSZQLpMkUDFkfA/c2XYP6CIH0Ab01Q/hoZ9P/5d5D8CqChAy3+sPxNHX0Bo1gFA5L0KQEOLnz+ZIuY/vtxIQKzKEUBtfEA/y6ApQHtrwkDftldA8E64P2OIgD/BgVBAeJG4QEz+A0H3zA5AagfuP3HAfD+ap2ZAZPoXQO6T7UAhq24/1IbCQFkIkUANk6Y/+eMJQHj3hEAeIzZARzBZQI6TJ0CA96U/wJh1P9UrAkHP0E8/Kn5AQEWja0Cu1WlAL+hLQJoio0DPVaNANNSrP9linUDj//Q/zjtgQGFykT/5iwJBl5TDQOpcSkDngcVACquWQOSAokBKWKY/pwEPQJxYmUDQxdE/5PnWQJDwo0AeST9AZNSIQPSCUEDnRH4/P36PP3M8GUCmZ7c/OZhXQIUPGEBezrk/u6QWQVGM3UBnZwNB7RzMP0MVlkCSqMw/9XYBP39kTUAJGRRAZpqGQCWCnkCb2t5A1sZjQOajyD/QHaFAieAgQCPhJ0BuJBg/2vYIQCQJX0DuZUFA",
          "Dmu8P/sw6UAsops/MI6GP+PrhkDyQ60/whAeQQJtS0BNfOY/G1kPQEHzxz+RW2dA+JsQQWJNmEDxP4NAxdhOQJfuokAff5c/cGNpP538zECKWRtAmM17QMrtHT9WMZxAbAaIPzCRNj/oPKNA+U2/PzSsaUBEAZ8/wowEQb6kQkAk8VE/AcJfQPpSPUCHaHo/v0eYQEaJnj9DO6M/cC37P1JfNEDzsdFAXnoPQbgCqz9RIRFAU4y9QPjynD87EFhAipGiP8nmTD+a3CdA09viQND6jECYYZg/0+rBQClzGD/OMGY/MpilP6L9vkAv+L5ATqeCQMqMQkDSladAlZp5QA=="
        ]
      },
      "batch_normalization_8": {
        "beta": [
          "SN2CPlmL/rtgOce9AavIPbqNoLyxw/u9tYZgPTHkFL4="
        ],
        "gamma": [
          "mTeHP8UFlT9DEoI/GPxhP/lmcz/JUH8/VYJbP6mIaT8="
        ],
        "moving_mean": [
          "rJ9fPzN1Yj/eRAI/hJEeP/lnQj/lupM/ZUxkPyP1fj8="
        ],
        "moving_variance": [
          "fHeLP9/YhEAl/X0/7ZkNP8qszD8vuaU/R4SDPwQMQT8="
        ]
      },
      "batch_normalization_9": {
        "beta": [
          "JqN0vYtxiDzX4QE+w50HPTg8x73zmdi9mJJ1vBDazr1AT589lqXzPfL/oj0R6Ra9JdHfPAE5kr0v9TK98mHUvA=="
        ],
        "gamma": [
          "hzRxP84CeT/yyXM/VlKEP4XhdT9I+m8/cXSOPz5xej8T8XI/LQd2P93sgj+rtYE/xUuHP0Ptgz9DPH8/CJB/Pw=="
        ],
        "moving_mean": [
          "JEiiPt2rYT7Tqjk+jSTGPunOgD5rBNA+Q9maPp0HBj4LswQ/vc26PjqlEj8MKMw+HKbVPrDU+T7kFoA+w6OTPg=="
        ],
        "moving_variance": [
          "WOuZPXUTkD5ky8k9F7kuPqP4wD65OP8+Vnu2Pks4ED4Ez40+ww0ePnp9Bz+nmoY+emxmP4F4fj53fyQ+wWWaPg=="
        ]
      },
      "dense_10": {
        "bias": [
          "5RQ4vnn6nbwwlLS9FjkBPLCWIL1BZOS78BtZPqG6bbzXO2i+TYM+vIykw73UsYw9e9irPa8vhD2IE689gydVvUjg9z2C38g9wcSDvfOKbT0ghC69n+OHvVVAzb1e5Ie+zYzGPWJiNj3Y4z26oB3DPeB7fD3g7ju9i/bNO3UJFr7yuqm7W3KgPAPd1zz5trw9r6y5vbRjML3b+GK+BPJ6PV+oS71Jvl67IypsPZtct73xSvo9KnoXvRRK/72X7Zu9+DuUvfB5Wz062b09xUrivVbDNr3a7sO9CNdZPR74Pb1KIUw9FnJAvCraEb4VCSk9k3AIvYrcKj5c+hM95iWevQ=="
        ],
        "weights": [
          "1y0bPoTyCL58nkY9wQDaPfzjqDzuioE7N5dIvnN8Zj7Q30E+fCq2vs4eMz2/J+s8HNVXvsKEg77N50o+vo2nvaJ0ET49pnO+eJG1vdcd6r2SJk89htGoPsYqvT6WQY4+5x8Hvg1J0TzzK2k+vWuOvePhFbxM08W8o+YevvSqyL0krZ496F1+Phgyh76SP/c9oVhHPfgyCT5n+Cm+X7dovuY1FT6IBD29vJpjvtuqjL1U/+c8mGGnPiS6Pr5zpMw9H/lrPl4Jvb3P1ha+0bWmvbxC4DySlpg7F0CNvSzRSrx6eFS+jJChvne3jj4SZby8gF6fvm1o4DyMS827meqDvhS1nL1rrlc+tWRWPr30NjxX1KI+H2D/PTQAfbwBy08+sR9ZvmzWEL46OAY+WMivvdvEKr293u+8lZ1TPqkRjz3X43q9AVvuvSNpKj5l8X8+e+FXPMd0VjyfZC69vmTbvfy4571lUli+jbk+vszaBr4Wuo++jmwBPu6aqD1zBvS9VCcbPpWTY75AnKw9EH0ZvYlzNz7f2wm+V/2VPL9QWT7lQrs+9wIzOmu0QL1Y5Uc9a8Y3Paj9Q7w7i3M+up6CvUad7ryZBss9BHC4vAY5fT06h3S9DV5TvPjsYr7wXRg9P//6PZ5XGb41fau9dn/QPV7/WT6XACS+SYMzPnMslb31ES89BEpNPupQoD5fU/A9KhfMPRU6pr32i1s9V11LvbMgIb0zOIQ+JyQXPv0lZz6YizU9AQNYPuq5Uz6HvI89b1j/PWAolT169Bq9xbRMPs01HjwOAce9JueLvtf0Kr5Docm9xpAGvniMer6W+CM97bicvmrUJD6au5w+WL+iPRGgir1xw/695rtzPnbqhb6gCxg+yLh3vhHWkjwDZpC9kSR/PavRJj0k9eq9IUQEvWXIcL1WuXW92g1HPla+Qr0Svqs9CKsMPg20qb3lFb49eMnfup4LSD7r3ES+Rqi7PbY8QT78Oyo98ZY6PZVGPD4Pm28+TlZEPigTrD11Yp+9",
          "fPKCPlDoTL58Nw0+V1xPvrvTWTwJMP08QaaHPuV+Gb47JLS9leO4vW1AFD7HsdO9502KvgBbIzwAvwc9IDiGvZHxL77tAw++yfmLPnYTBD4gb4a9cl7oPVNbF73wFkY9foHOvWY/uj6VIUW8u12OPtsEy72SiM29INUhvoUm97zx6IS8xkBHPnzokr2zaVM+uJTFvbLQ0jy0Fmw9dmY3voVqtbvRGyO+TDsnvsT2Fr2h26c8yI9bPl9EkL2zqIM9c/IPPjxLjb5hx24+uiqkvoYzzr2BudM9g60LPuocsb0LiCG+qSRrPXFBV777eoi+M23DPGSdIT4TGxm+e9zXvfJ0Sz7EyX29+6JsvjjicT1ltS8+CL6aPPylNT1+W4Q+l6k7PsXhJr6D+dC8Nf2kPAPRjD6emWc8eIewvTQ4Hz69rJO+ZYRqPZU3w71KDYY9cCbYu9mX/j2nlTC+X64mPhNXSL5ZDWK9pMIqvoJKKz5p7Om8JqKiPe6NxT3eA549ffcLPn5zgT4ZrPy8GXy3vdiSaz6Kzf090JpHPqdmRL5uKe49VWwkPWkZt73FVIe+6jQGPUTKB721558+42bwuzjDL74a9aw+qyfIPd+qDj4YXGW+pz+hvrYCoD6P6lW+7DEevO2n8TzhA0+752BSPeRfyj1HmlG+UuNevmlNDDs8ogE9wjw4vePWlL1RBEG+/bqMPSbNhL5UVMk97VMzvu8ReD2sqAu9Ubs+vabLJ76sooI+BSkhPs98KL7Q0va79mKJvBGkJ76+Luq8IslBPkxQgjzDg207vKwjPrXyYr0bd76+VumWPU2zEz41BJG+1T0KOyHyIL511Oi8I3JKPs5gGj0RbaW9qgpFvimKNT2F6Xc9kuY8PjcdSj4yCqO+4bVmPbQil77tRtE9jBYyPUX777wsp6u9s1kJPpA8rz1Dy6o9GwQOvQrGpr6R/3A8dpozPh9hXT07r388OgkbvczTKj7YG8Y9dsbqPVYqaj6dOO09LkYJvH3U4T3VBWY8",
          "YkovvmZb3L1NbWw+RcHpu5cKRL7qXxq+1QZYPVkl/jylate8zTviuwXbDL2p8D++fuPJuwFdLD44EEK+IuwcPmI/Jb7XNV27trXCPYGcdL660hi9w5Ifvve2lr6WW6e+OY1kPZYhKr5R3Ty9FSWNvs9erjxPRKc9Yt/5PZ8kw70zqLW9HZZMvkX0jL41nRO9fmIhPrwPBL6nWY+97rjGvEfL/j1kwbk9qQjhvB65Bj03kzi+0cPZvegAGr43xoK+/42hPXMHBL6ZdTI+XpfRPaKXVT6BKBq+YQuAvqAejT567eA6lWHYvQSnHb1CzQi+VIHnPFKT17y+R6G9XO2UvnmeX70skQG+F72qPYaiaTwNeIm9F6cNvu13Wb2tbiY9K5+ZPi+yHD5ddGY+sEoMPfwBQT0HVfE9ZTX5vXyLW74MMyc+dKMpPlQlHj60ZSO+ElqRvm/rhr6DLlq+FkROPjLmgj5Wk6A++GLnPZVutbwV12G+hTCDvgEfpL70ErE9HqhIPj8Jtz2idks95882vg0lHb6KODC+Uf4hvmhIdb2DPTa+9xiTPSPEjL6bJxs8YXwZvoL0Tj5xLb89I7cAPjE6uLy75zU9uuwhvlcVKT6Thr68Z6QHPQcjuT1FkYm+3bTiPdK3GL4CL629CzaMPvUoWD2pDhu+CXszvk/BYj6Anxs+8H69vcElcr7JvTy+iH3cPWhaG74PhIq86OlQPo1/+j3H5bk+3MI4PeKhzD0SghW9O0UAPIhaAL4WlDk+brxiPkzkf72V1us9rwikvC9VFz5nFeC9Ij89Pp1O5T2sIiC+74B9PYyGm77pmN68R6KGvnL/F73VkXw+kHU5PidWw72cwH+9Sc/UvRE5uL6Zclw+M261PWmqwL0VOC8+oW2WPjuCyj02WBu9Iq3MPHwIKL6CB5c9ZyVOvAfiUD5R7be+qLbgPLo9fz1iuZg+/Mwyvawt1b0HLCi9TpSIvY76Fr5zpbm9UccpvbUyOD2iaI8+EcOfPcfSRD5qBW68",
          "8H+wOiW/NL1/WWI+0U3KPdF2iLwHk7u9p5x+vsO0Gr7l0uk9I7dDPknNk73foAA9bRRfvTj3yT2Oz0O9NsTyvA6gYL0w+Bq7XJJaPRKSKL7P6SQ+brAJvugrd70OEfY93rEzvhtHADz0Z2w7W8M8PZuHxrshgoo9BggIPs4Igz3XqzM+YNvdPcT3hT5W1VE7dNmBPpzsnzw934E73C1fvtHcdLw1pCi9PuqRvaEmhb1hHei9nHsHvo2l3r3TyVM9DRyHPv0jD767OzO+FbQPvc1nqr1jvQE92wQwPgxLEL3BDaa6z/ynPqL5J71B+oS+Uc92vfwolz5Ezuc95eUevB4N3bzpmlI84NPUvcnvML4a/Qq9ssAivC123b7ibpG7rOpIvZmU/z2virS9Nk7fPcnNej3q/La8d4whvfXX1b03YH49vx1wPlDllb684gM+5skMvmqYsL6+WC8+wGiIvXWkt73yHCm+QISOPvrmfLxuqSa9QSkYvcB5BD6FtMs8JleMvqDMYT4UwhI+S+cZPfXZSL5YKWS+dzslPhoBfD10Wp+9R6IdPcLkYr17pgA+anOdvfO9Ir56BzW+AanaOirNE7329yS+Xp8Vvgqp2D1oi+s9a4A5Pk6pi72QJha9hx8BvscMRD6ubC0+dqvevcgtuTwdsEQ+MIbpvVnO473ztIM+2OoKPrgkv71aBgY+MEYrvpp6HT6OXCa+VzVovX+5Dj4tzJM+jICFPWlpmL7JvGs+CSkOvr2QKb6vgTE+KRUzPga20jxzHec9+rktPr2rPz6mejQ+2D+ZPUjWtT7Kw6q+iLoavsC46L1tyXi+Jp6vO61/Az6gCs27qjsBvofrgL0K1eQ8/FzfvVyRBL6eeDg+GR8OProGsT42SNQ9AqESvRZqIT53SIA96A2vvaZ4ZD5DsBo+u4jUPaRszz2FktU9WrvXvZDQybzK5wQ+nCCyPfPmCj1x1Mm8NCFGPYSiLrtSEyk9SmhKvd1iKz4cPTg9WnpKvVqOeLuBjl2+",
          "9fZRPuiw4L36Y0I9HeQhPvGinD4qTpo9k4e+vtPzmT59lio8zhGcPtZM6rsyqiy+0GiEvtItDD7fbim+u0+3PpCEob57k8s+SaJVPpcpDTyhcd49IFiZvSfjRz5E5PI950Envrwll70kQha9rhNRPuCWWr1C8kg+emipPhhIzr0utlY+K8ixvC1zZL7sxk++hD3TvP3XKL5F/0a8coxcPeAVUztLJ987e61EvsMM3T020jW+B88wvnZJCb7hpLU8dBedPKWAk75EZiW9vVetPjgQhz1nIom9VPcHPh6bjD0PmWQ+NTFyvnQvJz2v8b+8EYFjPSvNZT4XMQg+Sm0xPqxRWj6Hf4W97Vv6veGcYT3/dC29ONksPnmKV74PLyE+JwRju62ukr0B/vI9LTwVPXR5AD4YfYA9es2HvQRCVz3lq709fVOvvS2X7r18IxY65uI+PmTzhz4mRIG+MHqOPkFU4L0whWE9bsUfPhAkyLzStGG9HaQXPkpIWjx0RUo+LCXkPXm5D7wdYp29WparPQSWHT6OfKO9FRn6vX3VRD7V62G9LiuVvYEzFb4Fd6q9B0g8uoq9872l+4Q+sz8IPmx32Twcdfy9p+6LvTm3/bxnsoU+oJE1Pb6u+j0oK5o9VSGAPkAWir0tfRQ+M+maPivrDT671Ha+pbKqvk7q9D3gVZk9/x66veKn/7sAb3a+R34AvW0fKzyzhuq9DcyrProLvz36cnA+lJPdvUtbEr1wIo2+FBvtvPESZ76fmEm981/xvTHsuj6i+qy+90anPkD5yL223/m9Kmo7vKdWGj2Pl809lFSEvum1Oj61R/Y9LWmFPUoUMT7ORuC9DTRwPnxRMj54jkk93AVyvmBFTLxZz60+HvGdO6iFG745PNC8ypbcvU9gEb6XCyy+LVxYvFNYfD7dQMc9icAyPs/MjDxIko48UdJ0Pigduz1kSIM9Xg9Pvju6cz6pTLO9lrqhPr5Lvj2oYos+uT+wPYGstD36rGi9CqKNvtqCiD65bG0+",
          "t6KEPu7lKz78mRQ+q41rPpoXSDzHhzs+sZIjvW8/ub0yKA69Jl/BvQSTRD51Yzi+4/FDPbFoNr1UHBG+3k+cvR1SFr44XUy+cyiOu683DL4SisE8Pj4TPSYH0zz+NN49kcCTvN4mizsRFxu+wg1EvTgNNz5HP489ZBD6vTex07z7ssC97S/GPTjLsLwhoQG+1nLZveo3eD7gF1A+nAByOqlBXj43Dwm+ctt1vpCKgT1Ve5a9nVo/PhrfTT7v2aE9ZqQ9PdpzVL43RKK+o/4QvlK8mz3w1A8+ODf+vdGJWj6ZqC292lWdu2u8Jj48+Wa+n2KhPBs5cr6DMWy+QAFcPYSLcL4UQEI9sqFHvrNPF76kP909j7UWvpqlajzvv989BfrGvpE6LL7sWRk+X4bGvjwuSD42kce9uJG7uzn15bytFkE+9oE5PTgLJbzzJRY+mqGIu8UEo7yHTFq9IIK4vZKuL74PJCg+J5kJvX6xq73SNYW94vD2PXxVab2mqIk9zGC1vQ7yjb4l0eq6Lqk5vGqThj6j++W9vBIBvrR+lLvb9pg9f9JAvFahQ75k7wY+ZavaPV3SUz2HR/i9KxofPR1lwD3v33C9ROCDvps/SD7jHR0+UHPpved1T70y8bq9Fj18PfM6kL3UVJI9DjeKPHTWRzxpqXS+9JY5PmVWQL7Ll2Q+CgopvlHs6T3vXpO+KPt+vJL0S77O3xi8sc5wPpxmnrwl1dO97xeyPEOoMr1/7l8+JzFvvWOvsD4C7gE+LNM2PlVmfz0TC5w+my8lPnzIsT69l3A9pb/5PIlF3j3yGHq+rx80PqvL2L0Yswy+UsTZPVgxDz70kgE+I/C4PS8Gpr3I/aA93NHePJWiEL70LVy9EajcPT6WLT45bp09cT83vni1Pr1sHvM9gkjlPPRcBrogJse9pxJmvtBWTz218gM+pt1uPZtopj3W3OS9EHuVPvsPVz2pB7694NEBvuidID6U1tI9wZ2mPSPzLr5mH1S85ZFcvVEwHb6vOBG+",
          "X7B5PvCTBbyl6Vw+PwnEvZSvor4bhnm87/vvPcOtur2WHJo89s1hvvSj670NUrk+mnBdPkgjZr7fy2s8fJH+PX9KtD1JQQC+V26XPiYRz74NnQg+tnfMvKxShr1eS/09mGvxPIhjYj44kwA9wo5oPlL5M74H3jo9K+lGvXbgSb37n089Sxs5Pq2VDD6D3qm9xkvSvA0JAT3mXH49QmzXvLj73L3xdK69mIiSO7ILv70B7kU+nKzQPU+kBj7Qv7Y94RImPqJFtbxN6YA9LimrvXw5S74wc5o+oAE0vKHanb70IWA9hDeOveC6Pz4ywKC9rM8UPjjRsr0BkzA+X4SbPvsG/r2XvVc+e9grvVdckT0EHI+8W1TAPn89Ob2JwpM9zuijPVzejL4Xqjo+TZhCvj6Pmr7lhCm+opJHPiXbhz20iuO9c+QevmYoHb72M/a92ORSvQcZRj5714Y+TwuNPQEgzbygdzQ+MfH+PMbrg75py4i9RTRdvvchq7y7Nwc+lWj5vRZsdz3M4Q6+4HIPPkZ1Hr4GYzS+RGzBPcVGG76vRD0+gnQnvRApUz45hZU+bRC+vE+rgj1TbPe9ZTi4Pf4WQj12CZS9vpiBvoPLYL3QuhS+f4WGPkhYcb5Tqhq+y48RvcYywz6mKLQ9Ip3RvGWyIz0BLWY+uv8bvvZIE75/vjg8J99AvctyEb3/Wme9q/PSPAYIjT3VWIK9iSakPT8wZbyYs2e+2PDdve2GKz5DJcC9CVMPPVXeeb0K/qQ+bm+8vdmoEj4b5KS9k+/2PZ3xCD1SvVc+YpAmvpv7Ub7cMLg9F2jNvFEmDL6W+xs99riVvdretT0Kljq+NOsNPiJNYT4lLse9NBadvmxSiz0qSoA+Y3aFPh5bzD3cEo8+3st4PvhxTT4uv026XffUPN3wGr6LH2e+4KCpvLDq8b3vMyo7X3Fcvp1BK74Clvs98xUjPXQqoL5csSU+4iI9PpMHaj43bUQ9om+fPWAKzz3u+aY+FTvUO+M1gT5I71q+",
          "Odw2PLDctr1264U9mCP3vWKE4b1/HaY9o4P+PTa2Fr4fb1U+BbijPRQPBruXKxY9TksQPkH+ZL17rRo9UnxAvVl6nT6cGBA+hoT2PXjcqD0agvA9hckSvXyqdr6JC1C+ZlRSPGYwOj2o34c+QXeQvheC4bzsdnY9F4cMvk18t733Zoc9W6/LPRLk0rr/82U+sdVCvjfgGz7HpMq89khjPt251b0CKeq8dtOwvthktbzncp69lc3gvZMtj77OQkW+NwnOvGku9z0WOhs+W3oFvRzCnDxILig+EYUmPP14TL4nOCw+vKjGva0Q7j1B8oe+12VrPm4uoz4acQa+kJiBPJCOqr1SAha+SLu7PVkUiL4163M+8nGavBIcJr6KtXE+w0wQPpM3Jb7NqQE9F0PGvsN3wr6zaXo8UljtPUG5vT0DUiw+sbWtPhM3/rvPJAI7kBXNPEz5CT4uHVm+PmP2PZLLQj6D7Cm+a1YnvU+hVb0rVVS+qP4CPjwmqz7zejO+YsNHPYgdBD4IqwU9e1o4vBMnWD4Eoey9sC2Ju1yYcz7aOa0+o1mYPlLqLbzl2+W7nR+LPlGxe76HmyK+1qNCvGZf1j0wRtW8jsguvVE9Ej7NHuG94wJzvoj1+T1j2cE+Z9M4PpCiYz6DxlI+tBohPjvzlz6kMBg9JjO/PUC6jb7EeNO95wSTPtr+k7ubYz4+O7N5vWrfiL5/X7A9pNEbvujhBD52Rs89deumPVCVYL1sw46+fn2wvv3+zr39q7I9Xt5svZrFkD3vQR89k4GNvPrXZz5kKe89x9N9PgUOyD10IQc+S4CRvsuaYD7CLE++OiUQvlgrYb6/TJG9w7mYPpCNtTuIa3g9BDaSvac6MT78rXE9fMf7vdPOkrzi5BO9aVTbvIVjkb5U7PC9m0XVPfJIPr3uXjm7LXYZvEi4aj4CMJa+UrO9Pi7gP75A6Ou9/7E6PvM43L1sEUY+uEgVvtfyhr4taZ8+H/M7PtLMGb63mcS9c822PGZ4b71lMo09",
          "XtUePuYFxr1yFG2+O/iRvDT1Sz1wJi49YY03vmCeLz73OH8+SFggPEZd5bwSwZ49qiGlvkmjnj6ZZG098Qf8PFQohL50hSE+A105Poqgtr2N0ea9j23qvTLrlTy6kYi9E0OwPcu9qDzfXGw8oiTvvWroXz6j8Uw+NKdfvrVl6r1vBYK9PHKIvFWrQr5hfLc9jN7YPdp7gr7drdk89t65PDMB1T3wMLM+rY8ru/nZvzzSfDe+inraPSqTJL7jT5E+/OLDumqUnbxseXS+4t88Psdd0j27lEk+v/lDvfPKsD5cCoG9usfnvX/FsLp2sES9kul+uQT+qzwg6a49Su8OPsFtLT1Lr7Y+ZH2BPY4+pr1WX7k9sOQfvN6gCj4wzjA6uc9EvZApR75eZj0+3Rq/Pn/oyL1D4Ag+CDowvsT2kLup8EW8q9MgvvXYrz6oFjU+Fr18PgLqP738o1k818iNvSrwfb5dbyi+WOJhPtSC/r2Ccn08URtbPRJ/wz26U3K9NsVtvexvKT7LQKG9G2hiPWLXirv2mh++YeYOvkltyT2NYqY9Nq/6vaeqgb2bv6I9glBqPne1Bz7NsNs9hBdLPr06Jr4Jb26+NLfHvsuY6z3WyrG9Y1lkPXE6L74vo3C99ogSvpV9LD59T5U9gEnWvbgEGb5+7Eo95c8ZPlsBAz6PEgK+kQH9vNJwUr6SbxI+EndLvQbzKb6/tp6+VKtNPlBymz1+z2Q8N8sQvlRAo70TEpw9PPDhvT1yLT6MLIS9rwENvdlWij5+8hG+rCiEvTfwXr07liI9lO+XvYulV741TES9gXZfvobEb74e0GY++IRxvus0Ib69jhw+dE7vvWgPR77N9z8+6h7uvaj7Jztv/Ai8AsJyPiAbrT3o0Zi92X2mPKJASrxOuSk+3i4hPl+IAbybpOC994cuviQLAD77gRW+FCDwPW70BT4PmJe+xxwAvvkuV70Wysg800Z/vql4KT61EzA+dfQNvuHl+bvdGyG9aeuAvtjmLT5ctCI+",
          "vvTovD5vTb6UBws+wf+dvQhSEL6bI8q9ucjMvda3uz1SYWU+6NFLvPPNQrwQlT++O29Zvd57MT6pRbU9q6nNvXPqzr0LmnE+Lw9BPtvdnzrlME0+4tuFPUURKT13BGS+nKs4vpQ9G74Mc3S9Y/NjvU3lRz4eL167w4s9vRBanT7egia+LkVEPkQPLD4Vefo9Uv2OPb9MID2i25Q+iC/cu9zQqjyVRqA9mYotPQ4Bmj5wPiK+aSZSPkOhYT3a+W++T6+MPj5e/D3mgDQ+m6/JvdnCsz5GruS9c9kePqfxBr7e9ps9wxsbvuILNLwWSUK6Bk7WvYnmZT1BFUc9B1v+vWozVj53Oa+9NsqdvWywdD0sBjA+MoMGPi5y5Lvy03C++LMzPZVh7D2Ig6+9/GE5PksMN70KMKK+tejfvi8b1b1mgrw9ZXN0vcc2ozy/QHI9xNShvSRmIj6Ewq69LrJAvSNaW73yNN69MHaave3rjz4VPhi96CTOvXhfYL76ubk7as//vSmb8z5zWTk9qhvXOsnZcj4sMcm9zf+tPh5fAj4I3TU8Pc8oPstlPL6gTpQ74kRUPGM+YD5FHYA+bDfBPj5oBTtZjdo9eaIRPL0YUr0Hzow9ctq9PpSBHj4tlak9KKgFPnZozjssH2Q+zsraPfFnMz62lp2+V5skPutnTj5WukS+pHlQPsKfpD6LXrO+SQnhvVLBKT6JBsm9fbXrvL8XET4zEkS9RrW1vMdIjLonkKo8Hd8dvt07Zzy+M1U8tsAPPhzMcT00jta9XO6nPMaM8TlQdHu+/+hKPkGwHD6PCjw92ePOvb3ZQr6Nfoo+5+6FPtXDc746rcI8EaFqPhEpNL6sjR4951YyPuOtJ76N29m9peGmPjVlS77c7Z++YtnlvfAc9b0NMSQ9vn2CvQ4KUD4vE4w+dpNGPgOzKb7wlUo+KB44vfc8Gj5W60++yRjuPdAXgj6kzNW8LMqcPTXQu71tHWQ+BGo2vheC972Qc0a+LIUnvvFhjb7nUY0+",
          "bWRWPo5F0j2TMwi99+I8vk+YNz7LVpS+9Fm/vim/B764Kos+DOnLPa0zjr7NQ5a96yIXvgpN/720t1G9E542PeOwpL5Ne5Q9/9YBvqat0L32oFQ9GMYlvmGXgT4gVZ097tUEPpHZHT54QRi8QjaFvSovmj0zFRi9a6TRvfMhtDznZK482P4GvoYPkb3YOWI8QYI6vVhOFz6U8HQ+Gwl4PoXXWz72eGw+FX6Xvvt1j758iS++y8vtPGL9Nb0lhjO9LngKvXG2iT6DMR0+PPXGvQVHBT6QYUM+VkiuPi0lijtle5U++r8CPrSFdT4mTRG+cTWRPjD1pT28Tgi+1c9LvHtI9L1wrQo+04g/Psl9gr06f7E9q5LIvarZmz6+o6K9TMQzvUi1V73aV8i8+fL2PUP6XT0Ger4+hJn3PXxuljsjUQC95xnRvYHFNb6Tqmm+e1sivhJ7hDw9SAm+qAqbPelesTwfYtw9CXYOvcUv/L04iIq+TJ10vduBPb5vmI4+L9uQPl88nj1SWp29hhORPbn9dzwL6hM+xDuEPbwlMTwdjTc9FvbCPanwOL1Ijd68IzKyvgnscz5TRDs97LOevvhZj74HBuI9ZR77vbteQLyf+wk+bYQUPomwUj7zUHc9SJcIvtQe9T3yma68fD2JvftRoj45AH09I/mgPBedaL0="
        ]
      },
      "dense_11": {
        "bias": [
          "JAxDPaCMBL3MrwG+T1g+vevvyb2Nboa9/PG9vH/NlrzYpf+90H2evXH3Q77hBBk+J18xvVzcNTzbfam9THPQvKBirb30kNY6r2csvZGJ6L3H4iC9ubODPLb59j0wcyK9FKumvRB6Er06ORe98sOCvHxv1z2dkai8ZRV/PfxrML0j5AS8DJinPUp4Jb2fkTm95qjXvQnmfb1U9/M8cmIuvYF0YL1fh3Y8FksbvWBUnLtuy1692kI0vigqnb3bQS493xWwvf+nnb2dTgs9KIDnvNdplr0cJT++B87YvH8bSrvrsw89cNWgPDsICjy42DE9fwdQvfGjfDxSKAE+ZoHZPStfIj61gQo9rD/lvRUPL76k/5W9GTfIPVvEUjzkWgY7KrJMPcLlBL4NXUY9VBA1PfNBA77fDJa9KOKKvbT1hTwceyM9yFMRPejdRz4KUxg9bg67vEuWqz3O7be7ngsNPcqSl73qx429svCjvZqm6Twv5dg7A4cAPTZp5jxwDJa8z8vxvY5rqTp9O8y7H92BvTt28rwhtFw9nMeJvX3g47w7/nk9+b88Pdy7rTlPGAm+NWgwPaxtAb6l8JW8t/XRO4q41TzRTbS9dYzDO+fcxb1cC5s73N77vGSiJDxSBQG+WJSTvbLcy73hIlQ9OUv6PPs44zzHfOa9XCf5PZ9dB7w="
        ],
        "weights": [
          "SM1VvLl3D72XdEO81qxqPbqCiD0BRfw9/upJPWjnBT6z2bQ9qEa1PahsNb5ZGok9lnI4Pei9pr0adYi8SF85PLE7KD1QAg++ga6nPYhubz7A3HE8CmBWvLr9Tb402Oq7/Aw5vVy/zTx8SRk9io8Qu1Awx72h80C+/fg3vV0Zmj3v3NQ9ilrIvaQjKz3dsCY+nkIlOiDfkr0Z+qU80smFvF2AB7yZh149TNuDPQ+T1j3AKx8+SGbqvUCIFr3pChE9c6FBPpM0370xY1q9ED0XPqmpOD1fGEo+n/gwPZJpBT0BYJ2+ZcIevqzNsT0JxF89oNW8vQ26nD1oxvc7mtOhPaDcYb7EvCk9KCt/Pvsdbb0WGs69vXQovrVzSz7E5WA+2Oc4vfu+Nb2U+ii+VR2TPWgwuz35fBU9ZLzLPYgtKzz6da29WQPmvPzu2b3XV2s9BJXaPWFCOD13P2Y9ukM1vcWGAL6WZPM9fAlYPlMouDwUWDy+EqUHPSAn3z1r6h49b1Wxvfl/IL4X+xI+/hlTPYwpob3lUIg8FnjTPV4NXT3YcZ097/rJvBB4DD0D9xQ+8HWxvI9GoD1OW1K9+Ay3vZoqtzzehoC9zXOrvZbRpD00Bt09vFKuPTg9gz5jl0s96mZbPUVVxzwYza49hv0evvUhw73DfHm9+jUsvnVQF7xSeK48SS45u4XLRL2aK9k9UriwvbKGNz58Jp29tW11uxr7zD12k9S9W/3qPV11tj33WsY9vV7LO96KyLykora90AeJPRV6Cb0Kg8c9Rz4SPmOLHT6ZNNG99A/1PQQB3b0plqI9VE7AvYZr6D2C1IS9upnhPR+hAz7ERtM9KMO4vNd47L36/qu9McBqvhgz/j2Bl2Y+oh3GPU9nn7zjoHY9VHnVPcMkCL48ZGW9pabiPSczBz3lFRa+9TuRPbQGsD2d4kc9zU1ePpv6ET5WXKG9rYqlPbKBEjswOvU8LrMqvtL5jT1l73A9LL/Yvdjqa74OvCo+Cr/GPMCfpT3Ma2S+",
          "0ipyvh/pmT18tpc8SzYuPZSyzb0uMqQ9o10DPYS/KDw2LdK9XmypvXlsoLzkLPw86rS8PSJNvr1dNri9fZvKvY46hz7YKq484azjPezKyD1Hi+G95sePvDbV/D2Wk1S9dII5vvbcMz3Z/wC5NxUEPqAJqj6Ta4G9smsEPtaG173s/928zdcnvulUxb2H4Ig9XwUBPCUlIb3RMhe9ljzPvY43vL3UhMu9JPFQvWj6rb1i8qy95xRDvnmCCD6NVPM9X8EDvp6h/z2X/bA75dvHveGptL2s/nC95ebZvZrVpD3nFwI+cirPPDfr4rz5/Za+/AD4vHwshz35gl2+4GkTPYK6jT1Lhm8986IFvpYpPT1JL909YSSVPDhNz73DLGE92/a0vSBNv72HfN69w0KIvajmDz5QGy++fyYiPVnPnb0QIRC+A3MNPlMN0L0V6vs92OOgPO6LAr0FSJQ97DmpvRN5m73ubCA9aGi0vdBixzwHGhy+WLccuCJGCL65ENg9AwmpPVyHNj5o2mo+9zQ9PSr5AD7a5d68CrSdPbn2nj2NkYU9oGrGvcO2O73loH09GI8CPov8PT7ekQK+PGUbvtbbA75D15G9X4UuPm7TPL5LIMu81d0ZPTFYGD6K45m9UJp0vekmjb1ME7a9LNaqvJqKQb6Buxk+FelKPLecEL4IwNy9KqhDvYu6OLs2OBQ91modPRGjXr6a6sS91tanvXJxI760EGs+WJKyvSb4Fj60+hK9JZS5vYB44L3BuXW9OxpDPdNEMD4fLaM95peVvHuusb271wO+6Gs9PkV+8L3RpeS6lQ+LPa/SrT2f9gI+yEFVPixmUr0lKku9VCcTvZ0v7D2RXXO847MlPt+sEz7W6J29e+0SPsMBVD5wMQq+U++vvKaTDT6iEZU9n2m3vRcBqLxZKlw8Gw64vQv6Fr3ZmlM+nsWUPUBK0D0h6o89L10ivl/jUj3dZ2C+Myj2PF2dYD2bdYm+hteYPR4UirwQxz4+Ma0QOyfzVb6Tk5G9",
          "WjvSPRB1mr1DHFg90LIXPXgWwT0QVC+9UMLZu/1zsT1iJ5Q8PeNnPMpt4z340iI+JxSVPSwb/byjrFu94ji1PRCDAr4AtO+8m1mQPVKYor1/5s68K+GyvUTZQLxy4jC+z1Y3vg4arLxUFek9MUW2PHPjPb0o72i+RAqpvUYeq70vw44+OrC3vDZ5973m/es9WyvdvUiSlzyVcwi9WXDtPJZeeL32DSW9h4n2vcDjH71pBYC9YEptPRB4rjxT3mY9P6OXPU9qnj0+Oxc+fsw9vQWoBL5O1gG++8sQPgUhRj01Ixc9EexFvSrHeLz/l8e9Bbj7PNHlVbv/Sco9TurrPeiDCDvWct29Vu8NvgvGML71x/S9ED8HPt4N97wcmgk+7DCJPX1VET5NSCi9O0pnvcoVEz4AcUe+0QNFvkdAqD32kD2+I8RZvjJ7EL69Sy4+XVyPPXih2T3yaF89c+WqPd1XIL3CYC2+7fN0PPgMbL078Bc+KC8OPbpvVD2EK0C+a5c8PThyLb4Kjio+bqDHvabAgT2FOxy+ifuQvYzRQjoAwWc+o8dOvT8AsL3CIVi9gHXWvAO5DD6IeqO9+7osPk4zKD7FxVm+7pFgPPGe1L0UVaI9uz3PPfuURz63kc28ZLDMPXAVNz2/sz49eyd2PeuRQD3WVZM8l3oGvbHzQT1VIQA+Q3QdvYlIQL5eneO9S/kJvqh5lD7dfuq97XaZPVl7mbwrEr28dH0JPv/2fj2Fr3W9O1ynPQQVHbxL4Bc+Q8q6PMSlKj7e1IK9x/unvGnxkb3HdFk+95B4vAD3uj3pR2Q8gDnDvU/alr2ATf+9Ms6dveDPqru+I+q9RtQBPprHlTu0s4W85jmVvInN7D3m6/i8ckZyvWIlzj165+096D9rO2Ibrz2IO/U9g9OqvKu3J74vQGk70qoVPhRrOL6LN5S9i5nCPW21Pz1wwF0+IwzVPdm2QT4ttv08rb75OxAuMj7wMic+xzTUPNG/oDxzHE88hErQvaxLpr1FWI49",
          "azUmvSBSLz2Zh109/g2lPesrHz6F/ii+VKRkPUAGiD2Y5m0+5qO5PbNZpb3S/Pa9KDaMvfKoa77i1ta8BlO0PWoi6T1tjn456QaxPWRMfb1XIY+9lZSSPEJMDr22XY+8d0oGPjCcAL3XlSo7ld67vQC5WzuD5869mxPMvTYqCL6WVFC+sB73vElJFDzjWx2+vKtMvouC7T3Ncpa9My7qvRSJIb6ZGCG7T/IYvg/Ar71/kBe9r4UKPIe9qz2+gLG9DaqpvXZQTT63EFS94ygavt4oYD46TDq7EEQnvU4S6b1rgSK+lAHCvZMblr3UXBM9ojDUPXIjvb2Kc809Fw5wPhe4nDx+tFa+JupdPD4pwjyEOBk+dg71PCcmsT14E5w9wSdNPqEHvTxH0kU+ah41vqbXHb4kzLw5shXGPR++Ab773XS9GGnBvZMLBT4Q6uO9z1VePiZ8pzxetKK9anCQvSnQAT6K8CA+dXZgvnKh9TzPUwm+cdzHvO0Nyz2I3vS9P8EZPR1NbT17fju9gbQrvZnilj1Wjra94D4IPq29Z70k7HS9KQlpvGo7EL4BXmq+y2m6vaT8VztnLfK4t9fFPIPCOj1Miis+q9GDPpyAnrzRsbq8kJ5CPYsohL3LrSc9X3/yvUo0gzyofti74mwtvX95Ur2WWxc+VWxBPjpLBT7gg2G9IJOpPKJY6b2YO5S9Vu6EPWrOKj7IkI89ctoHvt9kt72TUQI9AFWTPWTI0j1x0Iw9oh/1vFPF+73aRak9KypbvZcmf72SkNE8uJXrvU1AOD2p3D2+N6V8PWXEqb1FkIS9o2YYveFkTr4GiTo9jNJNPhwtWL75aEG9WVVtvsqJPz1tTCu+ateePJy4Uj6iLbI83Ze3vI14kz1Yy5Q97oJ2PVDr571wsjU+GbMGPTX0A70wj169Y22evBPWNb7Hd689CKP6vawAMD18GDY8B9Vhu82Lnb03u8s993hxvfpx2b1dP/K9gF5yPgZDPr7+mq+7fDpovWW2cT0gtcW9",
          "QXksPJX1M7ub6y0+L/wVvhtLCr32es+9HTYuPRssVz33Cxc+XO0jvr5h+ryfAP+89XycvFd92j0i88a9JWObPcXLrz1G9TQ8pPrSPQvV7L2DlMK9YTUrvtSwuT0KJ0o9zKbJvXk12rzqNdC9eUmavd1MlDzIsBU90HQHPZGPBb6tnra9jwEqvcqwhL2F0q09S1w5PljKUrxaVEW6wphyvtftCL5AK+O9FkmXvlYfPL4VmG693R6bPSoTAb02Enw9bI+9uyxaLT6gopQ87EfwPCQ//70QFNW7qYbRO19Zp7yaOru9FzbyvV8pKL3F91K+tYfLve/OYL33FPk8uDmgPYQtCr4WN9q93rIRvDT+3Tz2Gou9mtcQvKCmF754lgc+mPd+vA6IKb5AG+I9Jw6CvfGNSD6CTOK82W1rvTWLg70WpA09FwcvvJtXYj3nuGQ9dUkVPWw6OT7CGRa+1F0xPt7rCT4rC6c9cPyBvRStzLzKarA9fK5LPT9lHDysTiy9Um+OvVBCD74FdPs91qwFPuRPRb1vpWW9uk8DvqRMnr31ef48ztzjvW+gwjsKKoe9skhtPZrIKz3OnLG9W+1ivvFDuz1ArSe+ry5/PQfLurzjzx4+QCQ7viVmn73gCiU9+zO2PZTF1TnJC6a9GOI0viEXxb3WR9G9cO9VvidhUz2awqq9vXiFvZc76T1WvMQ9TQANPXl0Wz4teF0+E8KJveDDAL7CK767ZhDCPeDAHj0tHqe849qTPSOqmjz+x/49hv8HvqfDdj4gRts9yuknPXontT3/RMc9PRqyPZkECb7ll4U+FM3VvUIxET5UusA7qVhRvgPWLD6/WIA9rscPPpEYe719HvK9Q6UpvfqF3T1DToi9ItmavREZxr2Tbum9zMXOvSZHdT6uF8k9B0kIvkpoCj6kH94933OqPOJXG74SQAk+vJ60vUdG+71BvOU9zqe9PaFzXDyyRhI+1A0kPuGPCj4yWF4+AjjTPLKCvT29KMS8ZLpkPUq+QryiyPE9",
          "CVazveI44723bYe9z4E9PrAh5b0SAoa9XsKHO84K9D0ykyk9Y2quvTc5TbzOiS49tVx7vg5p4T0t6hk+0qIbPTc0B74b2CW9YguNvezX8zyLQls99mMCPTnwvj1casi9B1lfvQHEiDwvtjO9fciQPM1YCD6WTrE97suSvJkYDT74JyS9TbfFvYGYmz0eV4i9gZfLvYddNj6w0MS9nxsevg+FFT7Vhz68w1MdvrVPsT22WtS9oXwoPZrOVj7VUGQ+IugYvNOy0j04JFQ91bACvg6ZhD6GB4Q7yqJ7vE0ECz6/zS2+MgQIPRjFT71zI/S90ecgPnNC+z3qTRs+DIfIPWLnNT1tjKU9Ke51vXywYD5pIfY9kQzLvSPFgD2VKGy+uzwmvnQpor3RJ209ftoHPkNMmz7Ojiw+TeMRvBFWNT335AU9qrA/PYQnDD3HWpO9HEAIvmetuj0zW8U9Ls2JvWm7h73+Ov+8sUa8PWREpj0X0yc9sjAVvnFtjL5NQSW+OBP8vKnlMj61N4K+EI6jPDsQST4LApa8TcsDPAkNjzyI4oc9svRyvRJA6z2/EAC9p2KtPevQUj0ZCSA8RE6UvYuvgDxqT3y8T2XsPLH7LT6MjD08F2q/PcnsJb6JLoC72aZavpcBwz0OPOQ8e3QkPsZPJz26PKK9ltuKPYSGvr1m4Cc97tuAvpx9Pr2xWrc9Zvf4vZmslb5oVjy+w6fkvRuB7DoJMVa8UDVGPdfvbD0K2aY9nIZXPSsiGz1f9U09h4P7PAR3wj3yVEQ8lPLevbTmXT5n35a9ykrVPU0x2r3ILRG+8DyxvQJN9L1rIAG9yfHjPe0czr30Shq+c9unPqcQkz6UgpS9REfevOj28j3d0e27nPUlvN3Qij18Hs298iegPVyFMT6cJzG+NKR4vfq/ST5lZqS9u+SzvWsU0DvfV+M9SpFbvSHjfb1COhM+nTVCve+/2jwcfZq9UenMPSxvDD63boY9x+emvffk1r2c7Ri+Q+P/vNfBVj5+zRK+",
          "bA58Pcxjbb4ttKq90m32PRIJNr16LJU97H39Pc2gpj3614m7Bp8PPmyhHz4mc5w9lsmqvKnqxD3iJp09XrUcPsGJGL79mkG8mvwQvprpbb7YJii+5IzyPbqTg71HsF887i21vFUUKbzof4g9oWoCPHuuiz6Sv5I9IlAtPtg9SbzECa49npx4PBR+IT77tAs9hd3avNZs7z1Ku9o9WxtmveDdCj7jgvU8Exv3PaxLVT5h5xs96fAjPojJjz28dN69FO8UvMZCYj1NVRE+3qDaPXo2az7NTiO+PKzHvYOJHr0GIBM+02P8PT8aL705xBY+eV/pPRiilD2Q4S4+0uluvBEQ6jzf0Qa+M0a5vazaNL5yRYC8b1T6PAihRD6p//S9qPpMPa1GWj2C5Ik8S6KDvvLWjT0cE4o9/a7HPfTQfT3VuM47XDUWvXW6kD3YgE88l5N5PsQKmzwepxk+81Afvphx5j0lZi8+kWtgu8ho3D0DMeO91FdmviNA4j2xdT09Ou0mvBvZGD49yLC7fHYdvjLOCL3sJ0W8e9DaPSriQL3v9/G9BvgXPD2WCL5aYHW+8RtpPUnmXb3w0MY95CBFPlxSFz6mZlg8wVbfu8UU/L1ZXSs9P+u2vRsGeTyHtjO9C5ZdvMlnLT7lMDO+OkiuvQd6gD1nIJa9cJqJvT4rD76JFOY8Gux5vTgeXrwv8TU9NCQRPjXepbwxMkc9YEQlPsV+CT7vYFQ+5305PiGwkTyPlYc97r5pvR96drxNfDe95qzfPXVodT1DNyo+zF0ZPqlRPjxnW/+8oT1UPHEWOD6Hqpe9Wl0cPpoJUb4MfHk9jN8jvqHZhb0U46q9RScPPaU0Uz5G/wm+gU33PRzN3T0IoQQ+8Uj8PcmkDzxBW/m7LyjQPWb8irzEUYg9ZMJpPfZhZT7baQA+ZtqYPJXlITyd1oo9wK8nvlb5k7wplSO+akkhPTqamD3VYUG9kJlDPm/o6zwF2q88nVXGPRGbJj7/ODK+C0/mPUTLDj6FIGA7",
